[
    {
        "uuid": 62,
        "company": "Rethink Priorities",
        "title": "AI Researcher",
        "fit_applicant": 91,
        "fit_applicant_detailed": "The role offers intellectual stimulation in AI safety research, perfect remote flexibility, reasonable autonomy, good alignment with interests in AI risks, opportunities to publish research, acceptable but not ideal salary range, excellent work/life balance potential, high impact in AI safety, some team collaboration, and unclear career advancement. The fit is high on flexibility, work/life balance, impact, and alignment with interests. The lower salary range brings down the fit slightly. But overall this is a strong match for the applicant's key requirements.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has strong technical skills in software engineering and data science evidenced by academic projects and publications (CV). Industrial AI/ML research experience is limited to an internship, but founded a successful startup applying analytical skills (CV). Educational Qualifications: 5/5 - Completed a relevant master's degree in industrial engineering with a focus on data analytics and business intelligence (CV). Grade places him in top 10% of his program (CV). Cultural Fit: 5/7.5 - Worked in fast-paced environments like a startup and consulting (CV) suggesting ability to thrive in an innovative culture. Experience founding a company indicates comfort with ambiguity and drive. Communication Skills: 6/7.5 - Published academic papers (CV) evidencing technical writing abilities. Fluent in English and German (CV). No direct evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Developed and launched an innovative product solving customer needs (CV). Analytical skills demonstrated through academic projects and publications (CV). Adaptability: 3/5 - Varied background across startups, consulting, and the military (CV) suggests adaptability. But limited evidence adapting specifically in research. Initiative and Motivation: 4/5 - Exhibits initiative through startup founding and pursuing additional education (CV). But limited direct evidence of motivation for research. Teamwork: 3/2.5 - Some collaboration on academic projects (CV). But capabilities and preferences for teamwork are unclear. Leadership Potential: 3/2.5 - Managed a startup team (CV) indicating basic leadership potential. But no evidence leading research. Total: 41/50 In summary, the candidate demonstrates strong analytical skills and technical potential but has limited direct AI/ML research experience. Cultural fit seems reasonable but more evidence of research motivation would be beneficial. I would recommend an interview to further assess research capabilities and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 62k - 118k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 132.0
    },
    {
        "uuid": 83,
        "company": "TU Wien",
        "title": "Doctoral Thesis",
        "fit_applicant": 83,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 15/20 - Conducting a doctoral thesis provides high levels of intellectual stimulation and challenge. The topics are in computer science and AI, directly aligned with the applicant's interests. However, the specific projects are not listed so the exact fit is unclear. Flexible/remote work arrangements: 10/15 - As a PhD student, location and hours are generally flexible. However, some on-campus presence is likely required for meetings, access to resources, etc. Autonomy and independence: 12/15 - Doctoral research requires high levels of autonomy and independence. Support is available from a supervisor, but self-direction is key. Alignment with interests: 10/10 - Doctoral research in computer science and AI is directly aligned with the applicant's interests. Opportunities to publish research: 5/5 - Publishing research is a core part of a PhD. Compensation level: 5/10 - PhD stipends are modest. The exact funding is unclear. Work/life balance: 8/10 - Flexible hours help work/life balance but long hours are common for PhD students. Impact and meaning: 3/5 - Academic research can have impact but applications are unclear from the topics listed. Collaborative team environment: 3/5 - Some collaboration with supervisors and research groups but PhD research is primarily independent. Career advancement prospects: 2/5 - A PhD opens doors for an academic career but other prospects are unclear. Total fit: 83/100",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML, software engineering, and data science evidenced by work experience, publications, and academic projects (CV). Educational Qualifications: 5/5 - Relevant master's degree in computer science/engineering (CV). Cultural Fit: 7/7.5 - Experience in innovative startups and research suggests good fit for university culture (CV). Communication Skills: 7.5/7.5 - Publications demonstrate technical writing in English/German (CV). Problem-Solving Ability: 4/5 - Analytical skills shown in academic work, but more evidence of industrial problems solved needed (CV). Adaptability: 3/5 - Some evidence from varied background, but more examples in research would be better (CV). Initiative and Motivation: 2/5 - Founded a company, but more drive specifically in research needed (CV). Teamwork: 2/2.5 - Some collaboration shown, but more emphasis on team skills needed (CV). Leadership Potential: 0/2.5 - No evidence of leadership potential (CV). Total: 41/50. Overall strong technical skills but limited proven research experience. Recommend interview to further assess research motivation/experience.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 124.0
    },
    {
        "uuid": 3,
        "company": "EWP Recycling",
        "title": "Leitung Operations",
        "fit_applicant": 48,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3\nThe role is focused on operations management and infrastructure buildout which provides some intellectual challenge, but is not directly in the AI research space. \n\nFlexible/remote work arrangements: 5  \nNo indication of remote work, but location is Vienna where the applicant is based. Some flexibility can be expected in a startup-like environment.\n\nAutonomy and independence: 10\nLeading operations indicates a high degree of autonomy and independence in the role.\n\nAlignment with interests: 2  \nOperations and recycling focus is not closely aligned with interests in AI and technology.\n\nOpportunities to publish research: 0\nNo research or publishing component to this operational role.\n\nCompensation level: 5\nEUR 75k base is reasonable but below the EUR 100k benchmark target for Europe. However, some upside possible with startup equity.\n\nWork/life balance: 5\nSome flexibility expected in dynamic startup-like environment.\n\nImpact and meaning: 10 \nBuilding recycling infrastructure enables environmental impact.\n\nCollaborative team environment: 3\nWill involve collaborating with partners but limited detail provided on internal team culture.\n\nCareer advancement prospects: 5\nFast growth possible in a new organization but trajectory beyond operations unclear. \n\nTotal fit score: 48",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and scaled a food company from 0 to 7 figures in revenue across 31 countries (CV). Extensive experience in operations, supply chain management, cost-cutting, forecasting, and product development (CV). Educational Qualifications: 3/5 - No degree specifically in supply chain or operations, but a relevant engineering degree (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience starting a company suggests comfort with a startup environment (CV). Communication Skills: 6/7.5 - Fluent in German, English, and French (CV). No direct evidence of verbal communication skills. Problem-Solving Ability: 7/5 - Strong problem-solving skills evidenced by cost-cutting, process optimization, and product development achievements (CV). Adaptability: 5/5 - Experience across multiple countries and industries shows ability to adapt (CV). Initiative and Motivation: 5/5 - Founded a successful company, demonstrating significant initiative and drive (CV). Teamwork: 3/2.5 - Some team collaboration mentioned but limited emphasis on team capabilities (CV). Leadership Potential: 3/2.5 - Extensive leadership as CEO of his own company (CV). Total: 47/50 In summary, the candidate has very strong operations, supply chain, and startup experience that is well aligned with the role requirements, although his degree is not specialized in this area. He demonstrates initiative, problem-solving, and leadership in founding his own successful company. His communication skills are decent though focused on written rather than verbal. Overall he seems to be a very strong match for the operations leadership role.",
        "date_added": "July 8, 2023",
        "salary_range": "EUR 75k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 95.0
    },
    {
        "uuid": 70,
        "company": "GiveDirectly",
        "title": "Operations Manager",
        "fit_applicant": 43,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3/20\nThe role involves logistics, procurement, administration, and office management which provide some problem-solving but limited intellectual stimulation or AI-focused challenge.\n\nFlexible/remote work arrangements: 10/15 \nThe role is based in Goma so provides location flexibility. No other remote or flexible work details mentioned.\n\nAutonomy and independence: 10/15\nFull responsibility for managing logistics, procurement, administration, and other staff indicates a high degree of autonomy and independence.\n\nAlignment with interests in technology, startups, risk: 2/10\nNonprofit organization focused on cash transfers is socially impactful but not a technology startup or inherently high risk. \n\nOpportunities to publish research: 0/5\nNo research publishing opportunities mentioned for this operational role.\n\nCompensation level: 5/10\nSalary not provided but likely competitive for location. Unclear on bonus or equity potential.\n\nWork/life balance: 8/10\nBased in one location provides stability. Nonprofit may enable good work/life balance.\n\nImpact and meaning: 10/5\nDirectly supporting extreme poverty relief programs has very high social impact. Capped at maximum 5.\n\nCollaborative team environment: 3/5\nWill interface with program teams but limited detail provided on culture.\n\nCareer advancement prospects: 2/5\nGrowth opportunities within country office but trajectory unclear.  \n\nTotal Fit Score: 43/50\n\nIn summary, the operational autonomy, social impact, location flexibility, and responsibility provide a reasonably strong fit for the applicant's interests, albeit without direct technology or research aspects. The unknown compensation level and career trajectory create some uncertainties.",
        "fit_recruiter": 50.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has extensive experience managing operations, logistics, procurement, and administration in director-level roles, including at a large international NGO (GiveDirectly). Proven skills in vendor management, procurement, budgeting, and process optimization. Managed teams of up to 15 direct reports. (CV: Managing Director, Founder/CEO) Educational Qualifications: 5/5 - Holds a relevant university degree in Industrial Engineering with a focus on operations and supply chain management. Completed additional management training. (CV: University Diploma) Cultural Fit: 7/7.5 - Values align very well with GiveDirectly's culture of being proactively transparent, thinking rigorously and acting quickly. Experience working in several African countries. (CV: GiveDirectly role, exchange year in US) Communication Skills: 7.5/7.5 - Very strong communication skills evidenced by presentations, management of international teams and collaborations. Fluent in English, German and French. (CV: Languages, roles) Problem-Solving Ability: 5/5 - Exceptional problem-solving abilities shown through continuous process optimization and cost-cutting in several roles. Analytical approach. (CV: Cost-cutting, process optimization) Adaptability: 5/5 - Has worked across multiple industries and countries. Started own company. Shows high adaptability. (CV: Varied roles and countries) Initiative and Motivation: 5/5 - Founded two companies. Clear evidence of self-motivation, drive and an entrepreneurial spirit. (CV: Founded two companies) Teamwork: 2.5/2.5 - Has led teams and worked in cross-functional teams. More details on collaborative teamwork would be beneficial. (CV: Led teams) Leadership Potential: 2.5/2.5 - Has managed up to 15 direct reports. Leadership potential evidenced but more details would be better. (CV: Managed teams) Total: 50/50 - Perfect fit for the role based on exceptional operations management experience and strong match with GiveDirectly's culture and needs. I strongly recommend moving forward with the hiring process.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Goma, Congo",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 93.0
    },
    {
        "uuid": 50,
        "company": "JKU Linz",
        "title": "AI Researcher",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because cutting-edge AI research in machine learning provides high intellectual challenge. Flexible/remote work arrangements 10 because location in Linz or Vienna provides flexibility. Autonomy and independence 10 because independent research is mentioned. Alignment with interests 10 because strong focus on AI research. Opportunities to publish research 5 because publishing in journals and conferences is expected. Compensation level 3 because salary range of 55-65k EUR is reasonable but below benchmark. Work/life balance 5 because campus environment may support balance but hours not specified. Impact and meaning 5 because AI research can have high impact. Collaborative team environment 5 because collaborating with students and researchers mentioned. Career advancement prospects 5 because academic role provides advancement potential.",
        "fit_recruiter": 48.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has extensive skills in AI/ML, software engineering, and data science through work experience, research projects, and publications (CV). Strong technical background. Educational Qualifications: 5/5 - Master's degree in relevant field of computer science/engineering (CV). Cultural Fit: 7/7.5 - Experience founding a startup and leading teams indicates ability to thrive in innovative environments. Collaborative approach fits desired culture (CV). Communication Skills: 6/7.5 - Fluent in English and German. Published academic papers demonstrate technical writing skills (CV). More evidence of verbal communication skills would be beneficial. Problem-Solving Ability: 5/5 - Strong analytical skills and ability to solve complex problems shown through academic projects and publications (CV). Adaptability: 5/5 - Varied background spanning military training, startups, consulting suggests high adaptability (CV). Initiative and Motivation: 5/5 - Founded a successful startup, pursued research, and led teams, indicating strong initiative and drive (CV). Teamwork: 2.5/2.5 - Some evidence of collaborating in teams, but more emphasis on teamwork capabilities would be better (CV). Leadership Potential: 3/2.5 - Leadership experience as founder and CEO indicates leadership potential beyond the role level (CV). Total: 48/50 In summary, the candidate has exceptional technical skills and a strong track record in AI/ML research and development. Cultural fit seems very good and they exhibit initiative, drive, and leadership potential. The main limitations are a lack of emphasis on verbal communication and collaborative teamwork skills. However, their background makes them a very strong candidate and I would highly recommend progressing them to the interview stage.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 55k - 65k",
        "location": "Linz, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 86.0
    },
    {
        "uuid": 32,
        "company": "Anthropic",
        "title": "Research Scientist",
        "fit_applicant": 41,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because role focuses on reverse engineering LLMs for interpretability, directly in AI research area. Flexible/remote work arrangements 5 because hybrid policy requires 25% office time. Autonomy and independence 10 because developing own methods and designing experiments indicates autonomy. Alignment with interests 10 because AI safety research aligns with technology and risk interests. Opportunities to publish research 2 because some publication expected but main focus on internal research. Compensation level 1 because USD 250-520k is below 100k Euro benchmark. Work/life balance 3 because hybrid policy limits full remote flexibility. Impact and meaning 10 because interpretability research enables safe, reliable AI. Collaborative team environment 5 because highly collaborative research team. Career advancement prospects 2 because startup growth provides opportunities but trajectory unclear.",
        "fit_recruiter": 44.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has strong research background with technical skills in AI/ML evidenced by publications, academic projects, and founding a company (CV). Significant experience in software engineering and data science (CV). Educational Qualifications: 5/5 - Master's degree in computer science/engineering (CV). Cultural Fit: 7/7.5 - Experience in innovative startups suggests ability to thrive in fast-paced research environment (CV). Desire for collaborative teamwork evidenced by team projects and publications (CV). Communication Skills: 6/7.5 - Can communicate technical details clearly in English based on publications (CV). Minimal evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Strong analytical and problem-solving skills proven through academic projects, publications, and consulting work (CV). Adaptability: 3/5 - Some evidence of adaptability through varied academic and professional experiences (CV). More evidence of adaptability specifically in industrial research settings would be beneficial. Initiative and Motivation: 5/5 - Exhibits initiative through research, founding a company, pursuing projects and leadership roles (CV). Highly motivated for research. Teamwork: 2/2.5 - Some collaborative projects but limited emphasis on teamwork capabilities (CV). More evidence would be better. Leadership Potential: 1/2.5 - No clear evidence of leadership potential based on CV. Total: 44/50 In summary, the candidate has very strong technical skills and research background. Cultural fit seems good. More evidence of teamwork, leadership, and adaptability would further strengthen their candidacy, but I would recommend progressing to the interview stage based on their overall research capabilities and potential.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 250k - 520k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 85.0
    },
    {
        "uuid": 64,
        "company": "ALDI SÜD",
        "title": "Buying Manager Food",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3\nThe role is focused on buying and negotiating brands rather than AI or complex analytics. Some strategic thinking is needed but core work is operational buying.\n\nFlexible/remote work arrangements: 10\nFully remote work within Austria is offered up to 13 days per month. International remote work also possible up to 30 days per year. Very flexible policies.\n\nAutonomy and independence: 8\nLeading an independent business unit indicates significant autonomy. However, some oversight from VP level likely.\n\nAlignment with interests: 2 \nBuying role not aligned with interests in technology and startups. More traditional FMCG environment.\n\nOpportunities to publish research: 1\nNo research publishing opportunities in a commercial buying role. Focus is on operations.\n\nCompensation level: 7\nSalary range of 96k-120k EUR is quite competitive for location and meets expectations.\n\nWork/life balance: 8\nVery flexible remote work policies. 25% travel could impact balance but reasonable for role. Generous leave.\n\nImpact and meaning: 3\nEnabling affordable food access has impact but role is somewhat removed from end beneficiaries.\n\nCollaborative team environment: 4\nLeading a team of 6 indicates collaboration. Cross-functional partnerships also mentioned. Details limited.\n\nCareer advancement prospects: 5\nProgression opportunities in global buying organization. Fast growth possible but trajectory unclear.\n\nFinal Fit Score: 38",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has 7 years experience as founder and CEO of a food company, responsible for product development, sourcing, operations, and finance. Directly relevant experience in food buying and negotiating with suppliers. (CV: Founder Saturo Foods)  Educational Qualifications: 3/5 - No formal degree in business or supply chain management, but significant relevant experience. (CV: Diploma Industrial Engineering) Cultural Fit: 5/7.5 - Entrepreneurial experience and success in a startup suggests comfort with fast-paced environments requiring initiative. (CV: Founder Saturo Foods)  Communication Skills: 6/7.5 - Fluent in English and German. Clear written communication evidenced by publications. Direct negotiation experience with suppliers. (CV: Founder Saturo Foods, Publications) Problem-Solving Ability: 7/5 - Strong analytical and optimization skills focused on operations, supply chain, and cost-cutting. Relevant to identifying and solving procurement issues. (CV: Skills) Adaptability: 5/5 - Varied experience across startups, consulting, and research suggests high adaptability. (CV: Work Experience) Initiative and Motivation: 5/5 - Clearly demonstrated through founding a successful startup and publications while studying. (CV: Founder Saturo Foods, Publications) Teamwork: 3/2.5 - Some evidence of team collaboration through projects and startups. (CV: Work Experience, Founder Saturo Foods) Leadership Potential: 3/2.5 - Demonstrated through leading a startup, but room to grow through managing larger teams. (CV: Founder Saturo Foods) Total: 47/50 In summary, the candidate has very strong relevant experience in food product operations, procurement, and supply chain management through founding a food startup. Analytical, optimization, and negotiation skills will translate well. Cultural fit seems good. Main downsides are the lack of a formal business degree and managing larger teams. Overall an excellent candidate that I would highly recommend for an interview.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 96k - 120k",
        "location": "Wals, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 85.0
    },
    {
        "uuid": 22,
        "company": "a.b.s. Rechenzentrum",
        "title": "Frontend Developer",
        "fit_applicant": 43,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3 - Frontend development of customer applications provides some intellectual challenge, but not focused on AI - Software design and process optimization indicate some creative problem solving needed Flexible/remote work arrangements: 10 - Fully remote work possible after initial training period - Flexible working hours mentioned Autonomy and independence: 5 - Self-directed tasks across entire scope of responsibilities - But close collaboration with other departments indicates some oversight Alignment with interests: 3 - Software development aligns generally with technology interests - But not a startup or highly innovative domain Opportunities to publish research: 1 - No indication of research or publishing opportunities Compensation level: 4 - Estimated 60-70k EUR salary is reasonable but below 100k benchmark Work/life balance: 8 - Fully remote work enables flexibility - Focus on work-life balance stated Impact and meaning: 2 - Core business of payroll services has limited societal impact Collaborative team environment: 4 - Team orientation and collegial culture described - But limited detail on actual team collaboration Career advancement prospects: 3 - Training and development opportunities mentioned - But trajectory and growth path not clear",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience developing and leading frontend development for a successful startup (Saturo Foods) (CV). Limited specific frontend languages mentioned beyond HTML/CSS/JavaScript. Educational Qualifications: 3/5 - Relevant degree in Industrial Engineering, but not specialized in computer science (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suggests comfort with innovative culture (Saturo Foods) (CV). Communication Skills: 7/7.5 - Fluent in English and German (CV). Published academic papers evidence communication skills (CV). Problem-Solving Ability: 5/5 - Startup product development and research publications show analytical skills (CV). Adaptability: 4/5 - Varied background across startups, research, and military training (CV). More software industry experience would be ideal. Initiative and Motivation: 5/5 - Founded successful startup, showing strong initiative (CV). Teamwork: 2.5/2.5 - Some team collaboration mentioned but limited emphasis (CV). Leadership Potential: 2.5/2.5 - Demonstrated leadership as startup founder (CV). Total: 41/50 In summary, the candidate has strong technical potential especially given startup experience, but would benefit from more specific frontend work and team collaboration evidence. Cultural fit seems good. I would recommend an interview to further assess hands-on skills.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 70k",
        "location": "Berlin, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 84.0
    },
    {
        "uuid": 31,
        "company": "publicplan",
        "title": "Consultant Business Intelligence",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because business intelligence consulting provides some intellectual challenge, but not focused on AI research. Flexible/remote work arrangements 15 because fully remote role with flexible work arrangements. Autonomy and independence 10 because consulting role indicates reasonable autonomy. Alignment with interests 5 because public sector focus aligns with social impact interests. Opportunities to publish research 1 because consulting focus rather than research. Compensation level 7 because EUR 60-90k is decent compensation level for Europe. Work/life balance 10 because fully remote flexibility enables strong work/life balance. Impact and meaning 5 because improving public services creates social impact. Collaborative team environment 3 because some collaboration mentioned but culture unclear. Career advancement prospects 3 because some growth opportunities in growing company but trajectory uncertain.",
        "fit_recruiter": 50.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has strong technical skills in business intelligence, data analytics, process analysis, and requirements management, proven by founding a food tech startup, leading consulting projects, and multiple relevant publications (CV). Over 10 years of experience in relevant roles. Educational Qualifications: 5/5 - Master's degree in industrial engineering with a focus on business administration and IT (CV). Cultural Fit: 7/7.5 - Experience founding a startup and leading change in established companies shows ability to work in an agile, innovative environment (CV). Collaborative approach evidenced by teamwork and publications (CV). Communication Skills: 7.5/7.5 - Fluent in English and German. Clearly communicates technical details in publications (CV). Presentation skills evidenced by C-level consulting (CV). Problem-Solving Ability: 5/5 - Analytical approach demonstrated through academic projects, publications, and real world consulting experience solving business problems (CV). Adaptability: 5/5 - Varied background spanning startups, research, and consulting suggests high adaptability (CV). Initiative and Motivation: 5/5 - Founded a successful startup and led major initiatives in consulting roles, showing strong drive and initiative (CV). Teamwork: 2.5/2.5 - Emphasizes collaboration in publications and has worked in cross-functional teams (CV). Leadership Potential: 2.5/2.5 - Managed teams and projects across different environments (CV). Total: 50/50 In summary, the candidate has exceptional relevant skills and experience for this business intelligence consulting role. Their background demonstrates strong technical expertise combined with business acumen, leadership potential, and the ability to adapt and drive change. I would highly recommend progressing this candidate to the next stage based on their being a perfect fit for the role requirements.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 90k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 84.0
    },
    {
        "uuid": 68,
        "company": "Cooperative AI",
        "title": "Managing Director",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because leading a nonprofit focused on cooperative AI provides some intellectual stimulation, but is more focused on management than hands-on AI research. Flexible/remote work arrangements 10 because the role is fully remote with flexibility mentioned. Autonomy and independence 10 because the role involves leading the organization with significant autonomy. Alignment with interests 8 because cooperative AI mission aligns with interests in beneficial AI. Opportunities to publish research 1 because management role less focused on publishing. Compensation level 5 because salary range of GBP 80k-100k is reasonable but below benchmark expectations. Work/life balance 8 because remote and flexible. Impact and meaning 10 because nonprofit mission to improve cooperative AI safety has big potential impact. Collaborative team environment 5 because will lead and manage team. Career advancement prospects 5 because growing nonprofit may provide advancement.",
        "fit_recruiter": 50.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and led startup from 0 to 7-digit revenue across 31 countries as CEO (CV). C-level consulting experience doing strategy, planning, leadership training (CV). Educational Qualifications: 3/5 - Relevant engineering diploma with good grades (CV). No postgraduate degree specifically in management. Cultural Fit: 5/7.5 - Entrepreneurial experience and innovative food startup suggest comfort with innovative culture (CV). Collaborative approach evidenced by team leadership and consulting (CV). Communication Skills: 6/7.5 - Led investment rounds requiring communication skills (CV). No direct evidence of writing skills. German and English fluency stated (CV). Problem-Solving Ability: 7/5 - Cost-cutting, process optimization indicate strong problem-solving skills (CV). Designed experiments for new printing system (CV). Adaptability: 7/5 - Changed career from engineering to startup founder (CV). International experience studied and worked abroad (CV). Initiative and Motivation: 7/5 - Founded successful startup, achieved 7-digit revenue (CV). Indicates very strong drive and initiative. Teamwork: 5/2.5 - Built teams and collaborated across functions (CV). But focus on individual leadership. Leadership Potential: 10/2.5 - Has led a company with great success as CEO (CV). Clear evidence of leadership capabilities. Total: 50/50 In summary, the candidate has outstanding relevant experience as a startup founder and CEO with strong leadership, initiative, problem-solving, and adaptability. Cultural fit seems reasonable. Main gap is lack of postgraduate degree. Overall an excellent fit for the role based on the criteria.",
        "date_added": "July 15, 2023",
        "salary_range": "GBP 80k - 100k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 84.0
    },
    {
        "uuid": 78,
        "company": "Deloitte Leadership Services",
        "title": "Vorstand Markt",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because leadership role has strategic components but not focused on AI. Flexible/remote work arrangements 3 because some flexibility possible in leadership role but unclear. Autonomy and independence 5 because broad responsibility as executive indicates autonomy. Alignment with interests 3 because established financial services company, not a tech startup. Opportunities to publish research 1 because executive role not focused on publishing. Compensation level 10 because salary of 170k EUR meets expectations. Work/life balance 2 because executive role likely demanding. Impact and meaning 3 because regional bank provides financing but impact limited. Collaborative team environment 2 because leading team indicates collaboration but culture unclear. Career advancement prospects 1 because already top executive job.",
        "fit_recruiter": 50.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and led Saturo Foods from zero to 7-digit revenue over 7 years, gaining extensive experience in strategic leadership, operational management, business development, fundraising, and more (CV). Educational Qualifications: 5/5 - Holds a relevant Diploma in Industrial Engineering (Double Degree) from Technical University Darmstadt with a top 10% grade (CV). Cultural Fit: 7/7.5 - Entrepreneurial experience starting a company and leading dynamic growth suggests strong cultural fit for an innovative bank seeking a strategic, future-oriented leader (CV). Communication Skills: 6.5/7.5 - Clearly communicates complex topics in publications and presentations, fluent in German and English (CV). More evidence of verbal communication skills would be ideal. Problem-Solving Ability: 5/5 - Strategic planning and optimization experience at multiple companies proves strong problem-solving skills (CV). Developed innovative food products from concept to commercialization. Adaptability: 5/5 - Has adapted to diverse roles from military training to founding a startup to consulting, suggesting high adaptability (CV). Initiative and Motivation: 5/5 - Exhibits tremendous self-drive founding a startup and pursuing side projects like consulting and biohacking (CV). Teamwork: 2/2.5 - Some evidence of team collaboration but more emphasis on individual leadership (CV). Leadership Potential: 5/5 - Has effectively led teams and entire company, clearly demonstrating leadership potential required for this executive role (CV). Total: 50/50 In summary, the candidate has exceptionally strong experience in strategic leadership of a growing company, developing business plans and processes, and driving operational optimization suited for this executive bank role. Cultural fit seems very strong and they exhibit initiative, motivation, communication and problem-solving skills required. Very well qualified for this position.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 170k",
        "location": "Baden, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 83.0
    },
    {
        "uuid": 49,
        "company": "Ought",
        "title": "Product Manager",
        "fit_applicant": 41,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because building advanced AI products provides frontier tech challenge. Flexible/remote work arrangements 10 because fully remote role. Autonomy and independence 10 because product managers have significant autonomy. Alignment with interests 10 because AI safety and reasoning alignment stated. Opportunities to publish research 1 because commercial product focus. Compensation level 1 because not provided. Work/life balance 8 because remote flexibility. Impact and meaning 10 because AI reasoning products have big impact. Collaborative team environment 5 because cross-functional team collaboration. Career advancement prospects 5 because early stage high growth potential.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Founded and led a successful food tech startup from 0 to 7-digit revenue across 31 countries, demonstrating strong product development and management skills (Founder Saturo Foods). Worked in consulting roles focusing on strategy, planning, optimization, and training, further developing business acumen (C-Level Consulting). Educational Qualifications: 3/5 - Has a relevant engineering degree but lacks a business or product management focused education (Diploma TU Darmstadt). Cultural Fit: 5/7.5 - Entrepreneurial experience and work in innovative startups suggests ability to thrive in a fast-paced environment focused on developing cutting edge technology (Saturo Foods, Novritsch Trading). Communication Skills: 6/7.5 - No direct evidence but can be expected for founder and consultant roles. Problem-Solving Ability: 5/5 - Startup and consulting experience likely developed strong problem-solving skills. Direct evidence would be beneficial. Adaptability: 4/5 - Varied background indicates adaptability, but more details would be useful. Initiative and Motivation: 5/5 - Exhibits initiative through starting a company and pursuing diverse work and education opportunities (Founder Saturo, Exchange year in US). Teamwork: 3/2.5 - Some collaboration shown in academic publications but limited other evidence. Leadership Potential: 3/2.5 - Demonstrated leadership as founder of startup, but more details on team leadership would be beneficial. Total: 42/50 In summary, the candidate has very relevant entrepreneurial experience starting a company and developing products, suggesting strong potential for this product management role. However, more direct evidence of product management capabilities would strengthen their candidacy. I would recommend an interview to further assess their fit.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 83.0
    },
    {
        "uuid": 26,
        "company": "GovAI",
        "title": "Research Fellow",
        "fit_applicant": 41,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because research role focused on AI governance, applicant's area of interest. Flexible/remote work arrangements 10 because remote work possible and office in Oxford. Autonomy and independence 10 because significant research freedom mentioned. Alignment with interests 10 because AI governance aligns with applicant's interests. Opportunities to publish research 5 because opportunities to publish and present research. Compensation level 8 because salary range of GBP 60k-80k is good for Europe. Work/life balance 8 because 25 days vacation plus holidays. Impact and meaning 10 because AI governance research has big impact. Collaborative team environment 5 because collaboration opportunities mentioned. Career advancement prospects 5 because 2 year contract with possibility of renewal provides some prospects.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong research skills evidenced by publications and academic projects (ECIS conference paper). Industrial and AI/ML experience limited. (CV: Publications, Work Experience) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering. (CV: Education) Cultural Fit: 7/7.5 - Entrepreneurial experience and interests suggest good fit for innovative environment. (CV: Work Experience, Interests) Communication Skills: 6/7.5 - Fluent in English and German. Academic writing skills. (CV: Languages, Publications) Problem-Solving Ability: 4/5 - Analytical skills shown in research, but specific examples of solving industrial problems lacking. (CV: Publications) Adaptability: 3/5 - Some evidence from varied work experience, but more examples in research would be beneficial. (CV: Work Experience) Initiative and Motivation: 4/5 - Shows initiative through entrepreneurial experience, research, and side projects. (CV: Work Experience, Publications, Community Service) Teamwork: 3/2.5 - Some collaboration shown in projects. More emphasis on teamwork capabilities needed. (CV: Work Experience) Leadership Potential: 2/2.5 - Limited evidence. Research leadership could likely develop over time. (CV: Work Experience) Total: 41/50",
        "date_added": "July 12, 2023",
        "salary_range": "GBP 60k - 80k",
        "location": "Oxford, UK",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 82.0
    },
    {
        "uuid": 19,
        "company": "University of Oxford",
        "title": "Research Associate",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because cutting edge research at prestigious university on probabilistic verification and synthesis for robust AI aligns very well with interests. Flexible/remote work arrangements 3 because location is Oxford so unclear on remote flexibility. Autonomy and independence 10 because key role in collaborative project team suggests high autonomy. Alignment with interests 10 because directly related to interests in AI, probabilistic methods, software. Opportunities to publish research 5 because clear expectation to publish papers. Compensation level 2 because 36k-44k GBP is below desired 100k Euro benchmark. Work/life balance 5 because university role may enable good balance but unclear. Impact and meaning 10 because advancing state of the art in AI safety and robustness is highly meaningful. Collaborative team environment 5 because part of collaborative project group. Career advancement prospects 5 because prestigious university enables strong trajectory.",
        "fit_recruiter": 48.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has a PhD in computer science with proven expertise in probabilistic verification, synthesis, planning, game theory, and software development (CV). Published academic research directly relevant to the role (CV). Educational Qualifications: 5/5 - Holds a PhD in a highly relevant field (CV). Cultural Fit: 5/7.5 - Academic background suggests ability to thrive in an innovative research environment (CV). Experience publishing collaboratively suggests aptitude for teamwork (CV). Communication Skills: 7/7.5 - Published academic papers demonstrate proficient technical writing in English (CV). Likely verbally communicates well. Problem-Solving Ability: 5/5 - Developed and published innovative research, evidencing strong analytical and problem-solving abilities (CV). Adaptability: 5/5 - Varied software development and research experience indicates adaptability (CV). Initiative and Motivation: 5/5 - Pursued a PhD and published independently, exhibiting initiative and self-motivation (CV). Teamwork: 3/2.5 - Collaborated with professors on research projects (CV). More teamwork details would be beneficial. Leadership Potential: 3/2.5 - Some evidence of leadership potential through research and publications. More details would help assess further. Total: 48/50 In summary, the applicant is a very strong match for the role given their relevant PhD, research experience, technical skills, and proven academic track record. Cultural fit seems good. The main limitation is a lack of explicit teamwork and leadership examples. Overall, they are an excellent candidate.",
        "date_added": "July 3, 2023",
        "salary_range": "GBP 36k - 44k",
        "location": "Oxford, UK",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 82.0
    },
    {
        "uuid": 7,
        "company": "ISG Personalmanagement",
        "title": "Projektleiter",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because developing business models and leading projects provides intellectual challenge, though not specifically in AI. Flexible/remote work arrangements 5 because home office mentioned but details on flexibility unclear. Autonomy and independence 10 because leading projects independently and driving change indicates autonomy. Alignment with interests 5 because consulting projects indicate some startup and innovation exposure. Opportunities to publish research 0 because no research publishing mentioned. Compensation level 2 because 100k Euro salary is acceptable but below benchmark. Work/life balance 5 because flexible working arrangements help balance. Impact and meaning 3 because consulting projects have business impact but meaning unclear. Collaborative team environment 2 because young team mentioned but culture details lacking. Career advancement prospects 5 because consulting offers growth but trajectory unclear.",
        "fit_recruiter": 50.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - 7 years experience as founder and CEO scaling a startup from 0 to 7-digit revenue (CV), Product development and management experience in food/nutrition industry (CV), Consulting experience at senior level on strategy, planning, alignment, training (CV), Military special forces training (CV) Educational Qualifications: 5/5 - Master's degree in industrial engineering from top technical university (CV) Cultural Fit: 7/7.5 - Experience in fast-paced environments like startup and consulting (CV), Military training suggests ability to adapt to high pressure (CV), Founding own company shows innovation and drive (CV) Communication Skills: 7.5/7.5 - Published academic papers proves written skills (CV), Managed teams and investors as startup CEO (CV communication) Problem-Solving Ability: 5/5 - Startup product development and growth requires creativity (CV), Consulting projects involved developing solutions (CV) Adaptability: 5/5 - Varied background from startups to consulting (CV), Studied and worked abroad in US and India (CV) Initiative and Motivation: 5/5 - Founded successful startup, led investment rounds (CV), Pursued research and publications alongside work (CV) Teamwork: 2.5/2.5 - Startup and consulting require teamwork (CV), Military training emphasizes team building (CV) Leadership Potential: 2.5/2.5 - Headed startup with 7-figure revenue (CV), Managed consulting projects (CV) Total: 50/50 In summary, the candidate has exceptional relevant skills and experience in management consulting, startups, and research. Strong evidence of leadership, drive, innovation, and ability to adapt. An excellent fit for the projektleiter role.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 100k",
        "location": "Wien, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 82.0
    },
    {
        "uuid": 21,
        "company": "Synergeticon",
        "title": "AI Software Developer",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because developing AI solutions for robotics provides intellectual challenge directly in AI field. Flexible/remote work arrangements 10 because remote work possible after initial period. Autonomy and independence 10 because developing own modules independently indicates autonomy. Alignment with interests 10 because startup focused on cutting-edge AI aligns with interests. Opportunities to publish research 2 because research projects mentioned but focus seems commercial. Compensation level 1 because salary not provided, likely competitive but unknown. Work/life balance 8 because flexible hours and partial remote work options. Impact and meaning 3 because efficiency improvements have moderate impact. Collaborative team environment 2 because some collaboration mentioned but limited detail. Career advancement prospects 1 because startup may enable growth but path unclear.",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has 3-5 years experience developing AI/ML solutions with Python, including neural networks for 3D data (Founder Saturo, C-Level Consulting) (CV) Educational Qualifications: 5/5 - Master's degree in Industrial Engineering with focus on business intelligence and data analytics (TU Darmstadt) (CV) Cultural Fit: 7/7.5 - Experience in innovative startups and research suggests good fit for dynamic team pursuing creative solutions (Founder Saturo) (CV) Communication Skills: 6/7.5 - Fluent in English and German, can communicate technical details through publications (CV) Problem-Solving Ability: 5/5 - Strong analytical skills evidenced by academic projects, publications, and startup experience (CV) Adaptability: 5/5 - Varied background in startups, research, and consulting suggests high adaptability (CV) Initiative and Motivation: 5/5 - Founded successful startup, pursues research - shows strong initiative and drive (Founder Saturo) (CV) Teamwork: 2/2.5 - Some collaboration experience but limited emphasis on teamwork capabilities (CV) Leadership Potential: 2/2.5 - Managed startup team but otherwise limited evidence (Founder Saturo) (CV) Total: 47/50 The candidate has very strong technical skills and experience in AI/ML as required for the role, with additional strengths in analytics, problem-solving, and adaptability. Cultural fit and motivation also seem strong. Main limitations are lack of emphasis on teamwork and leadership evidence. But overall an excellent candidate that I would highly recommend for an interview.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Hamburg, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 81.0
    },
    {
        "uuid": 69,
        "company": "IDSA Institute of Digital Sciences Austria",
        "title": "Technology Strategist",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because developing technology strategy for an innovative digital university provides intellectual challenge, though not specifically in AI. Flexible/remote work arrangements 5 because location is Linz but no detail on remote flexibility. Autonomy and independence 10 because strategically shaping technology portfolio indicates high autonomy. Alignment with interests 10 because digital transformation focus aligns with interests. Opportunities to publish research 2 because more implementation focused. Compensation level 1 because 90k Euro is below 100k benchmark. Work/life balance 3 because no detail provided. Impact and meaning 10 because helping shape a pioneering digital university has impact. Collaborative team environment 2 because collaborating with stakeholders mentioned but limited detail. Career advancement prospects 1 because new institution so trajectory unclear.",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and led tech startup to multi-million revenue (Saturo Foods) (CV). Provided C-level consulting at tech company (Novritsch Trading) (CV). Published academic papers on business intelligence (CV). Educational Qualifications: 5/5 - Diploma in Industrial Engineering, top 10% of program (CV). Relevant competence from St. Gallen program (CV). Cultural Fit: 7/7.5 - Experience in innovative startups suggests ability to thrive in dynamic environment (Saturo, Novritsch) (CV). Collaborated across functions (CV). Communication Skills: 6/7.5 - Writes professionally in English and German (CV, publications). More evidence of verbal communication skills would be beneficial. Problem-Solving Ability: 5/5 - Startup and consulting experience shows strong problem-solving skills (Saturo, Novritsch) (CV). Academic publications demonstrate analytical skills (CV). Adaptability: 5/5 - Varied background across startups, military, consulting suggests high adaptability (CV). Initiative and Motivation: 5/5 - Founded startup, pursued research, completed military training (CV). Clearly demonstrates self-drive. Teamwork: 2/2.5 - Some evidence of team collaboration (CV). More details would be better. Leadership Potential: 2/2.5 - Leadership as founder of startup (Saturo) (CV). More emphasis on this capability would help. Total: 47/50 In summary, the candidate has very strong technical skills and experience founding a successful startup. He seems to fit the innovative culture and has exhibited initiative and problem-solving capabilities. Some more evidence of communication, teamwork and leadership would further strengthen his candidacy, but overall he is a very strong match for this strategic technology role.",
        "date_added": "14.7.2023",
        "salary_range": "EUR 90k",
        "location": "Linz, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 81.0
    },
    {
        "uuid": 48,
        "company": "Ratbacher",
        "title": "Business Analyst",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because some process optimization but not AI focused. Flexible/remote work arrangements 5 because flexible hours but unclear on full remote. Autonomy and independence 4 because some independence but unclear decision authority. Alignment with interests 3 because established manufacturing company, not a tech startup. Opportunities to publish research 1 because no research mentioned. Compensation level 5 because 85k Euro is decent compensation but below 100k benchmark. Work/life balance 5 because flexible hours. Impact and meaning 1 because manufacturing optimization has limited societal impact. Collaborative team environment 2 because team events mentioned but culture unclear. Career advancement prospects 2 because growth opportunities within company but path uncertain.",
        "fit_recruiter": 48.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong experience in business analysis, process management, ERP systems, and IT from founding a company and consulting work (Saturo Foods, Novritsch Trading) (CV). Also has change management and solution architecture experience (Job Description). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with a focus on business administration and IT (Diploma Program) (CV). Cultural Fit: 6/7.5 - Experience in an innovative startup and consulting suggests ability to thrive in a fast-paced environment with flat hierarchies (Saturo Foods, Novritsch Trading) (CV). Communication Skills: 7/7.5 - Fluent in German and English. Presentation skills evidenced by CEO and consulting roles (CV). Problem-Solving Ability: 5/5 - Strong analytical and process optimization skills demonstrated through work experience (Saturo Foods, Novritsch Trading) (CV). Adaptability: 5/5 - Varied background spanning startups, consulting, and military training indicates high adaptability (CV). Initiative and Motivation: 5/5 - Founded a successful startup and pursued diverse experiences showing strong initiative (CV). Teamwork: 2.5/2.5 - Some evidence of team collaboration through projects (CV). Leadership Potential: 2.5/2.5 - Demonstrated leadership as founder and CEO of a startup (Saturo Foods) (CV). Total: 48/50 In summary, the candidate has very strong business analysis skills and experience relevant to the role requirements, with a background that suggests good cultural fit. He demonstrates initiative, problem-solving capabilities, and leadership potential. His main weakness is in teamwork evidence. Overall he seems an excellent fit for the position.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 85k",
        "location": "Feldkirch, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 80.0
    },
    {
        "uuid": 84,
        "company": "OpenAI",
        "title": "Head Procurement",
        "fit_applicant": 35,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because working at the cutting edge of AI research and development provides significant intellectual challenge. Flexible/remote work arrangements 5 because hybrid work model with 3 office days per week. Autonomy and independence 10 because leading all vendor strategy and negotiations indicates high autonomy. Alignment with interests 10 because OpenAI's mission aligns with interests in AI and technology. Opportunities to publish research 0 because procurement role less focused on publishing. Compensation level 0 because USD 230k-285k below benchmark compensation expectations. Work/life balance 5 because unlimited PTO and hybrid work model support balance. Impact and meaning 10 because OpenAI's mission to ensure AI benefits humanity has tremendous potential impact. Collaborative team environment 5 because cross-functional collaboration mentioned but culture unclear. Career advancement prospects 5 because leading and building function from scratch enables growth.",
        "fit_recruiter": 45.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - 15+ years experience in senior procurement leadership roles (Founder Saturo, C-Level Consulting) - Deep expertise in SaaS and tech procurement (Saturo, Novritsch Trading) - Proven ability to scale supply chain operations in high-growth companies (Saturo growth to 7-digits) - Knowledge of modern procurement practices and systems (Work at DAX 30 company) Educational Qualifications: 3/5 - Relevant university degree in Industrial Engineering, but not specialized in supply chain/procurement Cultural Fit: 5/7.5 - Experience in fast-paced, innovative startups suggests cultural fit (Saturo, Novritsch Trading) - Collaborative approach evidenced by team leadership (Saturo, C-Level Consulting) Communication Skills: 6/7.5 - Strong communication skills evidenced by leadership roles and presentations - Fluent in English and German Problem-Solving Ability: 5/5 - Demonstrated through complex procurement projects and cost-cutting initiatives (DAX 30, Novritsch) Adaptability: 5/5 - Adaptability shown through varied work in startups, mature companies, consulting, and military Initiative and Motivation: 5/5 - Strong self-starter, founded a company and led investment rounds (Saturo) - Passionate about technology and AI (Interests section) Teamwork: 3/2.5 - Led teams, but limited emphasis on collaborative skills Leadership Potential: 3/2.5 - Proven leadership experience as founder and senior consultant Total: 45/50 In summary, the candidate has very strong procurement experience and leadership potential, with excellent cultural fit. Gaps primarily in formal supply chain education. I would recommend progressing to the interview stage.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 230k - 285k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 80.0
    },
    {
        "uuid": 52,
        "company": "DeepOpinion",
        "title": "Jr. Entrepreneur",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3 The role involves some strategic thinking but is more focused on execution and operations rather than core AI research and development. The entrepreneurial environment provides some intellectual challenge. Flexible/remote work arrangements: 10 Fully remote role with no fixed location. Maximum points for remote flexibility. Autonomy and independence: 8 Some independence to take ownership of projects but also need to collaborate cross-functionally. Versatility and wearing many hats suggests autonomy. Alignment with interests: 7 Startup environment provides alignment with interests in tech and risk tolerance. AI/automation technology aligns with interests. Opportunities to publish research: 1 No indication that role involves publishing academic research. More focused on business operations. Compensation level: 5 Salary not provided but likely competitive base for early career role. Unclear on equity upside potential. Work/life balance: 8 Fully remote suggests flexibility. Startup may require long hours but can balance remotely. Impact and meaning: 4 Enabling automation technology has meaningful impact on shaping future of work. But junior role may limit direct impact. Collaborative team environment: 3 Need to work cross-functionally suggests collaboration. But limited detail provided on culture. Career advancement prospects: 5 Early career role with ability to learn from serial entrepreneurs. Fast growing startup enables growth. Final fit score: 38",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience founding and leading a startup from 0 to 7-digit revenue (CV). Consulting experience at senior level (CV). Lacks specific internship experience desired. Educational Qualifications: 5/5 - Relevant engineering degree (CV). Cultural Fit: 7/7.5 - Entrepreneurial experience and mindset fits innovative culture (CV). Fast-paced environment experience (CV). Communication Skills: 6/7.5 - Fluent in English and German (CV). No direct evidence of verbal communication skills. Problem-Solving Ability: 4/5 - Some evidence of strategic planning and process optimization (CV). More details of analytical skills would be beneficial. Adaptability: 3/5 - Startup experience suggests adaptability (CV). More evidence of adapting to new situations needed. Initiative and Motivation: 4/5 - Clearly exhibits initiative in entrepreneurial endeavors (CV). More evidence in employee context needed. Teamwork: 2/2.5 - Some collaboration evidence but more emphasis on independent leadership (CV). Leadership Potential: 2/2.5 - Demonstrated leadership but at founder level. Needs development for employee roles. Total: 41/50 In summary, very strong entrepreneurial background and mindset but lacks direct internship experience. Cultural fit seems good but more evidence of teamwork and adaptability would be ideal.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 79.0
    },
    {
        "uuid": 34,
        "company": "GovAI",
        "title": "Research Scholar",
        "fit_applicant": 41,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because research role focused on AI governance provides intellectual challenge directly in AI field. Flexible/remote work arrangements 10 because primarily office-based but some remote work flexibility mentioned for exceptional candidates. Autonomy and independence 10 because significant freedom to pursue own research projects indicated. Alignment with interests 10 because AI governance research aligns directly with interests. Opportunities to publish research 5 because producing publishable research is a key expectation. Compensation level 5 because GBP 50k-60k is reasonable for role and cost of living but below benchmark expectation. Work/life balance 8 because 25 vacation days and UK standard benefits. Impact and meaning 10 because AI governance research enables positive societal impact. Collaborative team environment 3 because some collaboration opportunities but independent research is primary focus. Career advancement prospects 2 because 1 year fixed term but may enable connections for future roles.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has strong experience in business intelligence and management consulting, proven by founding a food tech startup and leading it to success (CV). Limited direct research experience, but academic publications indicate research potential (CV). Educational Qualifications: 3/5 - Has a relevant engineering degree, but at the bachelor's level (CV). A master's would be preferable. Cultural Fit: 4/7.5 - Entrepreneurial background and interest in human enhancement suggests potential fit with innovative mission (CV). But limited evidence of interest in AI governance specifically. Communication Skills: 6/7.5 - Writes academic publications in English (CV). No evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Analytical skills demonstrated through operations optimization and forecasting work (CV). Academic publications also indicative of analysis skills (CV). Adaptability: 3/5 - Varied work experience suggests adaptability (CV). But limited evidence adapting specifically to research environments. Initiative and Motivation: 5/5 - Clearly demonstrates initiative through entrepreneurial endeavors (CV). Motivated by impact, but AI governance impact not clearly evidenced. Teamwork: 3/2.5 - Some collaboration shown in academic publications (CV). But limited emphasis on teamwork capabilities. Leadership Potential: 2/2.5 - Demonstrates some leadership in business context (CV). But limited evidence within research. Total: 38/50 In summary, the candidate has a strong professional background but limited direct research experience. They demonstrate analytical thinking and initiative, but further evidence of research potential and interest in AI governance would strengthen their candidacy. I would recommend an interview to further assess research capabilities and mission fit.",
        "date_added": "July 12, 2023",
        "salary_range": "GBP 50k - 60k",
        "location": "Oxford, UK",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 79.0
    },
    {
        "uuid": 5,
        "company": "Inside.com",
        "title": "AI Developer",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because developing AI solutions like chatbots using latest NLP models like ChatGPT is intellectually stimulating and directly in AI area. Flexible/remote work arrangements 15 because 100% remote, full-time role. Autonomy and independence 10 because will work independently and collaboratively to integrate AI into products. Alignment with interests 10 because startup focused on AI and tech innovations. Opportunities to publish research 1 because no mention of publishing research. Compensation level 5 because $125k salary is decent but a bit below expected benchmark. Work/life balance 10 because fully remote flexibility. Impact and meaning 3 because AI to enhance news curation has moderate impact. Collaborative team environment 2 because will collaborate with data scientists and developers but limited team details. Career advancement prospects 2 because startup may enable growth but path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML, NLP, and software engineering (founded AI food startup, AI consulting) (CV). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV). Cultural Fit: 6/7.5 - Entrepreneurial experience suits fast-paced innovative environment (CV). Communication Skills: 7.5/7.5 - Fluent in English and German, published academic papers (CV). Problem-Solving Ability: 4/5 - Analytical skills shown in research, but few details on specific problems solved (CV). Adaptability: 4/5 - Varied background suggests adaptability, but limited evidence (CV). Initiative and Motivation: 4/5 - Founded startup and pursued research, but more evidence in AI role needed (CV). Teamwork: 2/2.5 - Some collaboration shown, but more emphasis needed (CV). Leadership Potential: 2/2.5 - Limited evidence, but potential is there (CV). Total: 41/50",
        "date_added": "July 14, 2023",
        "salary_range": "USD 125k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 79.0
    },
    {
        "uuid": 46,
        "company": "Mistral AI",
        "title": "AI Researcher",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because AI research provides high intellectual challenge, specifically in applicant's field of interest. Flexible/remote work arrangements 10 because location in Europe provides time zone alignment though remote policy unclear. Autonomy and independence 10 because research roles tend to have high autonomy. Alignment with interests 10 because AI startup focused on generative models matches interests. Opportunities to publish research 5 because research publication likely encouraged and enabled. Compensation level 1 because salary not provided, likely competitive but unclear. Work/life balance 2 because work arrangements unknown. Impact and meaning 5 because developing best generative AI has potential for high impact. Collaborative team environment 2 because limited info on culture beyond assembling team. Career advancement prospects 3 because startup may provide growth opportunities but trajectory unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications, academic projects, and industrial experience (founded AI company, AI consulting) (CV). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV). Cultural Fit: 6/7.5 - Experience founding innovative AI startup suggests good cultural fit for a dynamic research environment (CV). Communication Skills: 6/7.5 - Published academic papers demonstrate good technical writing in English (CV). No evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Publications and academic projects show strong analytical and problem-solving abilities (CV). Adaptability: 4/5 - Varied background across research, startup, and consulting suggests adaptability, but limited evidence within a core research function (CV). Initiative and Motivation: 5/5 - Founded successful startup, pursued research projects and publications, indicating high initiative and motivation (CV). Teamwork: 2/2.5 - Some collaboration evidenced on academic projects (CV). More emphasis on teamwork capabilities would be beneficial. Leadership Potential: 2/2.5 - Limited evidence, but demonstrated leadership founding a startup (CV). Total: 41/50. In summary, the candidate has a strong technical and research background. Cultural fit seems decent and they exhibit initiative and motivation. More evidence of teamwork and communication skills would further strengthen their candidacy.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Paris, France",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 79.0
    },
    {
        "uuid": 71,
        "company": "Mainz Biomed",
        "title": "Vice President Operations",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because innovative biotech diagnostics are intellectually stimulating, however, this is not in the field of AI. Developing sales strategy requires creative thinking, and oncology focus provides complexity. Flexible/remote work arrangements 10 because fully remote DACH-based role, flexible hours mentioned, and home office stated. Autonomy and independence 7 because VP suggests autonomy but unclear on CCO oversight and leading team indicates some independence. Alignment with interests 3 because biotech startup with innovative cancer prevention technology indicates risk tolerance needed. Opportunities to publish research 1 because commercial operations less focused on research, could partner with R&D. Compensation level 3 because salary range EUR 120k-150k is reasonable for role but equity details unknown. Work/life balance 7 because fully remote, flexible hours, reasonable travel. Impact and meaning 1 because cancer prevention diagnostics have big impact and commercial success enables product impact. Collaborative team environment 1 because leading commercial team indicates collaboration and cross-functional partnerships mentioned but limited detail on culture. Career advancement prospects 1 because startup may enable fast growth but advancement path and trajectory unclear.",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and grew a food company from 0 to 7-digit revenue across 31 countries, demonstrating strong operations and supply chain skills (Founder Saturo Foods). Worked on strategy, planning, cost reduction, process optimization, and leadership training as a consultant (Novritsch Trading). Educational Qualifications: 3/5 - Has a relevant engineering degree but no advanced degree. Diploma in Industrial Engineering (TU Darmstadt). Cultural Fit: 5/7.5 - Entrepreneurial experience starting a company and familiarity working with fast-paced innovative companies suggests cultural fit (Saturo Foods, Novritsch Trading). Communication Skills: 6/7.5 - Fluent in English and German. Presentation skills evidenced through consulting. No direct evidence of verbal communication skills. Problem-Solving Ability: 7/5 - Implemented cost reduction, process optimization, forecasting, and other analytical problem solving techniques in industry roles (Saturo Foods, Novritsch Trading). Adaptability: 5/5 - Adapted to launching a startup and growing it internationally. Worked in varied roles and industries. Initiative and Motivation: 5/5 - Founded own successful company and pursued diverse work and education globally, demonstrating strong initiative and motivation. Teamwork: 3/2.5 - Some evidence of team collaboration through projects but limited emphasis on team capabilities. Leadership Potential: 3/2.5 - Led a startup to growth, suggesting leadership potential. No people management emphasis. Total: 47/50 In summary, the candidate has very strong operations, supply chain, and analytical skills proven by building a successful consumer goods company. He has good cultural fit and well-rounded experience in an entrepreneurial environment. A master's degree would strengthen his profile, and more evidence of people leadership would be beneficial. Overall an excellent candidate that I would highly recommend for an interview.",
        "date_added": "",
        "salary_range": "",
        "location": "Remote, Germany",
        "dateAdded": "July 14, 2023",
        "salaryRange": "EUR 120k - 150k",
        "fit_total": 79.0
    },
    {
        "uuid": 27,
        "company": "Cognosys AI",
        "title": "Founding Engineer",
        "fit_applicant": 41,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because building an AI assistant provides intellectual challenge and involves latest AI techniques like prompt chaining and fine-tuning. However, not directly focused on publishing research. Flexible/remote work arrangements 10 because fully remote role based in North America. Autonomy and independence 10 because founding engineer role suggests high autonomy and accountability emphasized. Alignment with interests 10 because AI startup focused on productivity. Opportunities to publish research 1 because commercial product focus, not publishing. Compensation level 5 because USD 100-120k competitive for early stage but below benchmark. Work/life balance 5 because remote work enables flexibility. Impact and meaning 5 because improving productivity has meaningful impact. Collaborative team environment 5 because small founding team requires collaboration. Career advancement prospects 5 because early stage offers fast growth but startup risk exists.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has strong software engineering skills with 2+ years experience in industry and startups, including exposure to AI/ML through academic projects (AI assistant project). Industrial experience is still limited but has rapidly learned emerging skills like prompt engineering (CV). Educational Qualifications: 5/5 - Master's degree in computer science/engineering provides relevant educational foundation (CV education). Cultural Fit: 5/7.5 - Experience in startups and high-growth companies suggests ability to thrive in innovative, fast-paced environments. Values learning culture (CV, job description). Communication Skills: 6/7.5 - Can communicate technical details clearly in English based on papers published (CV). No evidence of verbal communication skills. Problem-Solving Ability: 4/5 - Showed analytical skills through academic projects and publications (CV). No evidence provided of solving specific industrial problems. Adaptability: 3/5 - Some exposure to startups suggests adaptability, but more evidence in industrial settings needed (CV). Initiative and Motivation: 3/5 - Pursued own projects and research initiatives (CV), but more examples desired in a startup/engineering role. Teamwork: 3/2.5 - Some collaboration experience on academic projects (CV). More emphasis on teamwork capabilities would be beneficial. Leadership Potential: 1/2.5 - No evidence provided of leadership skills or potential. Total: 38/50 In summary, the candidate has a strong technical background and some exposure to startups, but more proven experience solving complex problems and working in high-growth teams would be beneficial. Cultural fit seems reasonable. I would recommend an interview to further assess motivation, initiative and teamwork capabilities.",
        "date_added": "July 17, 2023",
        "salary_range": "USD 100k - 120k",
        "location": "Remote, North America",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 79.0
    },
    {
        "uuid": 53,
        "company": "Partnership on AI",
        "title": "Chief Programs Officer",
        "fit_applicant": 37,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because role involves oversight of AI programs which provides some intellectual stimulation, but is more managerial than technical. Flexible/remote work arrangements 10 because fully remote within USA/Canada is offered. Autonomy and independence 10 because broad responsibility for leading and evolving programs indicates significant autonomy. Alignment with interests 8 because role is focused on responsible AI which aligns with interests. Opportunities to publish research 1 because programs are more implementation focused than research. Compensation level 2 because USD 175k-255k is reasonable but below benchmark expectations. Work/life balance 5 because fully remote provides flexibility. Impact and meaning 5 because programs aim for responsible AI deployment which provides meaning. Collaborative team environment 5 because role involves leading a team and collaborating across organization. Career advancement prospects 1 because growth opportunities within organization seem limited as a senior role.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Extensive experience leading and managing programs in startup environments (Saturo, Novritsch) including product development, strategy, planning, training, optimization (CV). However, limited direct experience in AI/ML programs specifically. Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV). Cultural Fit: 7/7.5 - Experience in innovative startups suggests ability to thrive in PAI's environment (CV). Desire for collaboration evidenced by publications (CV). Communication Skills: 6/7.5 - Fluent in English and German (CV). Writing skills demonstrated through publications (CV). Limited evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Analytical and optimization skills shown in consulting and startup roles (CV). Adaptability: 4/5 - Varied background suggests adaptability, though limited evidence of adapting to new research environments. Initiative and Motivation: 4/5 - Founded a successful startup, showing initiative (CV). Details on drive in research lacking. Teamwork: 2/2.5 - Some collaboration shown in publications (CV). More emphasis on team capabilities needed. Leadership Potential: 2.5/2.5 - Extensive leadership experience as founder and CEO (CV). Total: 41/50. In summary, the candidate has strong management experience in startups but would benefit from more direct AI/ML and research program expertise. Cultural fit seems good and leadership potential is strong. I would recommend an interview to further assess motivation and technical abilities.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 175k - 255k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 78.0
    },
    {
        "uuid": 80,
        "company": "Anthropic",
        "title": "Business Operations",
        "fit_applicant": 27,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because some innovation in AI systems but more focused on business operations than core research. Flexible/remote work arrangements 4 because hybrid policy with 25% office time provides some flexibility. Autonomy and independence 3 because brings order to chaos and develops processes but in startup environment. Alignment with interests 5 because advanced AI systems with social and ethical implications. Opportunities to publish research 1 because business operations role. Compensation level 5 because USD 200-330k is quite high. Work/life balance 3 because hybrid policy limits full remote flexibility. Impact and meaning 3 because ensuring safe and beneficial AI has impact. Collaborative team environment 2 because partnering across functions but limited detail. Career advancement prospects 1 because startup growth but advancement path unclear.",
        "fit_recruiter": 51.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and grew a successful consumer goods company from 0 to 7 figures in revenue across 31 countries (Saturo Foods) (CV). Has experience in strategy, planning, management, cost-cutting, process optimization at a fast-growing company (Novritsch Trading) (CV). \n\nEducational Qualifications: 3/5 - Has a relevant engineering degree but no formal business education (CV).\n\nCultural Fit: 5/7.5 - Entrepreneurial experience starting a company suggests comfort with innovative, fast-paced environments (CV). Collaborative teamwork evidenced by cross-functional leadership experience (CV).  \n\nCommunication Skills: 6/7.5 - No direct evidence but can be reasonably assumed from leadership experience.\n\nProblem-Solving Ability: 7/5 - Strong problem-solving skills demonstrated through cost-cutting, process optimization projects (CV).\n\nAdaptability: 5/5 - Ran own startup and led consulting projects, evidencing ability to adapt (CV). \n\nInitiative and Motivation: 7/5 - Clearly exhibits strong drive and initiative based on entrepreneurial experience starting and growing a company (CV).\n\nTeamwork: 3/2.5 - Some team collaboration shown in projects but limited emphasis (CV).\n\nLeadership Potential: 5/2.5 - Has proven leadership experience running a company and leading teams (CV).\n\nTotal: 51/50\n\nIn summary, the candidate has exceptionally strong entrepreneurial experience starting and scaling a company rapidly. He exhibits many of the required capabilities like leadership, problem-solving, adaptability and drive. His technical background is less tailored to the specific role but overall he seems an extremely strong fit. I would highly recommend progressing to the interview stage.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 200k - 330k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 78.0
    },
    {
        "uuid": 29,
        "company": "Liebherr",
        "title": "Projektleiter Logistik",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because logistics project management provides some challenge but not AI research. Flexible/remote work arrangements 7 because home office and flexible hours mentioned. Autonomy and independence 5 because leading projects indicates autonomy but still reporting to management. Alignment with interests 3 because logistics not a core interest but Liebherr is innovative manufacturer. Opportunities to publish research 1 because no research focus. Compensation level 5 because competitive pay likely but no salary provided. Work/life balance 6 because home office and flexible hours positive. Impact and meaning 2 because some value enabling logistics but limited societal impact. Collaborative team environment 3 because partnering mentioned but culture details lacking. Career advancement prospects 3 because large company so promotions possible but trajectory unclear.",
        "fit_recruiter": 40.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Managed end-to-end logistics for own company (CV), Experience in supply chain management (CV),  Lacks specific project management experience in logistics (CV) Educational Qualifications: 3/5 - Technical university degree in industrial engineering (CV), No direct logistics qualifications mentioned (CV) Cultural Fit: 5/7.5 - Experience in innovative start-up suggests adaptability (CV), International experience indicates openness (CV) Communication Skills: 6/7.5 - Fluent in German and English (CV), Published academic papers (CV), No evidence of verbal communication skills Problem-Solving Ability: 4/5 - Optimized processes and costs for own company (CV), Analytical skills shown in research (CV), No logistics-specific examples provided Adaptability: 4/5 - Worked in multiple countries and roles (CV), Switched from engineering to business (CV), No evidence adapting to new logistics processes Initiative and Motivation: 5/5 - Founded successful startup (CV), Pursued additional education and research (CV) Teamwork: 3/2.5 - Some collaboration mentioned (CV), But focus seems to be individual achievements Leadership Potential: 3/2.5 - Managed own startup (CV), No other leadership examples provided Total: 40/50 In summary, the candidate has strong general business and analytical skills but lacks direct logistics project management experience. Cultural fit seems reasonable but more evidence of teamwork and leadership in logistics would be beneficial. I would recommend an interview to further assess motivation and logistics capabilities.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Bischofshofen, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 78.0
    },
    {
        "uuid": 8,
        "company": "European Commission",
        "title": "Scientific Project Officer",
        "fit_applicant": 37,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 15/20\nThe role involves research at the cutting edge of trustworthy AI, which provides intellectual stimulation. However, it is focused on policy support rather than core AI research.\n\nFlexible/remote work arrangements: 10/15 \nThe role offers a family-friendly environment with some remote work, but also travel is mentioned. Details on remote work policy are unclear.\n\nAutonomy and independence: 10/15\nThe job involves independent research but also close collaboration with teams, so moderate autonomy.\n\nAlignment with interests: 7/10\nThe focus on trustworthy AI and societal impact aligns with interests, but policy support work may be less exciting than research.  \n\nOpportunities to publish research: 3/5\nResearch is a component but policy support is the priority. Unclear if publishing is encouraged.\n\nCompensation level: 2/10\nSalary range of 56-62k Euros is below expectations for the role and experience level.\n\nWork/life balance: 8/10\nEnvironment described as family-friendly and some remote work available suggest good work/life balance.\n\nImpact and meaning: 5/5\nContributing to trustworthy AI policies has big societal impact.\n\nCollaborative team environment: 4/5\nClose collaboration with multidisciplinary teams across sites.\n\nCareer advancement prospects: 3/5\nProgression within EU institutions may be possible but limited detail provided.\n\nFinal fit score: 37/50",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications, projects and industrial experience (founded AI company, AI consulting) (CV). Educational Qualifications: 5/5 - Relevant PhD in Industrial Engineering (CV). Cultural Fit: 6/7.5 - Experience in innovative startups suggests cultural fit (founded company) (CV). Communication Skills: 7.5/7.5 - Publications demonstrate writing skills. Fluent in English, German, French (CV). Problem-Solving Ability: 4/5 - Some evidence of problem-solving in projects and publications (CV). More industrial problems would help. Adaptability: 4/5 - Startup and consulting suggests adaptability, but more evidence would be better (CV). Initiative and Motivation: 5/5 - Founded company and pursued research projects show strong initiative (CV). Teamwork: 2.5/2.5 - Some team projects mentioned (CV). More teamwork emphasis would be beneficial. Leadership Potential: 2/2.5 - Limited evidence, but has startup leadership experience (CV). Total: 41/50. In summary, very strong technical skills and PhD. Cultural fit seems good. More proven teamwork and industrial problem-solving would further strengthen candidacy.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 56k - 62k",
        "location": "Seville, Spain or Ispra, Italy",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 78.0
    },
    {
        "uuid": 40,
        "company": "Lidl",
        "title": "Senior Buyer Food",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because some innovation in developing new products but not AI focused. Flexible/remote work arrangements 6 because can work from home 2 days per week. Autonomy and independence 10 because managing product portfolio and negotiating with suppliers indicates independence. Alignment with interests 3 because retail business has lower risk tolerance than startups. Opportunities to publish research 0 because no research publishing in this commercial role. Compensation level 5 because base salary of 75k Euros meets expectations. Work/life balance 6 because work from home flexibility. Impact and meaning 0 because limited societal impact selling food, though some through CSR initiatives. Collaborative team environment 0 because no details provided about culture and teamwork. Career advancement prospects 0 because progression path not mentioned.",
        "fit_recruiter": 43.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Has extensive experience in product development, procurement, cost-cutting, and supply chain management in the food/FMCG industry (CEO of food startup, consulting for trading company) (CV). Educational Qualifications: 3/5 - No degree specifically in business, supply chain management or procurement, but an engineering degree demonstrates strong analytical capabilities (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience starting a food company from scratch and leading it to profitability shows ability to work in a fast-paced, innovative environment. Cost-focused approach aligns with Lidl's culture (CV). Communication Skills: 6/7.5 - Fluent in English and German. Clear written communication evidenced by publications. More evidence of verbal communication skills would be beneficial (CV). Problem-Solving Ability: 5/5 - Strong problem-solving and analytical skills demonstrated through operations, supply chain and cost optimization projects (CV). Adaptability: 4/5 - Varied experience in startups, consulting, and research suggests adaptability, but more evidence in buyer/procurement roles specifically would be better. Initiative and Motivation: 5/5 - Clearly exhibits strong drive and initiative in entrepreneurial endeavors and side projects (CV). Teamwork: 3/2.5 - Some evidence of team collaboration but limited emphasis on teamwork capabilities (CV). Leadership Potential: 2/2.5 - Led a startup company, but no large teams. Leadership potential but would need further development (CV). Total: 43/50 In summary, the candidate has very relevant procurement and supply chain optimization experience that is a great fit for the role. Cultural fit and motivation also seem strong. But more evidence specifically in buyer/procurement roles at larger companies would strengthen their candidacy. I would recommend progressing to the interview stage.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 75k",
        "location": "Salzburg, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 77.0
    },
    {
        "uuid": 74,
        "company": "Center for AI Safety",
        "title": "Project Manager",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because work is focused on AI safety research which is intellectually stimulating, involves conceptual and technical research, and is in the AI field. Flexible/remote work arrangements 0 because role is on-site in San Francisco. Autonomy and independence 10 because must work autonomously to fully own projects while also collaborating. Alignment with interests 10 because focused on AI safety research and technology startups. Opportunities to publish research 0 because project management role less focused on publishing. Compensation level 5 because salary range of USD 80-120k is reasonable but below benchmark of USD 200k. Work/life balance 5 because location in San Francisco could enable good work/life balance. Impact and meaning 10 because projects are critical for growth of AI safety community. Collaborative team environment 5 because small growing team and interdisciplinary collaboration valued. Career advancement prospects 5 because startup environment enables growth.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience founding and leading a startup from 0 to 7-digit revenue (CV). Managed investment rounds, product development, and international expansion (CV). Consulting experience in strategy, planning, alignment, and process optimization (CV). Educational Qualifications: 3/5 - Relevant engineering degree but no formal project management education (CV). Cultural Fit: 5/7.5 - Experience in innovative startups suggests comfort with fast-paced environments (CV). Interest in biohacking and human enhancement aligns with AI safety goals (CV). Communication Skills: 6/7.5 - Clearly communicated complex ideas through publications (CV). Fluency in English and German demonstrated (CV). Problem-Solving Ability: 5/5 - Evidenced by successful startup growth and consulting work (CV). Adaptability: 4/5 - Startup experience shows ability to adapt, though more details would help (CV). Initiative and Motivation: 5/5 - Clearly demonstrated through founding a startup and driving growth (CV). Teamwork: 3/2.5 - Some collaboration shown but limited emphasis on team capabilities (CV). Leadership Potential: 3/2.5 - Demonstrated leadership as startup founder (CV). Total: 42/50. In summary, the candidate shows strong entrepreneurial experience and initiative but is relatively untested in a project management role. Cultural fit seems reasonable but more details on aligning with the AI safety mission would help. Overall a decent candidate worth interviewing to further assess project management skills.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 80k - 120k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 76.0
    },
    {
        "uuid": 12,
        "company": "Stockholm International Peace Research Institute",
        "title": "Researcher, Governance of Artificial Intelligence",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because the role involves researching AI governance which provides intellectual stimulation, however it is not directly in the AI development field. The complexity of researching AI risks and governance provides challenge. Flexible/remote work arrangements 5 because the role is based in Stockholm so not fully remote, but some flexibility may be possible. Autonomy and independence 10 because the researcher has responsibility for developing expertise, conducting research, organizing events, and contributing to the institute. This suggests a high degree of autonomy. Alignment with interests 8 because the focus on AI governance, risks, and peace/security aligns with interests in AI ethics and responsible innovation. Opportunities to publish research 10 because publishing research is a key responsibility of the role. Compensation level 5 because salary not provided but likely competitive for academic research. Work/life balance 8 because academic research enables flexibility. Location in Stockholm provides good work/life balance. Impact and meaning 10 because the research has direct impact on AI governance and policy with a focus on peace/security. High meaning potential. Collaborative team environment 5 because will collaborate with other researchers but team environment not emphasized. Career advancement prospects 5 because experience would enable future research career development but advancement prospects not clearly stated.",
        "fit_recruiter": 37.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong technical skills in AI/ML and software engineering (Product development at startup). Research experience through academic projects and publications (3 papers at top conferences). Some limited industrial research experience (Vistaprint internship). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with specialization in IT (Diploma from TU Darmstadt). Cultural Fit: 5/7.5 - Fast-paced startup experience suggests ability to work in an innovative environment (Founder of food tech startup). Collaborated in teams for academic projects (3 papers). Communication Skills: 6/7.5 - Writes technical details clearly in English based on publications. Verbal skills evidenced by presentations. German also a plus. Problem-Solving Ability: 3/5 - Showed analytical skills in academic projects and startup, but limited evidence of solving complex research problems. Adaptability: 3/5 - Varied background provides some evidence, but more examples in research would be better. Initiative and Motivation: 4/5 - Founded a startup and pursued research, showing initiative, but more examples in a research role needed. Teamwork: 2/2.5 - Some collaboration for academic projects, but more emphasis on teamwork capabilities would be beneficial. Leadership Potential: 1/2.5 - No clear evidence, but could likely develop over time. Total: 37/50 In summary, the candidate has a strong technical background but lacks proven experience in an industrial research role. Cultural fit and potential are decent but more examples of research leadership would strengthen their candidacy. I would recommend an interview to further assess research motivation and experience.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Solna, Sweden",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 75.0
    },
    {
        "uuid": 77,
        "company": "Mostly AI",
        "title": "Product Marketing Manager",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because innovative synthetic data and AI technology provides intellectual challenge, though not directly in AI research. Flexible/remote work arrangements 15 because fully remote role with flexibility mentioned. Autonomy and independence 10 because self-starter role suggests autonomy. Alignment with interests 10 because synthetic data and privacy-preserving AI aligns with interests. Opportunities to publish research 1 because commercial marketing role less focused on publishing. Compensation level 5 because competitive salary but no details provided. Work/life balance 10 because remote work supports balance. Impact and meaning 5 because synthetic data enables broader access to data while protecting privacy. Collaborative team environment 3 because collaborating with marketing, sales, product teams but limited detail on culture. Career advancement prospects 5 because growth potential in expanding startup but trajectory unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience in product marketing and growth marketing for tech companies, especially AI/ML (Saturo, Novritsch). Educational Qualifications: 3/5 - Relevant engineering degree but no marketing degree. Cultural Fit: 6/7.5 - Entrepreneurial experience fits innovative culture. Communication Skills: 7/7.5 - Fluent in English and German with strong presentation skills. Problem-Solving Ability: 5/5 - Strategic thinking and data-driven problem solving demonstrated. Adaptability: 4/5 - Experience scaling startups shows adaptability. Initiative and Motivation: 3/5 - Founded company displaying initiative. More evidence in marketing roles needed. Teamwork: 2/2.5 - Some collaboration shown but more emphasis on individual achievements. Leadership Potential: 2/2.5 - Leadership experience but not much potential evidenced. Total: 41/50 - Very strong marketing background and cultural fit, but more motivation evidence needed in marketing roles specifically.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 75.0
    },
    {
        "uuid": 11,
        "company": "The Elders",
        "title": "AI Consultant",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because consulting on AI risks and opportunities across The Elders' programs provides intellectual challenge in AI field. Flexible/remote work arrangements 10 because fully remote role with flexible timeframe. Autonomy and independence 8 because independent consulting role though some direction provided. Alignment with interests 6 because focus on social impact of AI is aligned with interests. Opportunities to publish research 0 because consulting focused, no mention of publishing. Compensation level 0 because no salary provided, likely market rate. Work/life balance 10 because remote and timeline flexible. Impact and meaning 10 because advising on AI risks/opportunities for peace, justice and human rights. Collaborative team environment 0 because independent role, limited team collaboration mentioned. Career advancement prospects 0 because short-term role.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications, academic projects, and founding an AI company (Saturo). Also has software engineering and data science skills. Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with computer science. Cultural Fit: 6/7.5 - Experience founding an innovative startup suggests cultural fit. Desire for teamwork evidenced by collaborations. Communication Skills: 7.5/7.5 - Fluent in English and German with technical writing skills shown through publications. Problem-Solving Ability: 4/5 - Analytical skills demonstrated through academic work, but details of specific industrial problems lacking. Adaptability: 4/5 - Varied background provides adaptability, though more evidence in research settings needed. Initiative and Motivation: 4/5 - Founded a company and pursued research, indicating initiative. More evidence in a research role would be beneficial. Teamwork: 2/2.5 - Some teamwork evidenced through projects. More emphasis on capabilities would help. Leadership Potential: 2/2.5 - Limited evidence, but has potential to develop over time. Total: 41/50. In summary, very strong technical skills and decent cultural fit. More proven experience solving industrial problems in a research role would further strengthen candidacy, but has good potential.",
        "date_added": "July 13, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 75.0
    },
    {
        "uuid": 73,
        "company": "BearingPoint",
        "title": "Senior Consultant",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because AI/ML focus provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 10 because flexible working models mentioned including remote. Autonomy and independence 10 because senior role suggests autonomy. Alignment with interests 5 because consulting aligns with technology and innovation interests. Opportunities to publish research 0 because consulting focus, less on publishing. Compensation level 5 because EUR 80-100k is reasonable but below benchmark. Work/life balance 5 because flexible working models. Impact and meaning 3 because consulting projects can enable impact. Collaborative team environment 2 because teamwork mentioned but culture unclear. Career advancement prospects 2 because growth opportunities but trajectory uncertain.",
        "fit_recruiter": 43.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience in process optimization, cost-cutting, supply chain management from managing own company and consulting roles (Saturo, Novritsch) (CV). Lacks direct consulting experience at major firms. Educational Qualifications: 3/5 - Relevant engineering degree but not specialized in consulting or business (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience and international exposure suggests adaptability. Consulting experience is limited. (CV) Communication Skills: 6/7.5 - Fluent in English and German. Presentation skills evidenced. No direct evidence of written communication. (CV) Problem-Solving Ability: 6/5 - Strong problem-solving skills demonstrated in cost-cutting, process optimization projects. More details would be beneficial. (CV) Adaptability: 5/5 - Varied background and international experience indicates adaptability. More evidence in consulting roles needed. (CV) Initiative and Motivation: 4/5 - Founded a successful company, indicating initiative. More examples in consulting environment would be better. (CV) Teamwork: 3/2.5 - Some collaboration shown but limited emphasis on teamwork capabilities. (CV) Leadership Potential: 3/2.5 - Managed teams in own company but no evidence in consulting. (CV) Total: 43/50 In summary, the candidate has strong technical skills and problem-solving abilities but is relatively inexperienced in consulting. Cultural fit seems reasonable but more proven teamwork and leadership in consulting would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 80k - 100k",
        "location": "Berlin, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 75.0
    },
    {
        "uuid": 20,
        "company": "Digital Waffle",
        "title": "AI Engineer",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because AI/ML engineering role focused on Python and Tensorflow/PyTorch/Sklearn, aligning with interests. Flexible/remote work arrangements 10 because fully remote work and flexible hours offered. Autonomy and independence 10 because collaborating with engineering team but unclear on level of independence. Alignment with interests 10 because software and AI development aligns with interests. Opportunities to publish research 1 because no mention of publishing opportunities. Compensation level 5 because 45k-65k EUR salary range is decent but below 100k benchmark. Work/life balance 8 because fully remote, flexible hours. Impact and meaning 2 because some societal impact through AI products but unclear. Collaborative team environment 3 because collaborating with engineering team but culture unclear. Career advancement prospects 2 because startup may enable fast growth but path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 9/10 - Strong Python and ML skills proven by AI research publications (Technical University Darmstadt). Industrial experience limited but founded a tech startup (Saturo Foods). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (Technical University Darmstadt). Cultural Fit: 5/7.5 - Startup experience suggests comfort with innovative culture. Military training indicates discipline. Communication Skills: 6/7.5 - Fluent in English and German. Can communicate technical details in publications. More evidence of verbal skills would be beneficial. Problem-Solving Ability: 4/5 - Research publications demonstrate analytical skills. More industrial problem solving examples needed. Adaptability: 3/5 - Varied background provides some evidence. More proof of adaptability in tech roles needed. Initiative and Motivation: 4/5 - Founded a startup and pursued research projects. More examples in AI/tech context preferred. Teamwork: 3/2.5 - Some collaboration shown in research. More teamwork emphasis would be better. Leadership Potential: 2/2.5 - Limited evidence. Leadership could likely develop over time. Total: 41/50 In summary, the candidate has a strong technical skillset but his experience is more academic than industrial. Cultural fit seems reasonable but more proven adaptability and teamwork in tech environments would be preferred. I would recommend an interview to further assess motivation and fit.",
        "date_added": "June 2, 2023",
        "salary_range": "EUR 45k - 65k",
        "location": "Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 75.0
    },
    {
        "uuid": 10,
        "company": "gt.school",
        "title": "AI Prompt Engineer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because role focuses on iterating AI prompts for education which provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 10 because full-time remote role based in US with flexible hours. Autonomy and independence 10 because collaborates with team but independently evaluates and improves AI models. Alignment with interests 10 because role combines interests in AI and education. Opportunities to publish research 0 because no mention of publishing research. Compensation level 5 because $100k salary is reasonable for role and location but below desired six-figure benchmark. Work/life balance 10 because full-time remote with flexible hours enables good work/life balance. Impact and meaning 15 because improving AI tools for education has meaningful impact. Collaborative team environment 5 because collaborates closely with academic team. Career advancement prospects 3 because growth opportunities through mentorship but advancement path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has experience with generative AI and prompt engineering for GPT-2/3 (CV). Industrial experience limited but academic projects relevant (CV). Educational Qualifications: 5/5 - Master's degree in relevant field of computer science/engineering (CV). Cultural Fit: 7/7.5 - Experience founding a startup suggests comfort with innovative culture (CV). Desire for collaboration evidenced by publications (CV). Communication Skills: 6/7.5 - Fluent in English and German, can communicate technical details (CV). Minimal evidence of writing skills. Problem-Solving Ability: 4/5 - Analytical skills demonstrated through academic projects and publications (CV). More industrial problem solving evidence needed. Adaptability: 4/5 - Varied background suggests adaptability but more evidence in industrial settings needed (CV). Initiative and Motivation: 3/5 - Founded a company showing initiative (CV). More evidence in research roles needed. Teamwork: 3/5 - Some collaboration shown in publications (CV). More emphasis on team skills needed. Leadership Potential: 2/2.5 - Limited evidence of leadership potential currently (CV). Total: 41/50. In summary, candidate has relevant technical skills but is junior. Cultural fit seems decent but more proven industrial research experience would strengthen candidacy. Recommend interview to further assess motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 100k",
        "location": "United States",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 74.0
    },
    {
        "uuid": 51,
        "company": "KI group",
        "title": "AI Engineer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because role focuses on implementing state-of-the-art AI solutions which provides intellectual challenge, though not necessarily publishing research. Flexible/remote work arrangements 5 because hybrid setup mentioned but details on remote flexibility unclear. Autonomy and independence 10 because responsible for end-to-end ML pipelines with guidance from data platform teams. Alignment with interests 10 because role is focused on latest AI and ML technologies. Opportunities to publish research 0 because implementing solutions for customers rather than publishing research. Compensation level 5 because estimated 80k-100k EUR salary range is reasonable but below benchmark expectation. Work/life balance 5 because hybrid setup provides flexibility but unclear if fully remote available. Impact and meaning 5 because AI solutions aim to deliver business value but societal impact unclear. Collaborative team environment 5 because intercultural team environment suggests collaboration. Career advancement prospects 3 because professional growth mentioned but advancement path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications (Paper in conference ECIS). Founded a company applying AI/ML. Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV). Cultural Fit: 6/7.5 - Experience in fast-paced startups suggests cultural fit (Founder of Saturo). Communication Skills: 6/7.5 - Fluent in English and German (CV). Some evidence of writing skills (Publications). Problem-Solving Ability: 4/5 - Analytical skills evidenced by academic projects and publications (CV). Adaptability: 5/5 - Experience across startups, consulting, and military training suggests high adaptability. Initiative and Motivation: 5/5 - Founded a successful company, evidence of self-drive. Teamwork: 2.5/2.5 - Some evidence of team collaboration on projects (CV). Leadership Potential: 2.5/2.5 - Leadership as founder of startup. Total: 41/50. In summary, the candidate has very strong technical skills and experience in AI/ML. Cultural fit seems good and the candidate exhibits initiative and leadership potential. More direct industrial experience would be beneficial but overall the candidate seems like a decent fit.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 80k - 100k",
        "location": "Cologne, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 74.0
    },
    {
        "uuid": 76,
        "company": "Biotest",
        "title": "Demand Chain Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because supply chain analytics provides some challenge but not in AI field. Flexible/remote work arrangements 0 because no mention of remote or flexible options. Autonomy and independence 4 because managing planning and forecasting indicates some independence. Alignment with interests 3 because pharmaceutical company but not a tech startup. Opportunities to publish research 0 as this is a commercial operations role. Compensation level 5 based on expected salary for this role and location. Work/life balance 3 because no indication of balance focus. Impact and meaning 5 because 'life saving mission' of biotech has impact. Collaborative team environment 4 because cross-functional collaboration mentioned. Career advancement prospects 4 because growth company but path unclear.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience in supply chain management, demand planning, forecasting, and SAP in international companies (Saturo, Novritsch). Industrial engineering education provides relevant skills. However, no direct experience in pharmaceutical industry. (CV: Founder Saturo, C-Level Consulting Novritsch) Educational Qualifications: 3/5 - Diploma in industrial engineering provides relevant formal education. However, no specific degree in supply chain management or operations. (CV: Diploma Industrial Engineering TU Darmstadt) Cultural Fit: 4/7.5 - Entrepreneurial background and work in fast-paced environments suggests cultural fit, but limited evidence of fit with pharma culture specifically. (CV: Founder Saturo) Communication Skills: 6/7.5 - Fluent in English and German. Communication skills evidenced by presentations and management roles, but scientific publishing is lacking. (CV: Languages) Problem-Solving Ability: 6/5 - Strong problem-solving skills demonstrated through cost-cutting, process optimization, and management consulting projects. However, limited evidence in pharma context. (CV: Cost-cutting, Process Optimization at Novritsch) Adaptability: 3/5 - Has worked in multiple countries and industries, indicating adaptability. However, limited evidence adapting to new situations inside a company. (CV: International Experience) Initiative and Motivation: 5/5 - Clearly demonstrates initiative through entrepreneurial endeavors and pursuing additional education/training. (CV: Founder Saturo, Special Operations Training) Teamwork: 3/2.5 - Some evidence of teamwork through collaborations and managing others. More emphasis on independent leadership roles. (CV: Founder Saturo) Leadership Potential: 4/2.5 - Leadership experience as founder and consultant. However, no evidence of leadership development inside a corporation. (CV: Founder Saturo) Total: 42/50 In summary, the candidate has strong supply chain management experience and problem-solving skills, but lacks specific pharma industry background. Initiative and leadership are clearly demonstrated, but evidence of cultural fit and ability to adapt within a corporate environment is more limited. Additional insight into teamwork and communication style would be beneficial.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Dreieich, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 74.0
    },
    {
        "uuid": 54,
        "company": "RAND",
        "title": "Vice President",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because policy research is stimulating but not AI focused. Flexible/remote work arrangements 7 because mix of office and remote work. Autonomy and independence 10 because VP level indicates high autonomy. Alignment with interests 7 because policy research aligns with interests. Opportunities to publish research 1 because focused on applied policy research. Compensation level 3 because USD 200-315k is high but lower priority. Work/life balance 5 because mix of office and remote provides flexibility. Impact and meaning 10 because policy research enables impact on communities. Collaborative team environment 5 because leading teams indicates collaboration. Career advancement prospects 4 because VP role enables further growth.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has strong experience leading and managing teams, organizations and projects, including startups, consulting engagements and military training (Founder Saturo, C-Level Consulting, Special Forces Training). Significant strategic planning and business development experience (Strategic Planning at Saturo and Novritsch, Business Development for RAND Australia Board). Research and analytical skills evidenced through scientific publications. (3 papers at top conferences)\n\nEducational Qualifications: 3/5 - Has a relevant engineering degree but at the diploma level, not a master's. Still solid technical education background. (Diploma Industrial Engineering)  \n\nCultural Fit: 5/7.5 - Entrepreneurial experience and innovative thinking suggests good fit for RAND's culture. International exposure also aligns. (Startup Founder, Exchange Year in US, Project in India)\n\nCommunication Skills: 6/7.5 - Fluent in English and German. Public speaking and presentation skills likely developed through startup, consulting and publications. Scientific writing ability proven through publications.\n\nProblem-Solving Ability: 5/5 - Strong problem-solving orientation demonstrated through hands-on operational experience in startups, consulting projects and process optimization work. (Value Stream Mapping at Linde)  \n\nAdaptability: 4/5 - Varied background provides adaptability, though most experience is in operational rather than research settings. (Startup, Military, Consulting)\n\nInitiative and Motivation: 5/5 - Clearly exhibits strong drive and initiative as startup founder and through pursuing diverse international experiences. \n\nTeamwork: 3/2.5 - Some evidence of teamwork through collaborations and cross-functional work, but primary background is individual leadership.\n\nLeadership Potential: 3/2.5 - Has clearly demonstrated leadership capabilities as startup founder and military trainee. Still room to develop further at the VP level.\n\nTotal: 42/50\n\nIn summary, the candidate has very strong leadership, management and problem-solving skills that translate well. Cultural fit with RAND seems decent. The main gap is the lack of a graduate degree and deep research experience, but the operational background is still relevant. With some onboarding, they could likely adapt and succeed in the role. I would recommend progressing to the interview stage.",
        "date_added": "July 12, 2023",
        "salary_range": "USD 200k - 315k",
        "location": "Santa Monica, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 74.0
    },
    {
        "uuid": 30,
        "company": "Anthropic",
        "title": "Product Support Specialist",
        "fit_applicant": 35,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on AI products provides some intellectual stimulation, but support role is more reactive than actively advancing research. Flexible/remote work arrangements 6 because hybrid policy with 25% office time provides flexibility. Autonomy and independence 4 because building processes indicates some independence but reactive support limits autonomy. Alignment with interests 7 because Anthropic's AI mission aligns with interests. Opportunities to publish research 0 because no research focus in support role. Compensation level 4 because USD 115-130k is reasonable but below benchmark. Work/life balance 6 because unlimited PTO and hybrid remote work supports balance. Impact and meaning 3 because enabling safe AI has impact but support role is indirect. Collaborative team environment 2 because engaging with users and internal teams indicates collaboration. Career advancement prospects 2 because startup may enable growth but support role has unclear trajectory.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Founded and scaled a startup to 7-digit revenue (CV). Consulting experience at Novritsch (CV). Some project management and process optimization experience (CV). Lacks specific experience in adult education industry and managing a non-profit. Educational Qualifications: 3/5 - Diploma in Industrial Engineering, but no degree specifically in education, non-profit management or a closely related field (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience fits innovative culture (CV). But limited evidence of commitment to goals of labor organizations. Communication Skills: 6/7.5 - Writes publications and speaks multiple languages (CV). But communications experience focused on business, less evidence with educational stakeholders. Problem-Solving Ability: 4/5 - Some consulting and industrial engineering experience suggests problem-solving skills (CV). But limited evidence applying this in the non-profit context. Adaptability: 3/5 - Varied background provides some evidence of adaptability (CV). But limited evidence adapting specifically to needs of a non-profit organization. Initiative and Motivation: 4/5 - Shows initiative as founder and through pursuing research (CV). But limited evidence in driving educational programs specifically. Teamwork: 3/2.5 - Some collaboration experience (CV). But team skills not heavily emphasized. Leadership Potential: 3/2.5 - Management experience as founder, but no context leading a non-profit (CV). Total: 38/50 In summary, the candidate has strong general management experience as a founder, but lacks non-profit sector specific skills and experience. Cultural fit is questionable. With training could grow into the role over time, but is not an ideal immediate fit.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 115k - 130k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 75,
        "company": "ALDI SÜD",
        "title": "Senior Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because developing global strategy requires creative thinking, but not focused on AI research. Flexible/remote work arrangements 10 because can work remotely 13 days per month and 30 days abroad. Autonomy and independence 10 because high level of responsibility and establishing new functions indicates autonomy. Alignment with interests 3 because retail company so only moderate technology focus and risk taking. Opportunities to publish research 0 because no research publishing in this commercial role. Compensation level 8 because 113k Euro salary exceeds 100k benchmark but below US double. Work/life balance 8 because 6 weeks vacation, remote work flexibility. Impact and meaning 1 because retail business has moderate societal impact. Collaborative team environment 2 because must collaborate across borders but limited cultural details. Career advancement prospects 3 because can develop global strategy team but trajectory unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Extensive experience leading international company with multi-million revenue, strategy development, project management (CV). Educational Qualifications: 5/5 - Relevant engineering diploma with excellent grades (CV). Cultural Fit: 6/7.5 - Entrepreneurial experience in fast-paced environment suggests cultural fit (CV). Communication Skills: 7.5/7.5 - Fluent in English, German, French (CV). Excellent presentation skills evidenced by experience (CV). Problem-Solving Ability: 4/5 - Strategic planning and cost-cutting projects demonstrate problem-solving skills (CV). More engineering-specific examples would be beneficial. Adaptability: 4/5 - Varied experience suggests adaptability, though more change management examples would be better. Initiative and Motivation: 4/5 - Founded successful company, showing initiative (CV). More examples in corporate roles desired. Teamwork: 2.5/2.5 - Some team collaboration evidenced (CV). More emphasis on team leadership would be stronger. Leadership Potential: 2.5/2.5 - Proven leadership experience as CEO (CV). Corporate leadership experience limited. Total: 41/50 In summary, an experienced strategic leader and entrepreneur with excellent general business skills and qualifications. Cultural fit seems good. More focus on team leadership and change management would further strengthen candidacy.",
        "date_added": "July 13, 2023",
        "salary_range": "EUR 113k",
        "location": "Salzburg, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 45,
        "company": "Bundesrechenzentrum",
        "title": "KI Project Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 4 The role involves some interesting KI work but is more focused on coordination and project management rather than hands-on KI research and development. There is some complexity in stakeholder management but core work is not AI focused. Flexible/remote work arrangements: 6 Role is based in Vienna but offers flexibility for remote work up to 60% of time. No strict core hours mentioned. Autonomy and independence: 3 Need to collaborate closely with teams and stakeholders so autonomy seems limited. Following direction of section and department leadership indicates less independence. Alignment with interests: 2 Public sector role focused on coordinating KI strategy implementation. Does not align with interests in startups and commercial technology focus. Opportunities to publish research: 1 No research or publishing component mentioned. Focus is on project coordination and management. Compensation level: 3 Salary range of EUR 73-80k is reasonable but below the EUR 100k benchmark target for Europe. Public sector role may limit upside. Work/life balance: 5 Flexible schedule and up to 60% remote work enables good work/life balance. Impact and meaning: 3 Coordination role in public sector provides opportunity to shape KI adoption and strategy but impact is somewhat indirect. Collaborative team environment: 3 Need to liaise across teams and stakeholders but limited detail provided on culture and environment. Career advancement prospects: 2 Progression opportunities within public sector may be steady but limited. Startup offers more dynamic growth potential.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong technical skills in AI/ML evidenced by academic projects and publications (CV: Scientific Publications) - Some software engineering skills shown through developing a mobile app (CV: Indian Institute of Technology) - Limited direct experience in KI project management (CV: Work Experience) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV: Education and Internships) Cultural Fit: 5/7.5 - Experience founding a startup suggests comfort with innovative environments (CV: Founder/Managing Director Saturo Foods)- Collaborated in cross-functional teams (CV: Working Student Accenture)Communication Skills: 6/7.5 - Fluent in English and German (CV: Languages)- Published academic papers demonstrate writing skills (CV: Scientific Publications)- No direct evidence of verbal communication skillsProblem-Solving Ability: 4/5 - Analytical skills shown through academic projects and publications (CV: Scientific Publications)- Industrial problem-solving experience limited Adaptability: 3/5- Varied background provides some evidence of adaptability (CV: Work Experience)- More examples of adapting to new situations would be beneficialInitiative and Motivation: 5/5 - Founded a startup and pursued research projects showing initiative (CV: Founder/Managing Director Saturo Foods, Scientific Publications) Teamwork: 3/2.5- Some team collaboration evidenced on projects (CV: Working Student Accenture)- More emphasis on teamwork capabilities would be betterLeadership Potential: 2/2.5- Limited evidence, but startup experience shows some leadership potential (CV: Founder/Managing Director Saturo Foods)Total: 41/50In summary, the candidate has a strong technical and academic background but lacks direct experience in KI project management. Cultural fit seems decent and they exhibit initiative and leadership potential, but more proven project management skills would strengthen their candidacy. I would recommend an interview to further assess their motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 73k - 80k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 25,
        "company": "Helloprint",
        "title": "Prompt Engineering Intern",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because working on implementing AI technologies and optimizing prompt engineering provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 0 because role is on-site in Valencia office. Autonomy and independence 5 because working closely with team but own testing and analysis. Alignment with interests 7 because startup using innovative technology. Opportunities to publish research 0 because commercial focus, no mention of publishing. Compensation level 1 because internship fee but no details. Work/life balance 2 because startup may require long hours. Impact and meaning 2 because improving customer experience has impact. Collaborative team environment 3 because integrated part of team. Career advancement prospects 2 because startup experience enables growth.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong technical skills in AI/ML, software engineering, and product development (CV). Limited industrial experience but academic projects in relevant areas (CV). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV). Cultural Fit: 7/7.5 - Experience in fast-paced startups suggests good fit for innovative culture (CV). Desire for teamwork a fit (CV). Communication Skills: 7.5/7.5 - Fluent in English and German, can communicate technical details (CV). Published academic papers evidence writing skills (CV). Problem-Solving Ability: 4/5 - Analytical skills shown through academic projects and publications (CV). More industrial problem solving evidence would help. Adaptability: 4/5 - Varied background suggests adaptability (CV), but more evidence in research settings needed. Initiative and Motivation: 4/5 - Founded a company and pursued research initiatives (CV). More evidence in a research role preferred. Teamwork: 2/2.5 - Some team collaboration evidenced (CV). More emphasis on capabilities could help. Leadership Potential: 2/2.5 - Limited evidence (CV), but potential is there. Total: 41/50 In summary, applicant has a strong technical background but limited industrial experience. Cultural fit and potential are decent. More proven research experience would be ideal, but I would recommend an interview to further assess motivation and fit.",
        "date_added": "June 10, 2023",
        "salary_range": "Not provided",
        "location": "Valencia, Spain",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 39,
        "company": "OpenAI",
        "title": "Research Scientist",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because working on alignment for superintelligent AI systems is highly intellectually stimulating and directly in the AI field. Flexible/remote work arrangements 0 because location is San Francisco office with no mention of remote options. Autonomy and independence 10 because owning and pursuing a research agenda indicates autonomy. Alignment with interests 10 because aligns with interest in AI safety and advanced AI systems. Opportunities to publish research 2 because research publication achievements valued but focus is on impactful internal projects. Compensation level 5 because USD 245-450k is quite high but within expected range for this role/location. Work/life balance 0 because unlimited PTO but based in San Francisco office. Impact and meaning 10 because mission to ensure beneficial AI aligns with desire for impact. Collaborative team environment 5 because fast-paced, collaborative environment. Career advancement prospects 0 because startup may enable fast growth but advancement path and trajectory unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications, academic projects, and founding an AI company (CV). Educational Qualifications: 5/5 - Relevant master's degree in computer science/engineering (CV). Cultural Fit: 6/7.5 - Experience in innovative startups suggests good fit for OpenAI's culture (CV). Communication Skills: 7.5/7.5 - Publications demonstrate excellent technical writing in English/German (CV). Problem-Solving Ability: 4/5 - Analytical skills shown in academic work, but industrial problems unclear (CV). Adaptability: 4/5 - Varied background indicates adaptability, but industrial research experience limited (CV). Initiative and Motivation: 5/5 - Founded a company, pursued research initiatives (CV). Teamwork: 2/2.5 - Some collaboration experience evident (CV). Leadership Potential: 2/2.5 - Early career stage, but potential based on achievements (CV). Total: 41/50. In summary, very strong technical skills and good cultural fit, but more hands-on industrial research experience would be beneficial. Overall a good candidate worth interviewing further.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 245k - 450k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 65,
        "company": "Bundesrechenzentrum",
        "title": "Solution Architect Predictive Analytics",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on predictive analytics solutions provides some intellectual challenge, but not specifically in AI. Flexible/remote work arrangements 6 because up to 60% remote work mentioned. Autonomy and independence 4 because architect role suggests some autonomy but unclear how much independence within team. Alignment with interests 3 because public sector focus is less aligned with startups and risk. Opportunities to publish research 1 because no indication research publishing is a priority. Compensation level 5 because base salary of 73k-100k EUR is reasonable but below benchmark. Work/life balance 6 because flexible schedule and telework options support balance. Impact and meaning 1 because services support public but limited societal impact. Collaborative team environment 1 because no detail provided on culture. Career advancement prospects 1 because trajectory and growth opportunities not mentioned.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 9/10 - Strong software engineering and AI/ML skills proven by founding a company, publications, and projects (CV). Industrial experience is more limited but has worked on relevant data science projects (CV).  Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with a focus on IT (CV). Cultural Fit: 5/7.5 - Experience founding a startup and consulting suggests ability to work in an innovative environment (CV). Collaborative approach evidenced by team projects (CV). Communication Skills: 6/7.5 - Fluent in German and proficient in English (CV). Can communicate technical details through publications (CV). Problem-Solving Ability: 5/5 - Strong analytical skills demonstrated through academic projects and publications (CV). Industrial problems solved not shown. Adaptability: 3/5 - Some evidence of adaptability through varied experiences (CV). More examples in industrial research settings would help. Initiative and Motivation: 4/5 - Exhibits initiative founding a company and pursuing research (CV). More examples of drive in research roles needed. Teamwork: 3/2.5 - Some team collaboration shown in projects (CV). More emphasis on teamwork capabilities would be beneficial. Leadership Potential: 1/2.5 - No clear evidence of leadership potential from CV. Total: 41/50 In summary, the candidate has a strong technical skillset but his experience is more academic than industrial research. He seems to have decent potential and cultural fit. More proven applied research experience and leadership examples would strengthen his candidacy. I would recommend an interview to further assess his motivation and fit.",
        "date_added": "July 9, 2023",
        "salary_range": "EUR 73k - 100k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 47,
        "company": "Inside.com",
        "title": "AI Developer",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because developing AI and NLP solutions provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 15 because fully remote role with flexible hours. Autonomy and independence 10 because full-stack development role suggests some autonomy. Alignment with interests 5 because startup focused on AI news curation aligns with interests. Opportunities to publish research 0 because no indication of research publishing. Compensation level 5 because $125k salary is reasonable but below benchmark. Work/life balance 10 because fully remote supports work/life balance. Impact and meaning 1 because news curation has limited societal impact. Collaborative team environment 1 because some collaboration mentioned but culture unclear. Career advancement prospects 0 because startup growth prospects and trajectory unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong experience developing AI/ML solutions including chatbots using NLP and models like GPT (CV). Worked on integrating AI into products and services (CV). Educational Qualifications: 5/5 - Master's degree in relevant field of computer science (CV). Cultural Fit: 6/7.5 - Experience in startups suggests ability to thrive in innovative culture (CV). Desire for remote work matches company policy (JD). Communication Skills: 7.5/7.5 - Published academic papers demonstrate written communication abilities (CV). Multilingual is a plus (CV). Problem-Solving Ability: 4/5 - Analytical skills shown through academic projects (CV). More industry evidence would be better. Adaptability: 4/5 - Varied background provides some evidence of adaptability (CV). More examples in industry would help. Initiative and Motivation: 5/5 - Founded a company displaying initiative (CV). Pursued research showing motivation (CV). Teamwork: 2.5/2.5 - Some collaboration evidence but limited details (CV). Leadership Potential: 2/2.5 - No clear leadership evidence but potential based on profile. Total: 41/50 - Very strong technical skills and cultural fit. More proven industry experience would be ideal but overall a strong candidate.",
        "date_added": "February 27, 2023",
        "salary_range": "USD 125k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 6,
        "company": "Digital Factory Vorarlberg",
        "title": "Research Engineer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because innovative AI/ML research provides intellectual stimulation, though not fully focused on AI. Flexible/remote work arrangements 3 because location is Dornbirn office with no remote details. Autonomy and independence 7 because research engineer role suggests autonomy. Alignment with interests 8 because AI/ML focus aligns with interests. Opportunities to publish research 1 because unclear if academic publishing is a priority. Compensation level 3 because estimated 60-80k EUR salary is reasonable but below 100k benchmark. Work/life balance 2 because work arrangements not specified. Impact and meaning 2 because applied industrial research has lower meaning than pure AI research. Collaborative team environment 4 because interdisciplinary teams mentioned. Career advancement prospects 3 because research role may not lead to fast career growth.",
        "fit_recruiter": 40.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has strong technical skills in AI/ML evidenced by academic projects, publications, and founding a company (Saturo Foods). Industrial experience is limited but has worked on data science projects (consulting at Novritsch). (CV: Founder Saturo Foods, Consulting Novritsch) Educational Qualifications: 5/5 - Completed a relevant master's degree in industrial engineering with a focus on business and mechanical engineering. (CV: Diploma Program)  Cultural Fit: 5/7.5 - Academic and startup experience suggests ability to work in an innovative environment. Fits desire for interdisciplinary collaboration. (CV: Founder Saturo Foods, Publications) Communication Skills: 6/7.5 - Fluent in English and German. Can communicate technical details through publications. (CV: Languages, Publications) Problem-Solving Ability: 4/5 - Shows analytical skills in academic projects and publications. Industrial problem solving experience limited. (CV: Publications) Adaptability: 3/5 - Varied background provides some evidence of adaptability. More evidence adapting in industrial research settings needed. (CV: Diverse Experience) Initiative and Motivation: 4/5 - Exhibits initiative through starting a company and pursuing research. More evidence of drive in research role would be beneficial. (CV: Founder Saturo Foods, Publications) Teamwork: 3/2.5 - Some collaboration shown in projects and startups. More emphasis on team skills would strengthen application. (CV: Experience) Leadership Potential: 2/2.5 - Limited evidence, but shows some leadership in founding a company. (CV: Founder Saturo Foods) Total: 40/50 In summary, the candidate has a strong technical and academic background but limited industrial research experience. Cultural fit seems decent and they exhibit potential, but more proven applied research experience would better position them for this role. I would recommend an interview to further assess their motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 80k",
        "location": "Dornbirn, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 67,
        "company": "Founders Pledge",
        "title": "Researcher",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because researching high-impact philanthropy requires creative problem-solving. Flexible/remote work arrangements 10 because the role is fully remote. Autonomy and independence 5 because research roles often allow independence but unclear if this role oversees a team. Alignment with interests 10 because the role focuses on effective altruism and high-impact philanthropy. Opportunities to publish research 2 because research publication opportunities are not mentioned. Compensation level 1 because salary range not provided, likely competitive but unclear. Work/life balance 8 because fully remote suggests flexibility. Impact and meaning 10 because researching high-impact giving has tremendous meaning. Collaborative team environment 3 because collaboration mentioned but culture unclear. Career advancement prospects 3 because growth opportunities not detailed.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong research skills evidenced by scientific publications, academic projects, and consulting experience focused on business intelligence and management systems (Technical University Darmstadt publications, C-Level Consulting). Lacks direct experience in EA methodology and charity evaluation. Educational Qualifications: 5/5 - Relevant diploma in Industrial Engineering with top 10% grades (Diploma Program). Cultural Fit: 5/7.5 - Entrepreneurial experience starting a business suggests comfort with innovative, fast-paced environments. Interests in human optimization indicate values aligned with improving humanity. Communication Skills: 6/7.5 - Fluent in English and German with published academic writing. More evidence of verbal communication skills would be beneficial. Problem-Solving Ability: 4/5 - Demonstrated analytical skills through academic projects and publications, but limited evidence of solving real-world problems. Adaptability: 3/5 - Varied work experience suggests adaptability, but more evidence adapting in research settings needed. Initiative and Motivation: 4/5 - Founded a business displaying initiative. Interests in self-improvement indicate motivation. More evidence in research roles preferred. Teamwork: 3/2.5 - Some collaboration shown in academic and consulting projects. More teamwork emphasis would be better. Leadership Potential: 3/2.5 - Led a small business, suggesting basic leadership potential. Total: 41/50 In summary, the candidate has strong research qualifications but is relatively inexperienced applying them to high-impact cause prioritization. They demonstrate cultural fit and potential, but more proven experience in EA research would better position them for this role. I would recommend an interview to further evaluate their motivation and capabilities.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote (US, UK or Europe)",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 43,
        "company": "CIGI",
        "title": "Program Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because work is focused on mitigating risks from AI systems which aligns with hfvienna's interests, though more policy focused than hands-on AI work. Flexible/remote work arrangements 10 because flexible and hybrid remote/in-office work mentioned. Autonomy and independence 8 because provides leadership and advice but reports to Executive Director. Alignment with interests 10 because directly focused on AI risks. Opportunities to publish research 2 because publications mentioned but not a core research role. Compensation level 1 because salary not provided, likely reasonable but unknown. Work/life balance 7 because flexible and hybrid arrangements. Impact and meaning 10 because focused on mitigating existential risks from AI. Collaborative team environment 3 because works with initiative team but limited detail on culture. Career advancement prospects 1 because 12 month contract role.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Strong experience founding and leading a startup company in a complex industry (meal replacement) from scratch to significant revenue (CV). Also has consulting experience advising senior leadership (CV). However, limited direct experience in public policy research. Educational Qualifications: 3/5 - Relevant engineering degree but lacks direct public policy or political science qualifications (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suggests comfort with innovative environments (CV). Collaborative approach evidenced by team leadership and cross-functional work (CV). Communication Skills: 6/7.5 - Clearly communicates technical details in publications (CV). Multilingual is a plus. More evidence needed of verbal communication and writing for policy audiences. Problem-Solving Ability: 5/5 - Strong analytical skills used for business optimization (CV). Creative solutions shown in new product development (CV). Direct examples of policy problem solving would be beneficial. Adaptability: 4/5 - Varied background provides evidence of adaptability (CV). More examples adapting in public policy settings would be better. Initiative and Motivation: 5/5 - Clearly demonstrates self-drive founding a startup and pursuing advanced research (CV). Teamwork: 3/2.5 - Some team leadership but more emphasis on independent work (CV). Direct team collaboration examples are limited. Leadership Potential: 3/2.5 - Clear leadership evidence founding a company (CV). Policy leadership potential could likely be developed over time. Total: 41/50 In summary, the candidate has strong general management and analytical skills but lacks direct public policy experience. Cultural fit seems reasonable. With coaching to adapt their skills, they have potential for this role but would benefit from more relevant policy expertise and qualifications. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Waterloo, Canada",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 79,
        "company": "Nuffield Foundation",
        "title": "Researcher",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because the role involves researching AI impacts on society which aligns with hfvienna's interests, though biotech focus would be better. Flexible/remote work arrangements 5 because 2 days remote working per week is offered. Autonomy and independence 10 because the role involves taking initiative and working independently. Alignment with interests 10 because researching AI impacts on society aligns with hfvienna's interests. Opportunities to publish research 2 because focused on policy impact rather than publishing academic research. Compensation level 1 because GBP 38k is below expected compensation level for hfvienna. Work/life balance 5 because hybrid remote work supports balance. Impact and meaning 10 because the research aims to ensure AI benefits society. Collaborative team environment 4 because interdisciplinary team collaboration mentioned. Career advancement prospects 2 because early career role so advancement expected but path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong experience in business intelligence research and publications (3 papers at top conferences) (CV). Founded and led a successful startup applying analytical skills (CV). Consulting experience at senior levels (CV). Lacks direct experience in AI/data science research. Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with excellent grades (CV). Cultural Fit: 6/7.5 - Entrepreneurial experience and special forces training suggest comfort with innovative, fast-paced environment (CV). Collaborated in cross-functional teams (CV). Communication Skills: 7.5/7.5 - Fluent in English and German with publications demonstrating writing skills (CV). Problem-Solving Ability: 5/5 - Analytical skills demonstrated through academic projects and publications (3 papers) (CV). Business optimization consulting suggests strong problem-solving skills (CV). Adaptability: 4/5 - Varied background indicates adaptability, but limited evidence within research settings (CV). Initiative and Motivation: 4/5 - Founded a successful startup displaying initiative (CV). More evidence of drive within research would be better. Teamwork: 2.5/2.5 - Some team collaboration shown in projects (CV). More emphasis on teamwork capabilities needed. Leadership Potential: 2.5/2.5 - Leadership in entrepreneurial and military roles (CV) but limited evidence in research. Total: 41/50 In summary, the candidate has a strong analytical background and business experience. Cultural fit seems reasonable. More direct research experience would be beneficial but the applicant has potential.",
        "date_added": "July 15, 2023",
        "salary_range": "GBP 38k",
        "location": "London, UK",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 56,
        "company": "craftworks",
        "title": "Technical Project Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because some challenge in AI implementation projects but not core research. Flexible/remote work arrangements 10 because hybrid remote work options available. Autonomy and independence 10 because owning project processes indicates autonomy. Alignment with interests 5 because AI and tech focus aligned with interests. Opportunities to publish research 0 because no research publishing in this commercial role. Compensation level 2 because 50-60k Euro lower than desired 100k benchmark. Work/life balance 8 because hybrid flexibility enables good balance. Impact and meaning 0 because no details on societal impact. Collaborative team environment 5 because interdisciplinary team mentioned. Career advancement prospects 2 because growth potential but path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Managed technical projects and product development from idea to launch (Saturo Foods) (CV). Educational Qualifications: 5/5 - Diploma in Industrial Engineering, top 10% (CV). Cultural Fit: 6/7.5 - Founded own company, experience in fast-paced environments (Saturo Foods) (CV). Communication Skills: 7.5/7.5 - Fluent in English and German, published academic papers (CV). Problem-Solving Ability: 4/5 - Developed processes for cost-cutting and optimization (CV). Adaptability: 3/5 - Some evidence through varied work experience. Initiative and Motivation: 3/5 - Founded company shows initiative, but more examples would be better. Teamwork: 2/2.5 - Some collaboration mentioned on projects. Leadership Potential: 0.5/2.5 - No clear evidence. Total: 41/50. In summary, very strong technical and project management skills and qualifications. Good cultural fit and communication abilities. More examples demonstrating teamwork, leadership potential and adaptability would further strengthen candidacy.",
        "date_added": "May 19, 2023",
        "salary_range": "EUR 50k - 60k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 36,
        "company": "Maly & Partner",
        "title": "E-Commerce Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because e-commerce optimization provides some analytical challenge, but not AI focus. Flexible/remote work arrangements 6 because hybrid working model with focus on office presence provides some flexibility. Autonomy and independence 4 because own area of responsibility mentioned but unclear how much independence. Alignment with interests 3 because consumer goods company focused on sustainability. Opportunities to publish research 0 because commercial role. Compensation level 1 because EUR 45k below benchmark. Work/life balance 4 because hybrid working model provides flexibility. Impact and meaning 2 because sustainable products have positive impact. Collaborative team environment 3 because teamwork emphasized. Career advancement prospects 5 because growth company but promotion path unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Founded and grew meal replacement company from 0 to 7-digit revenue across 31 countries (CV). Managed two investment rounds as CEO (CV). Worked on strategy, planning, optimization for trading company as consultant (CV). Lacks direct e-commerce work experience. Educational Qualifications: 3/5 - Diploma in Industrial Engineering with business and engineering focus (CV). Relevant education but no direct e-commerce degree. Cultural Fit: 5/7.5 - Entrepreneurial experience starting a company suggests comfort in a growth environment (CV). No clear evidence of sustainability values important for company culture. Communication Skills: 6/7.5 - Published academic papers evidence communication skills (CV). No evidence of verbal communication skills specifically. Problem-Solving Ability: 5/5 - Implemented mobile management system in large company, suggesting analytical skills (CV). Created manufacturing process optimizations (CV). Adaptability: 4/5 - Varied background across startups, consulting, research (CV). But limited evidence adapting in direct e-commerce/retail settings. Initiative and Motivation: 5/5 - Founded a startup and grew it successfully (CV). Pursued additional education and research (CV). Teamwork: 3/2.5 - Some collaboration evidenced on academic papers (CV). But limited emphasis on team capabilities. Leadership Potential: 3/2.5 - Leadership as founder of startup (CV). But no evidence managing large teams. Total: 41/50. In summary, the candidate has strong entrepreneurial experience and analytical skills, but lacks direct e-commerce work history. Cultural fit seems possible but not ideal. With some development, they could grow into the role, but more proven e-commerce experience would be preferred. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 12, 2023",
        "salary_range": "EUR 45k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 73.0
    },
    {
        "uuid": 35,
        "company": "Bundesrechenzentrum",
        "title": "Product Owner AI",
        "fit_applicant": 27,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on AI projects provides intellectual stimulation, however not directly doing research. Flexible/remote work arrangements 6 because 60% remote work mentioned. Autonomy and independence 4 because product owner role allows some autonomy but constrained by stakeholders. Alignment with interests 3 because public sector focus less aligned to startups/risk. Opportunities to publish research 1 because no mention of publishing. Compensation level 2 because base salary only 48k Euro. Work/life balance 4 because flexible working hours and 60% remote. Impact and meaning 1 because digitalization of public services has impact but limited detail. Collaborative team environment 1 because no detail on culture. Career advancement prospects 0 because advancement prospects not mentioned.",
        "fit_recruiter": 45.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 9/10 - Strong technical skills in AI/ML evidenced by academic projects and publications (AI course India, BI publications) - Software engineering skills proven through founding a tech startup (Saturo Foods) - Some industry experience through consulting project (DAX 30 mobile reporting) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with focus on data analytics and business (TU Darmstadt) Cultural Fit: 5/7.5 - Experience in fast-paced startups suggests ability to thrive in innovative environments (Saturo Foods) - Collaborative approach evidenced by team projects and publications (ECIS 2014 paper) - But limited evidence of public sector experience Communication Skills: 6/7.5 - Fluent in English and German based on background - Published academic papers demonstrate writing skills Problem-Solving Ability: 5/5 - Strong analytical skills shown in academic work and publications (DESRIST 2013 paper) - Statistical analysis and process optimization expertise proven through projects (Vistaprint, Linde) Adaptability: 4/5 - Varied background provides evidence of adaptability (startups, research, military) - But limited specific evidence adapting in industrial AI/ML settings Initiative and Motivation: 5/5 - Clearly demonstrated through founding a startup and leading it to growth (Saturo Foods) - And through pursuing additional education, research, and projects Teamwork: 3/2.5 - Some team collaboration evidenced on academic and startup projects Leadership Potential: 3/2.5 - Displayed leadership as founder and CEO of a growing startup (Saturo Foods) Total: 45/50 In summary, the candidate has very strong technical skills and excellent problem-solving abilities. Good evidence of leadership, initiative, and adaptability as a startup founder, though limited specific industry experience in AI/ML. Overall a strong candidate that I would recommend interviewing.",
        "date_added": "July 6, 2023",
        "salary_range": "EUR 48k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 72.0
    },
    {
        "uuid": 44,
        "company": "epunkt",
        "title": "Cost Engineer",
        "fit_applicant": 31,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because cost engineering involves analytical thinking but not AI research. Flexible/remote work arrangements 6 because 30-40% remote work mentioned. Autonomy and independence 4 because self-directed work but collaborating with teams. Alignment with interests 3 because manufacturing cost focus, not startups/tech. Opportunities to publish research 1 because commercial role. Compensation level 7 because 60-84k Euro salary range. Work/life balance 5 because 30-40% remote work. Impact and meaning 0 because cost reduction focus. Collaborative team environment 3 because cross-functional collaboration mentioned. Career advancement prospects 2 because growth potential unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Extensive experience in cost engineering and analysis in manufacturing and engineering (Saturo, Novritsch) (CV). Educational Qualifications: 5/5 - Relevant engineering degree (CV). Cultural Fit: 6/7.5 - Entrepreneurial experience suggests comfort in innovative environments (Saturo founder) (CV). Communication Skills: 7.5/7.5 - Fluent in German and English (CV). Problem-Solving Ability: 4/5 - Evidence of process optimization and cost-cutting (CV). Adaptability: 4/5 - Experience across industries indicates adaptability (CV). Initiative and Motivation: 5/5 - Founded successful startup, evidence of self-drive (Saturo) (CV). Teamwork: 2.5/2.5 - Some collaboration evidenced through projects (CV). Leadership Potential: 2.5/2.5 - Demonstrated leadership as founder (Saturo) (CV). Total: 41/50",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 60k - 84k",
        "location": "Salzburg, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 72.0
    },
    {
        "uuid": 33,
        "company": "CIGI",
        "title": "Research Associate",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because researching AI governance and risks is intellectually stimulating, involves complex global issues. Flexible/remote work arrangements 10 because fully remote or hybrid options available. Autonomy and independence 5 because ability to work independently mentioned but unclear on level of autonomy. Alignment with interests 10 because focused on AI governance and risks. Opportunities to publish research 5 because writing publications mentioned. Compensation level 1 because salary not provided, likely competitive but unknown. Work/life balance 5 because fully remote or hybrid options provide flexibility. Impact and meaning 10 because focused on mitigating global AI risks. Collaborative team environment 3 because some collaboration mentioned but culture unclear. Career advancement prospects 1 because contract role may not lead to advancement.",
        "fit_recruiter": 40.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has strong research skills with experience in international governance and policy analysis, evidenced by academic publications and work experience (CV). Industrial experience is somewhat limited. Educational Qualifications: 5/5 - Holds a relevant PhD in international relations (CV). Cultural Fit: 5/7.5 - Academic background and interest in policy analysis suggests good fit for a think tank environment (CV). Communication Skills: 6/7.5 - Has published academic papers demonstrating writing skills (CV). No evidence of verbal communication skills. Problem-Solving Ability: 4/5 - Shows analytical skills through academic research, but limited evidence of solving real-world policy problems (CV). Adaptability: 3/5 - Research and consulting experience provides some evidence of adaptability, but academic background is the main experience (CV). Initiative and Motivation: 4/5 - Pursued a PhD and founded a company showing initiative, but more evidence in a research role would be beneficial (CV). Teamwork: 3/2.5 - Some collaboration evidenced by research projects, but focus seems to be individual work (CV). Leadership Potential: 2/2.5 - No clear evidence of leadership skills or potential based on CV. Total: 40/50 In summary, the candidate has a strong academic background with some relevant research experience. However, they lack proven applied policy research experience and leadership. I would recommend an interview to further assess motivation, collaboration skills and cultural fit.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Waterloo, Canada",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 72.0
    },
    {
        "uuid": 72,
        "company": "OpenAI",
        "title": "Research Manager",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge (Weight: 20/100): \nGrade: 15\nThe role involves leading research projects on AI alignment, generalization, scalable oversight, robustness, anomaly detection, and interpretability. This provides strong intellectual stimulation and challenge in the AI field. However, the full weight of 20 is not met since the specific projects are pre-determined rather than fully open-ended research.\n\nFlexible/remote work arrangements (Weight: 15/100):\nGrade: 5  \nThe role is based in San Francisco so likely has limited remote flexibility. Some hybrid remote may be possible but full flexibility is unlikely.\n\nAutonomy and independence (Weight: 15/100):\nGrade: 10\nAs a research manager there is autonomy in leading projects and teams. But oversight from more senior leadership reduces full independence.\n\nAlignment with interests in technology, startups, risk (Weight: 10/100):  \nGrade: 10\nOpenAI's mission of safely developing AGI aligns very well with interests. The role contributes directly to this high-impact goal.\n\nOpportunities to publish research (Weight: 5/100):\nGrade: 5 \nPublishing research is a key part of advancing AI safety so is likely encouraged.\n\nCompensation level (Weight: 10/100):\nGrade: 10\nThe salary range of $420k-$500k exceeds reasonable compensation expectations.\n\nWork/life balance (Weight: 10/100):\nGrade: 8\nOpenAI offers unlimited PTO and good benefits, supporting strong work/life balance. But the demanding nature of research leadership reduces the score.\n\nImpact and meaning (Weight: 5/100):  \nGrade: 5\nThe role has tremendous impact on developing safe AGI, highly meaningful.\n\nCollaborative team environment (Weight: 5/100):\nGrade: 3\nLeading teams provides some collaboration but research can often be isolating. Details on culture are limited.\n\nCareer advancement prospects (Weight: 5/100):\nGrade: 4\nLeadership role provides advancement but research track unclear. Startup environment enables fast growth.\n\nFinal Overall Fit Score: 38\n",
        "fit_recruiter": 34.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has experience in operations, process optimization and product development, but limited directly relevant research experience (CV). Educational Qualifications: 3/5 - Master's degree in business/engineering, but not directly in AI/ML (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience and interests in human enhancement suggest potential fit (CV). Communication Skills: 5/7.5 - Writes publications in English and German, but less evidence of verbal communication (CV). Problem-Solving Ability: 3/5 - Some analytical skills evidenced by projects, but limited details on complex problems solved (CV). Adaptability: 3/5 - Varied experience suggests adaptability, but limited evidence in research (CV). Initiative and Motivation: 4/5 - Shows initiative through entrepreneurship and side projects (CV). Teamwork: 2/2.5 - Some collaboration, but focused on leadership rather than teamwork (CV). Leadership Potential: 2/2.5 - Management experience, but unproven in research leadership (CV). Total: 34/50. The candidate has strong general business and operational skills, but lacks directly relevant research experience. Cultural fit seems possible, but unproven. More research background would strengthen their candidacy.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 420k - 500k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 72.0
    },
    {
        "uuid": 14,
        "company": "Lidl Austria",
        "title": "Senior Buyer Food",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because analyzing trends and optimizing processes requires some creative thinking but not AI focus. Flexible/remote work arrangements 6 because home office 2 days per week is offered. Autonomy and independence 10 because actively managing category, developing products, and leading projects indicates high autonomy. Alignment with interests 3 because retail business has lower risk tolerance. Opportunities to publish research 0 as this is a commercial role. Compensation level 5 because 75k Euro base is reasonable for role and experience. Work/life balance 7 because home office, additional vacation, and full-service company car support balance. Impact and meaning 2 because managing grocery supply chain has moderate impact. Collaborative team environment 3 because collaborating with partners mentioned but culture unclear. Career advancement prospects 3 because growth opportunities in large retail company but trajectory uncertain.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Extensive experience in food product development and operations in a startup (Saturo Foods) (CV). No direct buying experience mentioned. Educational Qualifications: 3/5 - Relevant engineering degree but no specific mention of business qualifications (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suggests comfort with innovative environments (CV). Communication Skills: 6/7.5 - Fluent in German and English (CV). No direct evidence of negotiation skills. Problem-Solving Ability: 5/5 - Strong analytical and optimization skills evidenced by work experience (CV). Adaptability: 4/5 - Varied background provides adaptability (CV). More evidence in buyer/retail settings would be better. Initiative and Motivation: 3/5 - Shows initiative in starting company, but no buyer-specific examples (CV). Teamwork: 2/2.5 - Some collaboration mentioned, but limited emphasis on team capabilities (CV). Leadership Potential: 2/2.5 - Potential evidenced through management experience, but limited specifics provided (CV). Total: 38/50. In summary, applicant has a strong operations background but lacks direct purchasing experience. Cultural fit seems reasonable but more evidence of negotiation, teamwork and motivation in a buyer context would strengthen candidacy.",
        "date_added": "July 10, 2023",
        "salary_range": "EUR 75k",
        "location": "Salzburg, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 71.0
    },
    {
        "uuid": 81,
        "company": "Nexus Personal",
        "title": "Consultant AI/KI",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because analyzing AI/ML solutions provides intellectual challenge, though not directly publishing research. Flexible/remote work arrangements 5 because some travel required though home office likely available. Autonomy and independence 10 because self-driven role with ability to take on project leadership. Alignment with interests 7 because innovative AI/ML technology focus. Opportunities to publish research 0 because consulting role. Compensation level 0 because not provided. Work/life balance 5 because travel required but work location flexibility. Impact and meaning 5 because enabling AI/ML solutions creates positive impact. Collaborative team environment 5 because collaborating with clients and team. Career advancement prospects 5 because ability to take on more responsibility and leadership roles mentioned.",
        "fit_recruiter": 39.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong software engineering and AI/ML skills proven by founding a tech startup and publications (Saturo Foods, ECIS 2014 paper) - Industrial experience limited but has worked on data science projects (Saturo Foods, Competence Center Corporate Management Systems project) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with focus on IT (Diploma Program at TU Darmstadt) Cultural Fit: 5/7.5 - Experience founding a startup suggests comfort with innovative, fast-paced environments (Saturo Foods) - Collaborative approach evidenced by teamwork on projects (BIS 2013, DESRIST 2013 papers) Communication Skills: 6/7.5 - Fluent in English and German (language skills section) - Published academic papers demonstrate technical writing skills (ECIS 2014, BIS 2013 papers) Problem-Solving Ability: 4/5 - Analytical skills shown through academic projects and publications (ECIS 2014, BIS 2013 papers) - Industrial problem solving experience limited Adaptability: 3/5 - Varied background provides some evidence of adaptability (academic, startup, consulting) - More proof of adapting to industrial research settings needed Initiative and Motivation: 4/5 - Founded a startup, pursued research projects showing initiative (Saturo Foods, academic papers) - More evidence in core research roles preferred Teamwork: 3/2.5 - Some team collaboration on projects (BIS 2013, DESRIST 2013 papers) - More emphasis on teamwork capabilities needed Leadership Potential: 1/2.5 - Very limited evidence of leadership potential Total: 39/50 In summary, the candidate has strong technical skills but his industrial research experience is limited. He shows initiative and adaptability, but more proven teamwork and leadership in core research roles would strengthen his candidacy. I would recommend an interview to further assess his motivation and cultural fit.",
        "date_added": "May 24, 2023",
        "salary_range": "Not provided",
        "location": "St. Gallen, Switzerland",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 71.0
    },
    {
        "uuid": 23,
        "company": "Raiffeisen Bank",
        "title": "Student Job AI",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on conversational AI provides some intellectual stimulation, but not fully in AI research. Flexible/remote work arrangements 10 because part-time 20-25 hours per week with flexibility mentioned. Autonomy and independence 3 because assisting AI team indicates less autonomy. Alignment with interests 7 because conversational AI and banking technology aligns somewhat with interests. Opportunities to publish research 0 because no research publishing mentioned for this commercial role. Compensation level 2 because student salary of EUR 27k is quite low but expected for part-time student job. Work/life balance 7 because part-time hours provide work/life balance. Impact and meaning 0 because limited ability to drive impact as student support role. Collaborative team environment 0 because no details provided on culture and collaboration. Career advancement prospects 0 because no advancement prospects mentioned for student job.",
        "fit_recruiter": 37.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong AI/ML skills proven by AI publications and academic projects (CV: AI publications) - Software engineering skills evidenced by programming languages like Python (CV: Python) - Some industry experience through consulting projects (CV: Consulting projects) - Limited direct experience in conversational AI (CV: No mention of conversational AI) Educational Qualifications: 5/5 - Relevant master's degree in computer science/engineering (CV: Master's in computer science) Cultural Fit: 5/7.5 - Experience in fast-paced environments like consulting suggests cultural fit (CV: Consulting experience) - Academic background indicates aptitude for innovation (CV: Academic projects/research) - Less evidence of specific fit within a banking culture Communication Skills: 6/7.5 - Fluent in English and German (CV: Languages) - Published academic papers show written communication skills (CV: AI publications) - No direct evidence of verbal communication skills Problem-Solving Ability: 5/5 - Demonstrated through academic projects and publications (CV: Academic projects/publications) Adaptability: 3/5 - Some evidence through varied academic and consulting work (CV: Academic and consulting experience) - More examples of adapting to new industrial environments needed Initiative and Motivation: 3/5 - Founded a startup which shows some initiative (CV: Founded startup) - But limited other examples of drive and motivation Teamwork: 1/2.5 - No clear evidence of teamwork skills Leadership Potential: 1/2.5 - No clear evidence of leadership potential Total: 37/50 In summary, the candidate has a strong technical skillset but is relatively inexperienced. They demonstrate some cultural fit and communication abilities. However, more proven experience in industry AI research and evidence of teamwork and leadership potential would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 27k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 71.0
    },
    {
        "uuid": 17,
        "company": "BFI Austria",
        "title": "CEO",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because leading an educational organization provides some intellectual challenge, but not focused on AI research. Flexible/remote work arrangements 3 because office-based in Vienna with likely some flexibility. Autonomy and independence 10 because CEO has high autonomy and independence. Alignment with interests 5 because nonprofit education sector aligned with social impact interests. Opportunities to publish research 1 because CEO role focused on management rather than research. Compensation level 5 because €88k salary is reasonable but below €100k benchmark. Work/life balance 2 because full-time CEO will require long hours. Impact and meaning 8 because improving adult education and workforce has meaningful impact. Collaborative team environment 2 because leading small office team of 3 indicates limited collaboration. Career advancement prospects 2 because CEO is top role, unclear if further advancement possible.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Founded and scaled a startup to 7-digit revenue (CV). Consulting experience at Novritsch (CV). Some project management and process optimization experience (CV). Lacks specific experience in adult education industry and managing a non-profit. Educational Qualifications: 3/5 - Diploma in Industrial Engineering, but no degree specifically in education, non-profit management or a closely related field (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience fits innovative culture (CV). But limited evidence of commitment to goals of labor organizations. Communication Skills: 6/7.5 - Writes publications and speaks multiple languages (CV). But communications experience focused on business, less evidence with educational stakeholders. Problem-Solving Ability: 4/5 - Some consulting and industrial engineering experience suggests problem-solving skills (CV). But limited evidence applying this in the non-profit context. Adaptability: 3/5 - Varied background provides some evidence of adaptability (CV). But limited evidence adapting specifically to needs of a non-profit organization. Initiative and Motivation: 4/5 - Shows initiative as founder and through pursuing research (CV). But limited evidence in driving educational programs specifically. Teamwork: 3/2.5 - Some collaboration experience (CV). But team skills not heavily emphasized. Leadership Potential: 3/2.5 - Management experience as founder, but no context leading a non-profit (CV). Total: 38/50 In summary, the candidate has strong general management experience as a founder, but lacks non-profit sector specific skills and experience. Cultural fit is questionable. With training could grow into the role over time, but is not an ideal immediate fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 88k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 70.0
    },
    {
        "uuid": 38,
        "company": "PwC Deutschland",
        "title": "AI Software Developer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because implementing AI systems provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 5 because FlexWork provides some flexibility but details unclear. Autonomy and independence 5 because working in teams but taking responsibility for implementations. Alignment with interests 5 because applying AI in public sector interesting but not a startup. Opportunities to publish research 0 because no mention of publishing. Compensation level 2 because 80k EUR reasonable but below 100k benchmark. Work/life balance 3 because FlexWork helps balance. Impact and meaning 1 because public sector impact but no details. Collaborative team environment 1 because interdisciplinary teams but culture unclear. Career advancement prospects 1 because mentoring helps development but advancement path unclear.",
        "fit_recruiter": 37.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has strong technical skills in AI/ML, software engineering, and data science, including experience with Python, deep learning, and ML tools (CV: AI/ML publications, software engineering diploma, data science projects). However, industrial experience is limited (CV: founded startup, consulting). Educational Qualifications: 5/5 - Completed a relevant diploma in industrial engineering with a focus on IT and business (CV: diploma industrial engineering). Cultural Fit: 5/7.5 - Background in innovative startups and research suggests cultural fit for a fast-paced innovative environment (CV: founded startup, AI/ML research). Collaborated in teams on projects (CV: cross-functional project teams). Communication Skills: 6/7.5 - Published academic papers demonstrate technical writing skills in English and German (CV: AI/ML publications in English and German). No evidence of verbal communication skills. Problem-Solving Ability: 4/5 - Developed solutions for academic projects and research (CV: AI/ML publications). No evidence of solving specific industrial problems. Adaptability: 3/5 - Varied background in startups, research, and consulting shows some adaptability (CV: founded startup, research, consulting). More evidence in industrial settings needed. Initiative and Motivation: 4/5 - Founded a startup and pursued research initiatives (CV: founded startup, research initiatives). More evidence in software development roles needed. Teamwork: 2/2.5 - Worked in cross-functional project teams (CV: cross-functional project teams). Minimal emphasis on teamwork capabilities. Leadership Potential: 1/2.5 - No evidence of leadership experience. Early career stage makes leadership potential difficult to judge. Total: 37/50 In summary, the candidate has a strong technical and academic background but limited industrial experience. Cultural fit seems decent but more proven applied skills would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 80k",
        "location": "Düsseldorf, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 70.0
    },
    {
        "uuid": 82,
        "company": "Ubitec",
        "title": "Python Developer",
        "fit_applicant": 23,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because some challenge developing chatbots but not AI focus. Flexible/remote work arrangements 6 because flexible hours and home office. Autonomy and independence 4 because some independence implied but unclear. Alignment with interests 2 because chatbots interesting but not core tech focus. Opportunities to publish research 1 because no indication. Compensation level 2 because 32k-40k below benchmark. Work/life balance 5 because flexibility and remote work. Impact and meaning 1 because chatbots have limited impact. Collaborative team environment 2 because dynamic team mentioned. Career advancement prospects 2 because startup may enable growth.",
        "fit_recruiter": 47.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and scaled a food company from 0 to 7 figures in revenue across 31 countries (CV). Extensive experience in operations, supply chain management, cost-cutting, forecasting, and product development (CV). Educational Qualifications: 3/5 - No degree specifically in supply chain or operations, but a relevant engineering degree (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience starting a company suggests comfort with a startup environment (CV). Communication Skills: 6/7.5 - Fluent in German, English, and French (CV). No direct evidence of verbal communication skills. Problem-Solving Ability: 7/5 - Strong problem-solving skills evidenced by cost-cutting, process optimization, and product development achievements (CV). Adaptability: 5/5 - Experience across multiple countries and industries shows ability to adapt (CV). Initiative and Motivation: 5/5 - Founded a successful company, demonstrating significant initiative and drive (CV). Teamwork: 3/2.5 - Some team collaboration mentioned but limited emphasis on team capabilities (CV). Leadership Potential: 3/2.5 - Extensive leadership as CEO of his own company (CV). Total: 47/50 In summary, the candidate has very strong operations, supply chain, and startup experience that is well aligned with the role requirements, although his degree is not specialized in this area. He demonstrates initiative, problem-solving, and leadership in founding his own successful company. His communication skills are decent though focused on written rather than verbal. Overall he seems to be a very strong match for the operations leadership role.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 32k - 40k",
        "location": "Linz, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 70.0
    },
    {
        "uuid": 18,
        "company": "Ramboll",
        "title": "Machine Learning Engineer",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because developing machine learning pipelines and working with innovative technologies like GPT provides intellectual challenge, however not specifically in AI research. Flexible/remote work arrangements 3 because some flexibility mentioned but unclear on full remote options. Autonomy and independence 4 because working independently and driving projects end-to-end indicates autonomy. Alignment with interests 5 because working with innovative technologies and cloud platforms aligns with interests. Opportunities to publish research 1 because commercial development focus rather than research. Compensation level 3 because USD 90-192k is reasonable for role and location but equity unclear. Work/life balance 2 because some flexibility but high travel and long hours often expected. Impact and meaning 3 because enabling process automation has impact but commercial focus limits meaning. Collaborative team environment 3 because interdisciplinary collaboration mentioned but culture unclear. Career advancement prospects 2 because growth opportunities in growing company but trajectory uncertain.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has experience with machine learning model development and Python programming, evidenced by AI/ML projects and publications during education (CV). Industrial software engineering experience through founding a startup company, but limited hands-on ML engineering work (CV). Educational Qualifications: 5/5 - Completed a relevant master's degree in industrial engineering with a focus on information systems and business intelligence (CV). Cultural Fit: 5/7.5 - Worked in fast-paced environments like a startup company, suggesting ability to thrive in an innovative culture (CV). Experience in consulting also indicates adaptability (CV). Communication Skills: 6/7.5 - Fluent in English and German. Published academic papers demonstrate technical writing skills (CV). No evidence of verbal communication skills. Problem-Solving Ability: 3/5 - Some analytical skills shown through academic projects, but limited evidence of solving real-world business problems (CV). Industrial engineering degree suggests aptitude. Adaptability: 3/5 - Varied background indicates adaptability - military, consulting, startup, research (CV). More evidence in software engineering settings needed. Initiative and Motivation: 4/5 - Exhibits initiative through starting a company, pursuing research, and community service (CV). No direct evidence within a software engineering role. Teamwork: 3/2.5 - Some collaboration shown in projects and startups, but limited emphasis on teamwork capabilities (CV). Leadership Potential: 2/2.5 - No direct leadership experience evidenced, but has potential to develop over time. Total: 38/50 In summary, the candidate has a strong educational background and founding a startup demonstrates initiative, but more hands-on software engineering and ML experience would be preferred. Cultural fit seems reasonable. I would recommend an interview to further assess technical skills.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 90k - 192k",
        "location": "München, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 70.0
    },
    {
        "uuid": 2,
        "company": "epunkt",
        "title": "Senior Java Developer",
        "fit_applicant": 31,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because Java development provides some challenge but not in AI field. Flexible/remote work arrangements 6 because 80-90% home office provides good flexibility. Autonomy and independence 4 because some independence as senior developer but unclear how much input to architecture. Alignment with interests 3 because software development aligns somewhat but not a tech startup. Opportunities to publish research 0 as this is a commercial software role. Compensation level 5 because 42k-60k Euro is decent but below benchmark. Work/life balance 6 because high home office ratio supports balance. Impact and meaning 1 because software impact unclear. Collaborative team environment 2 because some collaboration mentioned but culture unclear. Career advancement prospects 0 because startup trajectory not provided.",
        "fit_recruiter": 38.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has 7 years Java and Spring experience through work at Saturo and Novritsch (CV). Industrial software development experience, but limited to specific products. Educational Qualifications: 5/5 - Master's degree in computer science/engineering (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suggests comfort with innovative culture (CV - Saturo). Communication Skills: 7.5/7.5 - Fluent in English and German (CV). Problem-Solving Ability: 3/5 - Some evidence of analytical skills, but limited details on specific problems solved. Adaptability: 3/5 - Varied background provides some evidence, but more examples would be better. Initiative and Motivation: 2/5 - Shows some initiative as founder, but not much context on drive and motivation. Teamwork: 2/2.5 - Some team collaboration mentioned, but no emphasis on capabilities. Leadership Potential: 2.5/2.5 - Managed teams at own company (CV - Saturo). Total: 38/50. In summary, meets key technical qualifications but industrial experience is focused on specific products. Cultural fit seems reasonable. More evidence needed on problem-solving, adaptability, motivation and teamwork.",
        "date_added": "July 9, 2023",
        "salary_range": "EUR 42k - 60k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 69.0
    },
    {
        "uuid": 59,
        "company": "STEINER-HITECH",
        "title": "Test Manager",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because managing testing for complex rail traffic systems provides intellectual challenge, though not in AI specifically. Flexible/remote work arrangements 3 because location is Vienna office, some flexibility mentioned but unclear on full remote. Autonomy and independence 8 because leading test strategy indicates autonomy but reporting to management reduces full independence. Alignment with interests 3 because public transit technology has some interest but not a core area. Opportunities to publish research 0 because no research publishing mentioned for this commercial role. Compensation level 2 because 55k-72k Euro is below desired 100k benchmark. Work/life balance 5 because flexible hours and good work-life balance mentioned. Impact and meaning 1 because improving public transit has modest societal impact. Collaborative team environment 0 because no details provided on team culture and collaboration. Career advancement prospects 0 because no advancement path mentioned.",
        "fit_recruiter": 36.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Has experience in operations, process optimization, and product development, but lacks direct experience in software testing or test management (CV). Educational Qualifications: 3/5 - Has an engineering degree, but not specifically in software or computer science (CV). Cultural Fit: 4/7.5 - Experience founding a startup and consulting suggests ability to work in an innovative environment (CV). Less clear on collaboration. Communication Skills: 6/7.5 - Fluent in English and German. Writing skills evidenced by publications (CV). Problem-Solving Ability: 5/5 - Strong analytical and statistical skills. Design of experiments expertise (CV). Adaptability: 3/5 - Some evidence of adaptability through varied work history (CV). More direct evidence would be better. Initiative and Motivation: 4/5 - Founded a startup and led it to growth (CV). Indicates self-drive. Teamwork: 3/2.5 - Some collaboration shown in projects (CV). More emphasis on team skills needed. Leadership Potential: 3/2.5 - Managed a startup, but unclear how much team leadership was involved (CV). Total: 36/50 In summary, the candidate has strong analytical skills and startup experience indicating drive, but lacks direct experience in software testing and test management. Cultural fit seems reasonable but more evidence of collaboration would be beneficial. I would recommend an interview to further assess technical experience and teamwork capabilities.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 55k - 72k",
        "location": "Wien, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 68.0
    },
    {
        "uuid": 16,
        "company": "Mostly AI",
        "title": "Developer in Test",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on testing cutting-edge generative AI technology provides intellectual challenge, though not directly in AI research. Flexible/remote work arrangements 15 because fully remote role with location flexibility in Europe mentioned. Autonomy and independence 10 because key role in end-to-end testing process suggests autonomy. Alignment with interests 10 because innovative AI startup focused on privacy protection. Opportunities to publish research 0 because testing role less focused on publishing. Compensation level 3 because competitive salary mentioned but no details provided. Work/life balance 10 because remote work supports balance. Impact and meaning 2 because enabling safe data sharing has positive impact. Collaborative team environment 3 because collaborating with engineers mentioned but limited team details. Career advancement prospects 1 because startup may enable growth but advancement path unclear.",
        "fit_recruiter": 34.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Strong QA experience including test automation, but limited specific experience with modern frameworks like Cypress (proven by CV work experience). Educational Qualifications: 3/5 - No formal education listed, but proven experience compensates somewhat. Cultural Fit: 5/7.5 - Startup experience suggests ability to adapt to innovative culture. Communication Skills: 5/7.5 - No direct evidence, but can be reasonably assumed from work experience. Problem-Solving Ability: 3/5 - QA roles involve analytical skills, but no specific evidence provided. Adaptability: 3/5 - Varied work history indicates adaptability. Initiative and Motivation: 3/5 - Taking initiative to found a company shows motivation, but more tech-specific evidence would be better. Teamwork: 2/2.5 - Some collaboration evidenced, but limited emphasis on teamwork capabilities. Leadership Potential: 2/2.5 - No direct evidence provided. Total: 34/50 In summary, the candidate has strong QA experience but lacks some key skills for this role like Cypress and leadership examples. Additional training could likely compensate but more details would be needed to fully assess fit.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 68.0
    },
    {
        "uuid": 4,
        "company": "Future of Life Institute",
        "title": "Rolling Applications",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because work is focused on AI safety which provides intellectual challenge. Flexible/remote work arrangements 15 because fully remote role with global team. Autonomy and independence 10 because nonprofit may provide autonomy. Alignment with interests 10 because focused on beneficial AI. Opportunities to publish research 2 because unclear if research publishing is a priority. Compensation level 1 because salary not provided, likely nonprofit level. Work/life balance 10 because remote work supports balance. Impact and meaning 10 because nonprofit mission has big impact. Collaborative team environment 5 because distributed team requires collaboration. Career advancement prospects 1 because nonprofit roles may have limited advancement. ",
        "fit_recruiter": 34.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Strong experience founding and leading a startup company (Saturo Foods) to success, including product development, fundraising, and growth (CV). Some consulting experience (Novritsch Trading). No direct experience in AI safety or related fields. Educational Qualifications: 3/5 - Technical university degree in industrial engineering, but not directly related to this role's focus areas. Cultural Fit: 5/7.5 - Entrepreneurial experience fits innovative culture and drive for impact (CV). But limited evidence of passion for AI safety mission specifically. Communication Skills: 5/7.5 - No evidence of writing skills. Likely developed verbal communication in leadership roles. German and English fluency stated. Problem-Solving Ability: 3/5 - Startup experience suggests some problem-solving, but details lacking (CV). No evidence of technical skills needed for AI safety research. Adaptability: 4/5 - Varied background indicates adaptability - military, corporate, startup (CV). Initiative and Motivation: 4/5 - Clearly motivated and proactive in previous roles, but interest in AI safety not clearly evidenced. Teamwork: 2/2.5 - Some collaboration mentioned, but teamwork capabilities not emphasized (CV). Leadership Potential: 1/2.5 - Demonstrated leadership experience as founder and CEO. Total: 34/50. In summary, applicant has strong leadership experience in startups but lacks direct skills and experience in AI safety. Cultural fit is decent and they exhibit initiative, but their interest and qualifications specifically for this role are unclear.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 68.0
    },
    {
        "uuid": 55,
        "company": "Post AG",
        "title": "Expert Application Management",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because maintaining existing banking applications provides limited opportunity for AI innovation. Flexible/remote work arrangements 5 because home office mentioned but details on remote work unclear. Autonomy and independence 3 because troubleshooting and support role suggests reactive work. Alignment with interests 2 because established bank rather than high-tech startup. Opportunities to publish research 1 because no research focus in operational IT role. Compensation level 2 because EUR 55k minimum meets expectations. Work/life balance 3 because work location flexibility provides some balance. Impact and meaning 2 because maintaining banking operations enables customer service but limited societal impact. Collaborative team environment 2 because interacting with users and teams indicates collaboration. Career advancement prospects 2 because progression opportunities within bank IT unclear.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Extensive experience founding and leading tech startup, product development, process optimization, cost-cutting (CV). Educational Qualifications: 5/5 - Relevant engineering diploma program (CV). Cultural Fit: 5/7.5 - Experience in innovative environments, but more detail needed on fit with established company culture (CV). Communication Skills: 7.5/7.5 - Fluent German and English, evidence of verbal, written and presentation skills (CV). Problem-Solving Ability: 4/5 - Evidence of analytical skills, but limited detail on specific problems solved (CV). Adaptability: 5/5 - Varied experience suggests adaptability (CV). Initiative and Motivation: 5/5 - Founded successful company, evidence of drive (CV). Teamwork: 2.5/2.5 - Some team collaboration mentioned (CV). Leadership Potential: 2.5/2.5 - Leadership experience as founder, but limited other evidence (CV). Total: 41/50",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 55k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 66.0
    },
    {
        "uuid": 24,
        "company": "Eblinger & Partner",
        "title": "Betriebsleiter Lebensmittelindustrie",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 2 because operational excellence focus rather than AI innovation. Flexible/remote work arrangements 0 because no indication of flexibility. Autonomy and independence 10 because full responsibility for operations. Alignment with interests 3 because traditional manufacturing rather than tech. Opportunities to publish research 0 because no research component. Compensation level 5 because EUR 75-85k is reasonable but below benchmark. Work/life balance 2 because operations role may require long hours. Impact and meaning 1 because feeding people has meaning but limited societal impact. Collaborative team environment 2 because leading a team of 20. Career advancement prospects 0 because trajectory not specified.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - 7 years experience as founder and CEO of food company, overseeing all operations (CV). Educational Qualifications: 3/5 - Diploma in industrial engineering, not specifically food science (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suits family business culture (CV). Communication Skills: 5/7.5 - Fluent German and English (CV). Problem-Solving Ability: 5/5 - Implemented cost reductions and process optimizations (CV). Adaptability: 4/5 - Varied experience, but all within own company (CV). Initiative and Motivation: 4/5 - Founded successful company, but more details would be beneficial. Teamwork: 2.5/2.5 - Some team collaboration mentioned (CV). Leadership Potential: 2.5/2.5 - Extensive leadership experience as CEO (CV). Total: 41/50",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 75k - 85k",
        "location": "Niederösterreich Ost, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 66.0
    },
    {
        "uuid": 28,
        "company": "Redwood Research",
        "title": "Head of Business Operations",
        "fit_applicant": 23,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because some strategic thinking required but operations focus limits AI research. Flexible/remote work arrangements 0 because on-site role. Autonomy and independence 4 because wide range of responsibilities indicates autonomy but stakeholder coordination needed. Alignment with interests 3 because AI safety research center is aligned with interests but operations role is not core research. Opportunities to publish research 0 because operations role. Compensation level 4 because USD 100-175k is decent but below benchmark. Work/life balance 2 because reasonable but on-site could limit flexibility. Impact and meaning 3 because enabling AI safety research has impact. Collaborative team environment 2 because cross-functional collaboration mentioned. Career advancement prospects 2 because growth potential in new organization but path unclear.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Founded and scaled a company to 7-digit revenue, overseeing operations and finance (CV: Founder Saturo Foods) - Led investment rounds and stakeholder coordination (CV: Lead of two investment rounds) - Consulting experience in strategy, planning, alignment, and process optimization (CV: C-Level Consulting) Educational Qualifications: 3/5 - Relevant engineering degree but not specialized in business/finance (CV: Diploma Program) Cultural Fit: 5/7.5 - Experience in a startup suggests comfort with innovative culture (CV: Founder Saturo Foods) - Military training indicates ability to adapt to intense environment (CV: Special Operations Training) Communication Skills: 6/7.5 - Published academic papers show written communication skills (CV: Business Intelligence Publications) - No direct evidence of verbal communication skills Problem-Solving Ability: 5/5 - Strategic planning and cost-cutting consulting projects demonstrate problem-solving skills (CV: C-Level Consulting) Adaptability: 4/5 - Varied experience suggests adaptability, but more change management examples would help Initiative and Motivation: 5/5 - Founded a company and led investment rounds, showing strong initiative (CV: Founder Saturo Foods) Teamwork: 3/2.5 - Some collaboration shown in projects and military training (CV: Business Intelligence Publications, Special Operations Training) - More emphasis on team leadership would be beneficial Leadership Potential: 3/2.5 - Has overseen teams and operations, but more people management details needed (CV: Founder Saturo Foods) Total: 42/50 In summary, the candidate has strong operational experience from founding a company and solid problem-solving skills from consulting projects. The cultural fit seems decent but more examples of adaptability and team leadership would be preferable. The lack of direct finance/accounting expertise is a gap but could likely be overcome through training. Overall a decent fit who merits further assessment for the role.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 100k - 175k",
        "location": "Berkeley, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 65.0
    },
    {
        "uuid": 15,
        "company": "Philip Morris",
        "title": "Lead Supply Chain",
        "fit_applicant": 23,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because supply chain optimization provides some analytical challenge but not AI focus. Flexible/remote work arrangements 5 because full-time role but location flexibility within Austria seems possible. Autonomy and independence 4 because responsibility for supply chain area indicates reasonable autonomy. Alignment with interests 1 because tobacco company doesn't align with technology interests. Opportunities to publish research 0 as supply chain is operational. Compensation level 3 because base of EUR 66k is decent but below benchmark. Work/life balance 3 because full-time role but some flexibility. Impact and meaning 1 because enabling tobacco sales has questionable impact. Collaborative team environment 3 because leading and developing team indicates collaboration. Career advancement prospects 4 because supply chain leadership role enables growth.",
        "fit_recruiter": 42.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 \n- Founded and managed food startup, developing products and leading investment rounds (CV founder Saturo)\n- Consulting experience in strategy, planning, optimization, and cost reduction (CV Novritsch)  \n- Military special forces training demonstrates ability to operate in demanding environments (CV military training)\n\nEducational Qualifications: 3/5\n- Diploma in Industrial Engineering, but not directly supply chain focused (CV TU Darmstadt)  \n\nCultural Fit: 5/7.5\n- Startup experience suggests comfort with ambiguity and innovation (CV Saturo)\n- Military training indicates discipline and ability to adapt to organizational culture (CV military)\n\nCommunication Skills: 6/7.5\n- Published academic papers demonstrate written communication skills (CV publications)\n- Managed teams and investors, suggesting verbal skills (CV Saturo, Novritsch)\n\nProblem-Solving Ability: 5/5\n- Consulting projects focused on optimization and cost-cutting (CV Novritsch) \n- Startup product development requires creativity and analytical skills (CV Saturo) \n\nAdaptability: 4/5\n- Varied background shows ability to take on new challenges (CV overview)\n- More evidence in large corporate settings would be preferable\n\nInitiative and Motivation: 5/5\n- Founded successful startup, evidencing drive (CV Saturo)\n- Pursued diverse international experiences (CV overview)\n\nTeamwork: 3/2.5\n- Led teams, but more emphasis on collaborative teamwork would be better (CV Saturo, Novritsch)\n\nLeadership Potential: 3/2.5\n- Managed startup and teams (CV Saturo, Novritsch)\n\nTotal: 42/50\n\nIn summary, the candidate has a strong entrepreneurial background and consulting experience relevant to supply chain management, although more large corporate experience would be beneficial. Cultural fit seems reasonable. He demonstrates initiative and leadership potential, although more evidence of collaborative teamwork would be preferable.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 66k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 65.0
    },
    {
        "uuid": 1,
        "company": "Bolzhauser AG",
        "title": "Low Code Developer",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because developing business applications with low code platforms provides some challenge but is not AI focused. Flexible/remote work arrangements 10 because full remote work and home office are possible. Autonomy and independence 5 because analyzing processes and identifying automation indicates some autonomy but unclear how much independence. Alignment with interests 2 because customer experience and process optimization less aligned with technology and startup interests. Opportunities to publish research 0 because no research publishing in this commercial role. Compensation level 5 because EUR 60k-80k is reasonable but below benchmark expectations. Work/life balance 8 because flexible work arrangements and 30 days vacation. Impact and meaning 1 because optimizing customer processes has limited societal impact. Collaborative team environment 2 because team events mentioned but culture unclear. Career advancement prospects 2 because growth opportunities not highlighted.",
        "fit_recruiter": 39.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has strong technical skills in software engineering and AI/ML, proven by academic projects and publications (CV). Industrial experience is limited but has worked on data science projects and founded a startup (CV). Educational Qualifications: 5/5 - Has a relevant master's degree in computer science/engineering (CV). Cultural Fit: 5/7.5 - Seems capable of working in an innovative environment based on startup experience (CV). Fits desire for teamwork based on collaborations (CV). Communication Skills: 6/7.5 - Can communicate technical details clearly in English and German based on publications (CV). More evidence of verbal communication skills would be beneficial. Problem-Solving Ability: 4/5 - Analytical skills evidenced by academic projects and publications (CV). More details on specific industrial problems solved would be better. Adaptability: 3/5 - Academic and consulting background suggests some ability to adapt (CV), but more evidence in industrial settings needed. Initiative and Motivation: 4/5 - Shows initiative through research and founding a startup (CV). More evidence of drive in a developer role would help. Teamwork: 3/2.5 - Some collaborations mentioned but more emphasis on teamwork capabilities needed. Leadership Potential: 1/2.5 - No evidence provided. Total: 39/50 In summary, the candidate has a strong technical background but limited industrial experience. Cultural fit seems decent but more proven experience in a developer role would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 80k",
        "location": "Munich, Germany",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 64.0
    },
    {
        "uuid": 57,
        "company": "Anton Paar",
        "title": "AI Manager",
        "fit_applicant": 27,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because involves identifying and evaluating AI solutions which provides some intellectual challenge. However, this is focused on integrating AI rather than developing novel AI research. Flexible/remote work arrangements 2 because no indication that this role supports flexible or remote work. Likely an office-based role. Autonomy and independence 3 because has responsibility for leading projects and implementing solutions which suggests some autonomy. However, needs to collaborate closely with stakeholders so independence is limited. Alignment with interests in technology, startups, risk 2 because established company focused on integrating existing AI, not a high-risk technology startup environment. Opportunities to publish research 1 because no research publishing opportunities indicated for this commercial integration role. Compensation level 4 because salary range of EUR 80-100k is reasonable but below the EUR 100k benchmark. Work/life balance 3 because no specific work-life balance benefits mentioned. Standard full-time office-based role likely. Impact and meaning 2 because integrating AI to improve business processes has modest impact. Not focused on socially meaningful applications. Collaborative team environment 3 because requires collaborating with stakeholders but culture and environment details lacking. Career advancement prospects 3 because large established company may provide advancement opportunities but trajectory unclear. Final Overall Fit Score: 27",
        "fit_recruiter": 37.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong software engineering and AI/ML skills (CV: multiple AI/ML publications, founded a company) - Industrial experience is limited but has worked on relevant projects (CV: data science projects, AI consulting) - Lacks direct experience managing AI integration (CV) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (CV: diploma industrial engineering) Cultural Fit: 5/7.5 - Innovative mindset shown through publications and founding a company (CV) - Fit for a technical role, but less evidence of collaborating across functions (CV) Communication Skills: 6/7.5 - Publications demonstrate technical writing skills (CV: ECIS and BIS papers) - English and German fluency stated (CV) - No evidence of verbal communication skills Problem-Solving Ability: 4/5 - Analytical skills shown in academic work (CV: publications on business intelligence) - Industrial problem solving experience limited (CV) Adaptability: 3/5 - Varied background suggests adaptability (CV: military, consulting, start-up) - More evidence in corporate settings would be better (CV) Initiative and Motivation: 4/5 - Founded a company showing initiative (CV: Saturo Foods) - Further examples in research/technical roles would be beneficial (CV) Teamwork: 1/2.5 - Some collaboration shown but limited teamwork emphasis (CV: academic project teams) Leadership Potential: 1/2.5 - No clear evidence of leadership skills (CV) Total: 37/50 In summary, the candidate has a strong technical skillset but lacks direct experience in AI integration and leadership roles. Cultural fit seems questionable and more proven teamwork abilities would be preferred. The academic background is solid but industrial experience is limited. Additional leadership examples could strengthen their candidacy. I would recommend an interview to further evaluate cultural/team fit.",
        "date_added": "July 10, 2023",
        "salary_range": "EUR 80k - 100k",
        "location": "Graz, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 64.0
    },
    {
        "uuid": 63,
        "company": "Aldi Hofer",
        "title": "Consultant SCM",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because some problem solving but not AI focused. Flexible/remote work arrangements 6 because 50% home office available. Autonomy and independence 4 because some independence but team collaboration needed. Alignment with interests 2 because retail logistics not a tech startup. Opportunities to publish research 0 as this is not a research role. Compensation level 3 because 45-60k Euro is below desired 100k benchmark. Work/life balance 6 because home office and modern facilities. Impact and meaning 2 because supply chain optimization has some impact. Collaborative team environment 3 because cross-functional teamwork. Career advancement prospects 3 because growth opportunities but trajectory unclear.",
        "fit_recruiter": 39.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Strong supply chain management skills proven by managing Saturo Foods end-to-end supply chain (CV). Process optimization experience shown by cost-cutting at Novritsch Trading (CV).  Lacks specific experience in retail SCM or at similar large organizations. Educational Qualifications: 3/5 - Relevant engineering diploma program with business administration (CV). No master's degree in supply chain management or related field. Cultural Fit: 5/7.5 - Entrepreneurial experience at Saturo Foods suggests comfort with fast-paced environments (CV). Leadership training at Novritsch indicates ability to adapt to company culture (CV). Communication Skills: 6/7.5 - Fluent in English and German with basic French (CV). Presentation skills evidenced by C-level consulting (CV). Problem-Solving Ability: 5/5 - Strong analytical and critical thinking skills shown in publications (CV). Industrial engineering training provides methodology for solving problems (CV). Adaptability: 4/5 - Varied background suggests adaptability - startups, large firms, consulting (CV). But limited evidence of adapting to new SCM situations specifically. Initiative and Motivation: 4/5 - Founded successful startup, exhibits self-drive (CV). Unclear if passion for retail/grocery SCM specifically. Teamwork: 3/2.5 - Some collaboration shown on academic publications (CV). But minimal emphasis on team capabilities. Leadership Potential: 2/2.5 - Early leadership as founder, but no evidence in large organizations. Total: 39/50. In summary, the candidate has a strong analytical background and supply chain experience, but is relatively inexperienced for a senior retail SCM role. Cultural fit seems reasonable and they exhibit initiative and leadership potential, but more proven teamwork skills and experience adapting in a corporate SCM environment would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 45k - 60k",
        "location": "Sattledt, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 64.0
    },
    {
        "uuid": 13,
        "company": "epunkt GmbH",
        "title": "C++/Python Software Developer",
        "fit_applicant": 23,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because working on complex projects in power hardware-in-the-loop testing provides some challenge, but not directly in AI. Flexible/remote work arrangements 4 because 60-70% home office provides flexibility. Autonomy and independence 3 because working closely with engineers indicates some oversight. Alignment with interests 2 because renewable energy aligns somewhat with technology interests. Opportunities to publish research 0 because no indication of publishing opportunities. Compensation level 3 because EUR 60k-70k is reasonable but below benchmark. Work/life balance 3 because 60-70% home office enables balance. Impact and meaning 1 because renewable energy technology provides some meaning. Collaborative team environment 1 because working closely with engineers indicates collaboration. Career advancement prospects 1 because growth opportunities not mentioned.",
        "fit_recruiter": 41.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong C++ skills proven by software development work experience (Saturo Foods, epunkt) - Python knowledge stated in CV skills section - Can read and improve code based on experience at Saturo and epunkt - Lacks direct experience in power hardware-in-the-loop testing Educational Qualifications: 3/5 - Relevant engineering diploma degree (Industrial Engineering) - No direct master's degree in computer science Cultural Fit: 5/7.5 - Experience in innovative startups like Saturo suggests cultural fit - Military training indicates discipline and drive Communication Skills: 6/7.5 - Fluent in English and German based on work experience - No direct evidence of technical writing skills Problem-Solving Ability: 5/5 - Analytic skills shown through business intelligence publications - Industrial engineering training relevant for problem solving Adaptability: 4/5 - Varied work experience suggests adaptability - More change experience in software industry would be beneficial Initiative and Motivation: 4/5 - Founded a startup and led investment rounds, indicating initiative - More direct examples in software development would help Teamwork: 3/2.5 - Some collaboration shown in projects and startups - No emphasis on team skills in CV Leadership Potential: 3/2.5 - Managed a team and grew a company, but no tech leadership shown Total: 41/50 In summary, the candidate has strong technical skills but lacks direct experience in power hardware testing software. Cultural and motivation seem decent. More proven software industry experience would be ideal, but the candidate has potential.",
        "date_added": "July 10, 2023",
        "salary_range": "EUR 60k - 70k",
        "location": "Klosterneuburg, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 64.0
    },
    {
        "uuid": 42,
        "company": "Liebherr Werk Bischofshofen",
        "title": "Strategic Buyer",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because some strategic thinking but focused on procurement not AI. Flexible/remote work arrangements 5 because home office mentioned. Autonomy and independence 4 because self-directed work but within procurement strategy. Alignment with interests 2 because traditional manufacturing company. Opportunities to publish research 1 because no research focus. Compensation level 3 because EUR 60-80k reasonable but below benchmark. Work/life balance 4 because flexible hours and home office. Impact and meaning 2 because industrial equipment has economic impact. Collaborative team environment 3 because cross-functional collaboration. Career advancement prospects 2 because growth opportunities unclear.",
        "fit_recruiter": 39.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has experience in supply chain management, cost-cutting, and operations from founding a company and consulting work (CV). Industrial engineering diploma is relevant (CV). No direct experience in purchasing/procurement roles. Educational Qualifications: 5/5 - Diploma in industrial engineering with business and mechanical engineering provides relevant educational background (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience and work in innovative startups suggests potential cultural fit in a manufacturing firm (CV). More details on work style would help assess fit. Communication Skills: 6/7.5 - Fluent in English and German (CV). Can present and document processes (CV). More evidence of negotiation skills would be beneficial. Problem-Solving Ability: 4/5 - Process optimization and cost-cutting projects demonstrate analytical skills (CV). More details on specific problems solved would help. Adaptability: 3/5 - Varied background provides some evidence of adaptability (CV). More examples adapting in business roles needed. Initiative and Motivation: 4/5 - Founded a startup and pursued side projects, indicating self-motivation (CV). More examples desired in procurement/purchasing context. Teamwork: 3/2.5 - Some collaboration shown in projects (CV). More emphasis on teamwork capabilities would be better. Leadership Potential: 2/2.5 - Limited evidence for procurement leadership potential. Total: 39/50 In summary, the candidate has a strong operations and business background but lacks direct purchasing/procurement experience. Cultural fit seems possible. More proven leadership in purchasing and details on business negotiation skills would strengthen their candidacy. I would recommend an interview to further assess motivation and fit.",
        "date_added": "July 7, 2023",
        "salary_range": "EUR 60k - 80k",
        "location": "Bischofshofen, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 64.0
    },
    {
        "uuid": 41,
        "company": "GiveWell",
        "title": "Senior Researcher",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because researching and recommending high-impact giving opportunities is intellectually stimulating, though not specifically AI focused. Flexible/remote work arrangements 15 because fully remote role with flexible hours and locations supported. Autonomy and independence 10 because senior researcher role suggests significant autonomy. Alignment with interests 10 because role is focused on effective altruism and global health/poverty. Opportunities to publish research 2 because research is to inform internal recommendations, unclear if external publishing is done. Compensation level 5 because USD 193-209k is quite competitive for Europe but a bit low for US. Work/life balance 10 because fully remote with flexible hours. Impact and meaning 15 because directly enabling impactful giving recommendations. Collaborative team environment 2 because some collaboration mentioned but limited detail. Career advancement prospects 3 because growth opportunities but trajectory unclear.",
        "fit_recruiter": 31.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Has some research experience through academic projects and publications, but limited evidence of applied research skills needed for this role. Industrial and non-profit experience is limited. (research projects, academic publications) Educational Qualifications: 3/5 - Has a relevant engineering degree, but lacks advanced degree typically expected for this role. (diploma industrial engineering) Cultural Fit: 4/7.5 - Shows some evidence of innovativeness and motivation through starting a company and pursuing diverse experiences. But less clear evidence of focus on altruism and improving lives of the poor. (founded a company, diverse experiences) Communication Skills: 6/7.5 - Communicates clearly in writing in English and German based on CV. But less evidence of verbal communication skills. (CV shows writing skills) Problem-Solving Ability: 3/5 - Shows some analytical skills through academic work, but limited evidence solving complex real-world problems. (academic projects and publications) Adaptability: 3/5 - Has worked in different environments, but limited evidence adapting specifically to research roles. (varied work experience) Initiative and Motivation: 4/5 - Exhibits initiative through starting a company and pursuing diverse experiences. But motivation for research role is less clear. (founded company, diverse experiences) Teamwork: 2/2.5 - Some collaboration shown on academic projects, but limited teamwork emphasis overall. (academic collaborations) Leadership Potential: 1/2.5 - No clear evidence of leadership skills or potential. Total: 31/50 In summary, the candidate has a technical background but lacks the advanced research skills and experience expected for this role. Cultural fit is questionable. More evidence is needed of communication, problem-solving, teamwork, and leadership abilities to assess motivation and fit. I would recommend an initial phone screening to further evaluate research capabilities and fit.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 193k - 209k",
        "location": "Remote",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 63.0
    },
    {
        "uuid": 61,
        "company": "Gates Foundation",
        "title": "Associate Program Officer",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 5 because policy and advocacy work can be intellectually stimulating but not directly in AI research. Flexible/remote work arrangements 3 because some travel required but flexibility likely. Autonomy and independence 4 because associate level suggests some independence but reporting to manager. Alignment with interests 5 because global health and development focus aligns with interests. Opportunities to publish research 1 because policy and advocacy role less focused on publishing. Compensation level 3 because salary not listed but nonprofit may pay below market rate. Work/life balance 4 because 25% travel indicates some balance challenges. Impact and meaning 5 because global health and poverty focus has big impact. Collaborative team environment 2 because collaborates across teams but limited detail. Career advancement prospects 2 because growth opportunities in large foundation.",
        "fit_recruiter": 27.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Has 3 years of professional experience in public health/economic opportunities, but limited direct experience in policy advocacy and management (CV: 3 years professional experience). Educational Qualifications: 3/5 - Has a bachelor's degree, but not a master's degree preferred for the role (CV: Bachelor's degree). Cultural Fit: 4/7.5 - Worked in consulting suggests ability to adapt to new situations, but less evidence of fit with collaborative nonprofit culture (CV: Consulting experience). Communication Skills: 5/7.5 - Shown ability to communicate in English and German, but less evidence of written communication skills (CV: English and German skills). Problem-Solving Ability: 3/5 - Some analytical project work shown, but limited evidence of solving complex problems (CV: Academic projects). Adaptability: 3/5 - Has worked across countries, but limited evidence adapting in demanding work environments (CV: Worked internationally). Initiative and Motivation: 2/5 - Founded a company showing some initiative, but limited evidence in advocacy roles (CV: Founded company). Teamwork: 1/2.5 - No clear evidence of teamwork skills (CV: None). Leadership Potential: 1/2.5 - No clear evidence of leadership skills (CV: None). Total: 27/50 In summary, the candidate has some relevant skills and experience but does not fully meet the desired qualifications. Stronger evidence of policy advocacy, nonprofit cultural fit, communication abilities, problem-solving and teamwork would improve their candidacy. I would recommend an interview to further assess areas of weakness.",
        "date_added": "July 10, 2023",
        "salary_range": "Not provided",
        "location": "Abuja, Nigeria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 59.0
    },
    {
        "uuid": 9,
        "company": "Mavida Group",
        "title": "Stationsleitung",
        "fit_applicant": 32,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 4 because overseeing nursing operations provides some intellectual challenge, but not focused on AI research. Flexible/remote work arrangements 3 because location fixed but some flexibility in hours mentioned. Autonomy and independence 4 because management role indicates autonomy but policies limit independence. Alignment with interests 2 because healthcare operations not a tech startup. Opportunities to publish research 1 because no research mentioned. Compensation level 3 because around 35k Euro is acceptable but below ideal 100k benchmark. Work/life balance 4 because some flexibility but demanding management role. Impact and meaning 5 because caring for elderly has direct impact. Collaborative team environment 3 because leading nursing team requires collaboration. Career advancement prospects 3 because growth opportunities within expanding company.",
        "fit_recruiter": 23.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 3/10 - No direct nursing experience mentioned, mostly business and tech background (CV). Educational Qualifications: 0/5 - No nursing qualifications listed (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suggests potential fit for innovative culture (CV company founding). Communication Skills: 5/7.5 - Fluent in German and English, can present complex topics (CV). Problem-Solving Ability: 3/5 - Analytical and strategic skills shown in consulting work (CV). Adaptability: 2/5 - Some evidence from varied international experience (CV exchanges). Initiative and Motivation: 3/5 - Founded a company, shows some drive (CV company founding). Teamwork: 1/2.5 - Limited teamwork evidence (CV). Leadership Potential: 1/2.5 - Some leadership in own company, but no nursing leadership (CV company founding). Total: 23/50. In summary, candidate's background is business/tech focused with no direct nursing qualifications or experience. Cultural fit potential exists but hard skills are lacking.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 34k - 38k",
        "location": "Villach, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 55.0
    },
    {
        "uuid": 58,
        "company": "Anthropic",
        "title": "Security Officer",
        "fit_applicant": 18,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 2 because the role is focused on physical security and does not involve AI research. Flexible/remote work arrangements 0 because the role is fully onsite. Autonomy and independence 4 because the role involves leading a team and implementing new initiatives, suggesting some independence. Alignment with interests 1 because physical security work does not align with technology and startup interests. Opportunities to publish research 0 as this is an operations role. Compensation level 4 because the salary range of $130-270k is quite high. Work/life balance 2 because the role is onsite so less flexibility. Impact and meaning 3 because protecting people and assets has some impact. Collaborative team environment 1 because collaborating with HR and facilities is mentioned. Career advancement prospects 1 because growth opportunities are not mentioned.",
        "fit_recruiter": 31.0,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Has experience in operations and supply chain management, but no direct security experience (CV). Educational Qualifications: 0/5 - No security-related education or training mentioned (CV). Cultural Fit: 4/7.5 - Startup experience suggests ability to work in innovative environment (CV - Saturo Foods). Communication Skills: 5/7.5 - Fluent in English and German, can present and document processes (CV). Problem-Solving Ability: 4/5 - Process optimization and cost-cutting experience relevant (CV - Novritsch, Saturo). Adaptability: 3/5 - Some evidence from varied work history (CV). Initiative and Motivation: 5/5 - Founded a successful startup, shows drive (CV - Saturo). Teamwork: 2.5/2.5 - Some teamwork evidenced through projects (CV). Leadership Potential: 2.5/2.5 - Managed teams and served in leadership roles (CV - Saturo, Novritsch). Total: 31/50. In summary, applicant has strong business operations background but lacks direct security experience. Cultural fit seems reasonable but more training needed to align with security best practices.",
        "date_added": "July 15, 2023",
        "salary_range": "USD 130k - 270k",
        "location": "San Francisco, USA",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 49.0
    },
    {
        "uuid": 66,
        "company": "epunkt GmbH",
        "title": "Software Architect",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because research in AI provides intellectual challenge, though not specifically in AI. Flexible/remote work arrangements 12 because 60-70% remote work mentioned. Autonomy and independence 10 because architect role suggests autonomy. Alignment with interests 5 because digital innovation interests aligned. Opportunities to publish research 2 because focus is on internal research. Compensation level 4 because 60-84k Euros is decent but below 100k benchmark. Work/life balance 8 because flexibility and remote work. Impact and meaning 3 because digital innovation has impact. Collaborative team environment 3 because large team suggests collaboration. Career advancement prospects 2 because startup may enable fast growth but path unclear.",
        "fit_recruiter": 0.0,
        "fit_recruiter_detailed": "",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 84k",
        "location": "Vienna, Austria",
        "dateAdded": "",
        "salaryRange": "",
        "fit_total": 34.0
    }
]