[{"company":"gt school","title":"AI Prompt Engineer","fit":94,"dateAdded":"July 14, 2023","salaryRange":"$100,000","location":"United States","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) \n- Developing and refining AI prompts for education requires creativity and intellectual rigor (15\/20)\n- However, not focused on AI research itself so some limitations (15\/20)\n\nFlexible\/remote work arrangements (Weight: 15\/100) \n- Fully US remote role (15\/15)\n\nAutonomy and independence (Weight: 15\/100)\n- Unclear on level of autonomy, seems collaborative (10\/15)\n- Leading prompt development indicates some independence (12\/15)\n\nAlignment with interests in technology, startups, risk (Weight: 10\/100)  \n- Educational technology startup, innovative use of AI (10\/10)\n\nOpportunities to publish research (Weight: 5\/100)\n- No research publication opportunities mentioned (0\/5) \n\nCompensation level (Weight: 10\/100)\n- $100k salary is reasonable for role and meets minimum expectations (7\/10)\n\nWork\/life balance (Weight: 10\/100) \n- Flexible full remote in US time zone is very good for work life balance (10\/10)\n\nImpact and meaning (Weight: 5\/100)  \n- Educational impact very meaningful (5\/5)\n\nCollaborative team environment (Weight: 5\/100)\n- Cross-functional collaboration mentioned (5\/5)\n\nCareer advancement prospects (Weight: 5\/100)\n- Early stage startup may provide fast growth opportunities (5\/5)\n\nFinal Fit Score: 94\/100","salary":null},{"company":"OpenAI","title":"Head Procurement","fit":93,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"San Francisco, USA","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Working at pioneering AI research company OpenAI would provide high intellectual stimulation and challenge in AI field (20\/20) Flexible\/remote work arrangements (Weight: 15\/100) - Hybrid work model with 3 days in office provides some flexibility (10\/15) Autonomy and independence (Weight: 15\/100) - As head of function, role suggests high autonomy and independence (15\/15) Alignment with interests in technology, startups, risk (Weight: 10\/100) - OpenAI is a leading AI startup, aligning with interests (10\/10) Opportunities to publish research (Weight: 5\/100) - Procurement role less focused on publishing research (0\/5) Compensation level (Weight: 10\/100) - Salary range not provided but likely competitive for San Francisco area (8\/10) Work\/life balance (Weight: 10\/100) - Unlimited PTO and hybrid schedule indicate good work\/life balance (10\/10) Impact and meaning (Weight: 5\/100) - Procurement enables OpenAI's mission for beneficial AI (5\/5) Collaborative team environment (Weight: 5\/100) - Cross-functional partnerships mentioned (5\/5) Career advancement prospects (Weight: 5\/100) - Leading function at pioneering company indicates advancement potential (5\/5) Total Score: 93\/100","salary":null},{"company":"Rethink Priorities","title":"AI Researcher","fit":85,"dateAdded":"July 14, 2023","salaryRange":"€62k - €118k","location":"Remote","fit_detailed":null,"salary":null},{"company":"Maly","title":"E-Commerce Manager","fit":85,"dateAdded":"July 15, 2023","salaryRange":"€45,000","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation 15\/20, Flexibility 10\/15, Autonomy 12\/15, Interests 8\/10, Research 0\/5, Compensation 8\/10, Work\/life balance 7\/10, Impact 4\/5, Team 5\/5, Advancement 3\/5. Total score 82\/100.","salary":null},{"company":"TU Wien","title":"Doctoral Thesis","fit":85,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Thesis research at a top technical university would provide high intellectual stimulation and challenge in the field of AI (20\/20) Flexible\/remote work arrangements (Weight: 15\/100) - No information provided on remote work options (0\/15) Autonomy and independence (Weight: 15\/100) - Doctoral research requires high levels of autonomy and independence (15\/15) Alignment with interests in technology, startups, risk (Weight: 10\/100) - Thesis research aligns with interests in cutting edge technology like AI, though unclear if startup opportunities (5\/10) Opportunities to publish research (Weight: 5\/100) - Doctoral research focuses on publishing papers (5\/5) Compensation level (Weight: 10\/100) - Typical PhD stipend level, sufficient but not highly competitive (5\/10) Work\/life balance (Weight: 10\/100) - PhD can be demanding, but flexibility to balance work and life (7\/10) Impact and meaning (Weight: 5\/100) - Academic research can have long-term impact but less direct meaning (3\/5) Collaborative team environment (Weight: 5\/100) - PhD research involves collaboration with supervisors (5\/5) Career advancement prospects (Weight: 5\/100) - PhD provides strong prospects for advancing an academic career (5\/5) Final Fit Score: 85\/100","salary":null},{"company":"Mistral AI","title":"AI Researcher","fit":85,"dateAdded":"July 15, 2023","salaryRange":"Not provided","location":"Paris, France","fit_detailed":"Intellectual stimulation and challenge 15\/20 because reason 1, reason 2, reason 3. Flexible\/remote work arrangements 5\/15 because reason 1. Autonomy and independence 12\/15 because reason 1, reason 2. Alignment with interests 10\/10 because reason 1, reason 2. Opportunities to publish research 3\/5 because reason 1. Compensation level 5\/10 because reason 1, reason 2. Work\/life balance 5\/10 because reason 1, reason 2. Impact and meaning 5\/5 because reason 1. Collaborative team environment 4\/5 because reason 1. Career advancement prospects 5\/5 because reason 1.","salary":null},{"company":"JKU","title":"PostDoc","fit":82,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"Linz, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Conducting independent research in machine learning and deep learning provides high intellectual stimulation and challenge directly in Hannes' field of interest (20\/20) Flexible\/remote work arrangements (Weight: 15\/100) - Location is Linz or Vienna, suggesting flexibility, but no clear indication of full remote work or flexible hours (5\/15) Autonomy and independence (Weight: 15\/100) - Independent research and ability to collaborate on projects indicates good autonomy (12\/15) Alignment with interests in technology, startups, risk (Weight: 10\/100) - Work on cutting edge AI research at a university lab aligns very well with Hannes' interests (10\/10) Opportunities to publish research (Weight: 5\/100) - Strong focus on publishing research in top venues (5\/5) Compensation level (Weight: 10\/100) - Salary not provided, but standard postdoc salary likely below Hannes' benchmark (5\/10) Work\/life balance (Weight: 10\/100) - Typical academic work demands may not provide ideal balance (5\/10) Impact and meaning (Weight: 5\/100) - Advancing AI research has good impact, uncertain on end applications (3\/5) Collaborative team environment (Weight: 5\/100) - Collaborating on projects and supervising students indicates good teamwork (4\/5) Career advancement prospects (Weight: 5\/100) - Academic postdoc provides experience but unclear prospects (3\/5) Total Fit Score: 82\/100","salary":null},{"company":"Anthropic","title":"Business Operations","fit":78,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"San Francisco, USA","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100)\n- Working at advanced AI startup provides intellectual stimulation but operations role likely not directly involved in core AI research (15\/20)\n\nFlexible\/remote work arrangements (Weight: 15\/100) \n- Hybrid policy requires minimum 25% office time, not fully remote (10\/15)\n\nAutonomy and independence (Weight: 15\/100)\n- Operations role suggests some autonomy in developing processes but likely oversight from leadership (10\/15) \n\nAlignment with interests in technology, startups, risk (Weight: 10\/100)\n- Advanced AI startup aligned with interests (10\/10)\n\nOpportunities to publish research (Weight: 5\/100)  \n- Operations role unlikely to provide research publication opportunities (0\/5)\n\nCompensation level (Weight: 10\/100) \n- Salary range of $200-330k is well above minimum acceptable level (10\/10)\n\nWork\/life balance (Weight: 10\/100)\n- Hybrid policy limits full remote flexibility (8\/10) \n\nImpact and meaning (Weight: 5\/100) \n- Advanced AI systems have potential for high impact (5\/5)\n\nCollaborative team environment (Weight: 5\/100)\n- Requires partnering across functions suggesting collaboration (5\/5) \n\nCareer advancement prospects (Weight: 5\/100)\n- Fast growing startup may provide advancement opportunities (5\/5)\n\nTotal Fit Score: 78\/100","salary":null},{"company":"Ought","title":"Product Manager","fit":78,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"San Francisco, USA or Remote","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100)\n- Working with state-of-the-art AI language models provides high intellectual stimulation and challenge (15\/20)\n- Product role focuses more on workflow optimization than core AI research (5\/20) \n\nFlexible\/remote work arrangements (Weight: 15\/100) \n- Fully remote role based in San Francisco or elsewhere (15\/15)\n\nAutonomy and independence (Weight: 15\/100)\n- Product manager has autonomy to guide product vision and strategy (10\/15) \n- Unclear on level of independence versus oversight by leadership (5\/15)\n\nAlignment with interests in technology, startups, risk (Weight: 10\/100)  \n- Ought is an AI startup applying frontier language models (10\/10)\n\nOpportunities to publish research (Weight: 5\/100)\n- Product role focused on applications versus publishing research (0\/5)\n\nCompensation level (Weight: 10\/100) \n- Salary range not provided (5\/10)\n- Equity compensation likely competitive for high growth AI startup (5\/10)\n\nWork\/life balance (Weight: 10\/100)\n- Fully remote role supports work\/life balance (10\/10) \n\nImpact and meaning (Weight: 5\/100) \n- Applying AI to support reasoning and research has big impact potential (5\/5)\n\nCollaborative team environment (Weight: 5\/100)\n- Cross-functional product team suggests collaboration (3\/5)  \n- Culture seems positive based on growth and user feedback (2\/5)\n\nCareer advancement prospects (Weight: 5\/100)\n- Early stage startup may enable fast career growth (5\/5)\n\nFinal Score: 78","salary":null},{"company":"Ubitec","title":"Python Developer","fit":78,"dateAdded":"July 14, 2023","salaryRange":"€38,400","location":"Linz, Austria","fit_detailed":"Intellectual stimulation and challenge 10 because working on core chatbot system provides some intellectual stimulation, but not specialized AI work. Flexible\/remote work arrangements 15 because fully remote work and flexible hours mentioned. Autonomy and independence 15 because flat hierarchies and fast decision making enables autonomy, leading development indicates independence. Alignment with interests 10 because core technology focus aligned with interests. Opportunities to publish research 0 because no indication of research publishing opportunities. Compensation level 5 because salary of €38,400 is below expected benchmark of €100k. Work\/life balance 10 because fully remote work and flexible hours support work\/life balance. Impact and meaning 3 because developing innovative chatbot technology has moderate impact. Collaborative team environment 5 because team events and knowledge sharing indicates collaboration. Career advancement prospects 5 because early stage startup may enable fast career growth.","salary":null},{"company":"Mostly AI","title":"Developer in Test","fit":78,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"Remote","fit_detailed":"Intellectual stimulation and challenge 10 because developing testing processes and frameworks for a deep-tech AI startup provides moderate intellectual stimulation and challenge related to quality assurance, testing automation, etc. But not directly in the AI research area. Flexible\/remote work arrangements 15 because fully remote role based anywhere in Europe provides maximum flexibility. Autonomy and independence 15 because as the sole Developer in Test, this role would have significant autonomy to build up testing processes independently. Interacting with clients directly also indicates independence. Alignment with interests in technology, startups, risk 10 because AI startup focused on privacy-preserving synthetic data is very well aligned with interests in cutting-edge tech and startups. Requires comfort with risk and scaling a new company. Opportunities to publish research 0 because no indication that a Developer in Test role would publish research. Compensation level 5 because salary range not provided. As a European remote role, estimated range is €60-80k. Slightly below desired €100k benchmark for Europe. Work\/life balance 10 because fully remote work anywhere in Europe provides exceptional flexibility. Additional days off and team activities indicate strong focus on work\/life balance. Impact and meaning 5 because enabling responsible use of AI through synthetic data has big societal impact. Testing role contributes to commercial success and product quality. Collaborative team environment 5 because emphasis on winning as a team and virtual team activities indicate collaborative culture. Career advancement prospects 3 because early stage startup may provide fast growth opportunities but advancement path is unclear for this specific role.","salary":null},{"company":"Bolzhauser AG","title":"Low Code Developer","fit":77,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"Munich, Frankfurt, Berlin, Hamburg, Dusseldorf, Stuttgart, Vienna","fit_detailed":"Intellectual stimulation and challenge 10 because low-code development provides some stimulation but not AI focused. Flexible\/remote work arrangements 15 because fully remote and mobile working offered. Autonomy and independence 10 because some autonomy but manager oversight. Alignment with interests 5 because established consulting firm, not startups. Opportunities to publish research 0 because commercial focus, not research. Compensation level 7 because competitive base pay likely but bonus\/equity unknown. Work\/life balance 10 because 30 days vacation, flexible schedules, fully remote. Impact and meaning 3 because solutions provide moderate impact. Collaborative team environment 3 because some collaboration but culture not emphasized. Career advancement prospects 4 because opportunities at established firm.","salary":null},{"company":"epunkt","title":"Senior Java Developer","fit":75,"dateAdded":"July 14, 2023","salaryRange":"€3,500 - €5,000","location":"Wien, Austria","fit_detailed":null,"salary":null},{"company":"BRZ","title":"Solution Architect","fit":75,"dateAdded":"July 14, 2023","salaryRange":"€73,907","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation and challenge (15\/20), Flexible\/remote work arrangements (10\/15), Autonomy and independence (12\/15), Alignment with interests in technology, startups, risk (8\/10), Opportunities to publish research (0\/5), Compensation level (7\/10), Work\/life balance (8\/10), Impact and meaning (4\/5), Collaborative team environment (4\/5), Career advancement prospects (3\/5)","salary":null},{"company":"Mainz Biomed","title":"VP Commercial Ops","fit":75,"dateAdded":"July 15, 2023","salaryRange":"Not provided","location":"Remote","fit_detailed":"Intellectual stimulation and challenge 15 because innovative biotech diagnostics are intellectually stimulating, developing sales strategy requires creative thinking, and oncology focus provides complexity. Flexible\/remote work arrangements 15 because fully remote DACH-based role, flexible hours mentioned, and home office stated. Autonomy and independence 10 because VP suggests autonomy but unclear on CCO oversight and leading team indicates some independence. Alignment with interests 10 because biotech startup with innovative cancer prevention technology indicates risk tolerance needed. Opportunities to publish research 2 because commercial operations less focused on research, could partner with R&D. Compensation level 5 because salary range not provided, likely competitive for role but equity details unknown. Work\/life balance 10 because fully remote, flexible hours, reasonable travel. Impact and meaning 5 because cancer prevention diagnostics have big impact and commercial success enables product impact. Collaborative team environment 3 because leading commercial team indicates collaboration and cross-functional partnerships mentioned but limited detail on culture. Career advancement prospects 3 because startup may enable fast growth but advancement path and trajectory unclear.","salary":null},{"company":"epunkt","title":"Software Developer","fit":75,"dateAdded":"July 14, 2023","salaryRange":"€3500 - €5000","location":"Klosterneuburg, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - The job involves working on complex projects using state-of-the-art technology which provides intellectual stimulation (15\/20) - Opportunity to improve existing code provides ongoing challenge (15\/20) - Maintenance and improvement of existing software limits creativity (10\/20) Grade: 15\/20 Flexible\/remote work arrangements (Weight: 15\/100) - 60-70% remote work provides good flexibility (10\/15) - Some time in office required limits full flexibility (5\/15) Grade: 10\/15 Autonomy and independence (Weight: 15\/100) - Role involves close collaboration with engineers which may limit autonomy (10\/15) - Proactive mindset and willingness to learn indicates independence (10\/15) - Software is integral part of product, allowing optimization input (10\/15) Grade: 10\/15 Alignment with interests in technology, startups, risk (Weight: 10\/100) - Role aligns with interest in technology (10\/10) - Company is a technological leader but not a startup (5\/10) - Work involves optimization rather than risk taking (0\/10) Grade: 5\/10 Opportunities to publish research (Weight: 5\/100) - No indication that role involves publishing research (0\/5) Grade: 0\/5 Compensation level (Weight: 10\/100) - Salary range of €3,500-€5,000 is reasonable for role (7\/10) Grade: 7\/10 Work\/life balance (Weight: 10\/100) - 60-70% remote work enables good work\/life balance (8\/10) - Flexible working hours also support balance (10\/10) Grade: 10\/10 Impact and meaning (Weight: 5\/100) - Optimization of software creates some impact (3\/5) - Software is integral part of product (5\/5) Grade: 5\/5 Collaborative team environment (Weight: 5\/100) - Close collaboration with engineers indicates team environment (5\/5) Grade: 5\/5 Career advancement prospects (Weight: 5\/100) - No indication of advancement prospects (0\/5) Grade: 0\/5 Final Grade: 75\/100 The job aligns well with Hannes' interests in technology and provides intellectual stimulation and autonomy. The compensation and remote work arrangements are also decent. The lack of advancement prospects, creativity limits and research opportunities prevent a higher score. But overall it matches Hannes' needs reasonably well.","salary":null},{"company":"Bundesrechenzentrum","title":"KI Project Manager","fit":65,"dateAdded":"July 14, 2023","salaryRange":null,"location":"Vienna, Austria","fit_detailed":"Intellectual stimulation 15\/20, flexible work 10\/15, autonomy 10\/15, interests 7\/10, research 3\/5, compensation 7\/10, work\/life 8\/10, impact 4\/5, collaboration 4\/5, advancement 3\/5","salary":"€73,595"},{"company":"Helloprint","title":"Prompt Engineering Intern","fit":65,"dateAdded":"July 14, 2023","salaryRange":"Market-conform internship fee","location":"Valencia, Spain","fit_detailed":null,"salary":null},{"company":"bank99","title":"Application Expert","fit":65,"dateAdded":"July 14, 2023","salaryRange":"€55,000","location":"Vienna, Austria","fit_detailed":null,"salary":null},{"company":"RBI","title":"Student AI","fit":65,"dateAdded":"July 14, 2023","salaryRange":"€2263","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation 15 because reason 1, 2, 3, flexible work 10 because reason 1, 2, autonomy 10 because reason 1, 2, 3, alignment with interests 10 because reason 1, 2, compensation 7 because reason 1, 2, work\/life balance 8 because reason 1, 2, impact 4 because reason 1, collaborative environment 5 because reason 1, career advancement 3 because reason 1","salary":null},{"company":"Liebherr Werk Bischofshofen GmbH","title":"Strategischer Facheinkäufer \/ Lead Buyer","fit":65,"dateAdded":"July 7, 2023","salaryRange":"","location":"Bischofshofen, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100): 15 - The job involves strategic purchasing responsibilities which provide some intellectual challenge, but may not be highly technical or research focused. Autonomy and independence (Weight: 15\/100): 10 - Has responsibility for managing categories and suppliers, but likely involves collaboration with other internal teams. Flexible\/remote work arrangements (Weight: 15\/100): 15 - Offers flexible work hours and home office options. Alignment with interests in technology, startups, risk (Weight: 10\/100): 5 - Traditional manufacturing company, not a tech startup. Opportunities to publish research (Weight: 5\/100): 0 - No indication that publishing research is part of the role. Compensation level (Weight: 10\/100): 7 - Salary based on qualifications and experience, expected to be competitive. Work\/life balance (Weight: 10\/100): 10 - Flexible work arrangements support work\/life balance. Impact and meaning (Weight: 5\/100): 3 - Some ability to influence supplier relationships and purchasing strategy. Collaborative team environment (Weight: 5\/100): 5 - Requires collaboration with various internal teams. Career advancement prospects (Weight: 5\/100): 0 - Limited information provided on advancement opportunities.","salary":null},{"company":"Forecasting Research Institute","title":"Operations Lead","fit":65,"dateAdded":"July 14, 2023","salaryRange":"Not provided","location":"Remote","fit_detailed":"Intellectual stimulation and challenge 15 because provides some challenge but seems more operational than strategic. Flexible\/remote work arrangements 15 because fully remote. Autonomy and independence 10 because some autonomy but also need to collaborate with leadership. Alignment with interests in technology, startups, risk 7 because aligned with tech\/research but established non-profit not risky startup. Opportunities to publish research 2 because operational role with limited research involvement. Compensation level 0 because no range provided. Work\/life balance 7 because remote flexibility but operations may involve longer hours. Impact and meaning 4 because some impact supporting research but not directly involved. Collaborative team environment 3 because some collaboration with leadership required but fairly independent role. Career advancement prospects 2 because not clearly stated.","salary":null},{"company":"Aldi Hofer","title":"Consultant Project Management","fit":62,"dateAdded":"July 14, 2023","salaryRange":"€47,064","location":"Sattledt, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Project management of supply chain projects provides some intellectual challenge, but not specifically in AI which is the key interest area. Process improvement work and developing project management tools provides moderate intellectual stimulation. Grade: 10\/20. Flexible\/remote work arrangements (Weight: 15\/100) - Up to 50% remote work mentioned as a benefit. Grade: 12\/15. Autonomy and independence (Weight: 15\/100) - Own responsibility for planning and managing projects indicates a good level of autonomy. Working independently and proactively is mentioned in the requirements. Grade: 13\/15. Alignment with interests in technology, startups, risk (Weight: 10\/100) - Supply chain and logistics are not a core interest area. Retail company so not a technology startup. Grade: 3\/10. Opportunities to publish research (Weight: 5\/100) - No research opportunities mentioned. Grade: 0\/5. Compensation level (Weight: 10\/100) - Salary range not provided. Based on role and company, estimated around €47,000. Below desired salary range but reasonable for entry level. Grade: 5\/10. Work\/life balance (Weight: 10\/100) - Up to 50% remote work enables good work\/life balance. Grade: 8\/10. Impact and meaning (Weight: 5\/100) - Supply chain optimization provides some broader impact. Grade: 3\/5. Collaborative team environment (Weight: 5\/100) - Cross-functional collaboration mentioned. Grade: 4\/5. Career advancement prospects (Weight: 5\/100) - Large established company may provide advancement opportunities. Grade: 4\/5. Final Grade: 62","salary":null},{"company":"EWP Recycling Pfand","title":"Leitung Operations","fit":61,"dateAdded":"July 8, 2023","salaryRange":"€75k","location":"Wien, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Developing operations for new bottle deposit system provides some intellectual challenge but not focused on AI, so I will give this a 10\/20. The operations role involves logistics, infrastructure, processes which require strategic thinking but are not AI\/ML focused. However, building a recycling system from scratch is still an interesting challenge. Flexible\/remote work arrangements (Weight: 15\/100) - No indication of remote or flexible work arrangements given in the job description, so I will assume a typical office-based role and give this a 0\/15. Autonomy and independence (Weight: 15\/100) - As head of operations there appears to be a high level of responsibility and autonomy, though oversight from executive team, so I will give this a 12\/15. Alignment with interests in technology, startups, risk (Weight: 10\/100) - Developing a new recycling system aligns with interests in startups, sustainability and some technology use, so I will give this an 8\/10. Opportunities to publish research (Weight: 5\/100) - Operations role focused on implementation rather than research, so 0\/5 for publishing opportunities. Compensation level (Weight: 10\/100) - Salary range of €75k is stated, which meets minimum expectations, so I will give this a 7\/10. Work\/life balance (Weight: 10\/100) - No indication of work arrangements given, so assuming standard office-based role, will give 5\/10 for work\/life balance. Impact and meaning (Weight: 5\/100) - Developing recycling system has environmental impact, so I will give this a 4\/5. Collaborative team environment (Weight: 5\/100) - Building operations team indicates potential for collaboration, so 3\/5. Career advancement prospects (Weight: 5\/100) - Operations head role provides leadership experience but startup may have limited advancement, so 2\/5. Total score = 61\/100","salary":null},{"company":"Berufsförderungsinstitut Österreich","title":"Geschäftsführerin\/Geschäftsführer","fit":60,"dateAdded":"July 14, 2023","salaryRange":"€88,000","location":"Wien, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) \n- Adult education management provides some intellectual challenge, but not directly in AI\/tech (10\/20)\n- Reason 1: Role is focused on management rather than hands-on tech work\n- Reason 2: Adult education field provides complexity, though not AI\/tech specifically \n- Reason 3: Strategic thinking required, but operations focused rather than research\n\nFlexible\/remote work arrangements (Weight: 15\/100) \n- Office based in Vienna, no remote work mentioned (0\/15)\n- Reason 1: No indication that remote work is possible\n- Reason 2: Office location specified as Vienna \n- Reason 3: Sounds like on-site presence expected as norm\n\nAutonomy and independence (Weight: 15\/100)\n- High level of autonomy as CEO of organization (15\/15)  \n- Reason 1: CEO position suggests significant independence\n- Reason 2: Responsible for operational, personnel and financial leadership\n- Reason 3: Reports to supervisory board rather than manager\n\nAlignment with interests (Weight: 10\/100)\n- Non-profit adult education aligns with social impact interests (8\/10)\n- Reason 1: Non-profit status indicates social mission \n- Reason 2: Adult education improves lives and aligns with interests\n- Reason 3: Not a tech startup, so only moderate interest alignment\n\nOpportunities to publish research (Weight: 5\/100) \n- Educational nonprofit less focused on publishing research (2\/5)\n- Reason 1: Role is operational rather than conducting own research\n- Reason 2: May produce reports, but likely not academic papers \n- Reason 3: Could enable research partnerships, but not a core activity\n\nCompensation level (Weight: 10\/100)\n- Salary of €88,000 is reasonable but below benchmark (5\/10)\n- Reason 1: €88,000 is below Hannes' €100k benchmark \n- Reason 2: Non-profit may have lower salaries than corporate roles  \n- Reason 3: Still a solid salary, but leaves room for higher offers\n\nWork\/life balance (Weight: 10\/100) \n- Traditional office-based schedule with no flexibility indicated (3\/10)\n- Reason 1: No remote or flexible work arrangements mentioned\n- Reason 2: Office location specified, suggesting set hours\n- Reason 3: Work-life balance likely decent but not highly flexible\n\nImpact and meaning (Weight: 5\/100)\n- Educational mission provides high social impact (5\/5)  \n- Reason 1: Non-profit status indicates social mission\n- Reason 2: Adult education improves lives and communities\n- Reason 3: Directly advancing education and employment\n\nCollaborative team environment (Weight: 5\/100)\n- Small team size suggests collaboration (4\/5)\n- Reason 1: Leading team of just 3 direct reports\n- Reason 2: Coordinating with other organizations requires collaboration\n- Reason 3: Non-profit sector tends to have collaborative cultures\n\nCareer advancement prospects (Weight: 5\/100)\n- Leadership role offers growth but nonprofit may limit advancement (3\/5)\n- Reason 1: CEO position reaches top of organization but can build experience\n- Reason 2: Broader advancement may be limited within this nonprofit \n- Reason 3: Educational sector has fewer corporate ladder opportunities\n\nTotal Fit Score: 60\/100","salary":null},{"company":"Bundesrechenzentrum","title":"Product Owner AI","fit":58,"dateAdded":"July 6, 2023","salaryRange":"€48,744","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100) - Working on AI and machine learning projects provides intellectual stimulation and challenge in the desired AI field (15\/20) - However, unclear on level of innovation or complexity of projects (5\/20) Flexible\/remote work arrangements (Weight: 15\/100) - No indication of remote work or flexible arrangements mentioned (0\/15) Autonomy and independence (Weight: 15\/100)- Product owner role driving agile software development indicates some autonomy (10\/15) - However, collaborating with stakeholders implies some oversight (5\/15) Alignment with interests in technology, startups, risk (Weight: 10\/100)- Working for government agency less aligned with interests in startups and risk taking (5\/10)- But using innovative technologies like AI\/ML is aligned with tech interests (5\/10)Opportunities to publish research (Weight: 5\/100)- No indication research publishing would be possible in this commercial role (0\/5)Compensation level (Weight: 10\/100) - Salary of €48,744 is below desired range but may be increased with experience (5\/10)Work\/life balance (Weight: 10\/100) - No indication of work-life balance policies mentioned (0\/10)Impact and meaning (Weight: 5\/100) - Digitalization projects have societal impact by improving government services (5\/5)Collaborative team environment (Weight: 5\/100)- Agile development indicates collaborative team environment (5\/5)Career advancement prospects (Weight: 5\/100)- Growth opportunities mentioned but trajectory unclear (3\/5)Total Fit Score: 58\/100","salary":null},{"company":"Anthropic","title":"Product Support Specialist","fit":55,"dateAdded":"July 14, 2023","salaryRange":"$115k - $130k","location":"San Francisco, USA","fit_detailed":"Intellectual stimulation and challenge 5 because innovative biotech diagnostics are intellectually stimulating, however, this is not in the field of AI. developing sales strategy requires creative thinking, and oncology focus provides complexity. Flexible\/remote work arrangements 15 because fully remote DACH-based role, flexible hours mentioned, and home office stated. Autonomy and independence 10 because VP suggests autonomy but unclear on CCO oversight and leading team indicates some independence. Alignment with interests 10 because biotech startup with innovative cancer prevention technology indicates risk tolerance needed. Opportunities to publish research 2 because commercial operations less focused on research, could partner with R&D. Compensation level 5 because salary range not provided, likely competitive for role but equity details unknown. Work\/life balance 10 because fully remote, flexible hours, reasonable travel. Impact and meaning 5 because cancer prevention diagnostics have big impact and commercial success enables product impact. Collaborative team environment 3 because leading commercial team indicates collaboration and cross-functional partnerships mentioned but limited detail on culture. Career advancement prospects 3 because startup may enable fast growth but advancement path and trajectory unclear.","salary":null},{"company":"Mavida Group","title":"Stationsleitung\/Pflegedienstleitung Stellvertretung","fit":40,"dateAdded":"July 15, 2023","salaryRange":"Not provided","location":"Villach, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100): \n- Managing nursing station and deputizing for head nurse provides some intellectual challenge and responsibility but not focused on AI (0\/20)\n\nFlexible\/remote work arrangements (Weight: 15\/100):\n- No indication that remote work is possible for this role (0\/15) \n\nAutonomy and independence (Weight: 15\/100):\n- Significant autonomy and independence in managing entire nursing process and care as deputy head nurse (15\/15)\n\nAlignment with interests in technology, startups, risk (Weight: 10\/100):  \n- Healthcare\/nursing home provider, not a technology startup or indication of risk tolerance needed (0\/10)\n\nOpportunities to publish research (Weight: 5\/100):\n- No research publication opportunities indicated for this operational management role (0\/5)\n\nCompensation level (Weight: 10\/100):  \n- Salary range not provided but nursing pay scale suggests approximately €35,000-€45,000 annually full-time (5\/10)\n\nWork\/life balance (Weight: 10\/100):\n- Ability to influence schedule is positive for work\/life balance but demanding management role (5\/10) \n\nImpact and meaning (Weight: 5\/100):\n- Directly caring for elderly and dementia patients provides meaningful impact (5\/5)\n\nCollaborative team environment (Weight: 5\/100):  \n- Leading nursing station team indicates collaboration is required (5\/5) \n\nCareer advancement prospects (Weight: 5\/100):\n- Opportunity to advance to head nurse role long-term (5\/5)\n\nTotal Fit Score: 40\/100","salary":null},{"company":"Philip Morris","title":"Lead Supply Chain","fit":39,"dateAdded":"July 14, 2023","salaryRange":"€66,000","location":"Vienna, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100): \n- Supply chain optimization provides some analytical challenge but likely not highly intellectually stimulating (5\/20)\n- Focus is operational excellence rather than cutting edge innovation (2\/20) \n- Industry (tobacco) not aligned to Hannes' AI interests (0\/20)\nTotal: 7\/20\n\nFlexible\/remote work arrangements (Weight: 15\/100):\n- Office based role in Vienna, no mention of remote work (0\/15)\n- Traditional corporate structure unlikely to offer much flexibility (0\/15)  \nTotal: 0\/15 \n\nAutonomy and independence (Weight: 15\/100):\n- Lead position suggests some autonomy and independence (10\/15)  \n- Unclear on oversight from managers (5\/15)\nTotal: 15\/15\n\nAlignment with interests in technology, startups, risk (Weight: 10\/100):  \n- Large traditional corporation, not a tech startup (0\/10)\n- Tobacco industry has regulatory risks but not technology innovation risk (2\/10)\n- Not focused on AI or advanced technology (0\/10)\nTotal: 2\/10\n\nOpportunities to publish research (Weight: 5\/100):\n- Operations focused role, no research publishing opportunities (0\/5)\nTotal: 0\/5\n\nCompensation level (Weight: 10\/100):  \n- €66,000 base is below Hannes' €100k benchmark (5\/10)\n- No mention of bonus or equity upside (0\/10) \nTotal: 5\/10\n\nWork\/life balance (Weight: 10\/100):\n- Office based traditional role unlikely to offer work\/life balance (2\/10)\n- No mention of flexibility or remote work (0\/10)\nTotal: 2\/10\n\nImpact and meaning (Weight: 5\/100):\n- Supply chain optimization enables business impact (2\/5)  \n- Tobacco industry less socially meaningful (0\/5) \nTotal: 2\/5\n\nCollaborative team environment (Weight: 5\/100):\n- Cross-functional partnerships mentioned (2\/5)\n- Limited detail provided on culture (1\/5)\nTotal: 3\/5 \n\nCareer advancement prospects (Weight: 5\/100):\n- Large corporation may provide advancement opportunities (2\/5)\n- Career path and trajectory unclear (1\/5)\nTotal: 3\/5\n\nOverall Fit Score: 39\/100","salary":null},{"company":"ALDI SÜD","title":"Buying Manager Food","fit":37,"dateAdded":"July 10, 2023","salaryRange":"€96,800","location":"Wals, Austria","fit_detailed":"Intellectual stimulation and challenge (Weight: 20\/100)\n- Developing and driving global buying strategy provides intellectual challenge (5\/20)\n- Negotiating with international brand suppliers requires strategic thinking (5\/20)  \n- Managing and developing a team of buyers enables stimulating leadership opportunities (5\/20)\n- Focus is on branded food buying which is not AI, so only moderate fit for interests (5\/20)\n\nFlexible\/remote work arrangements (Weight: 15\/100) \n- No indication of remote work options or flexibility mentioned (0\/15)\n\nAutonomy and independence (Weight: 15\/100)\n- Leading a global buying business unit independently indicates significant autonomy (10\/15)  \n- Reporting to top management suggests some oversight (5\/15)\n\nAlignment with interests in technology, startups, risk (Weight: 10\/100)\n- Buying role in established retail company, not a technology startup (0\/10)\n- Food buying has minimal technology focus (0\/10) \n\nOpportunities to publish research (Weight: 5\/100) \n- Commercial buying role is not research focused (0\/5)\n\nCompensation level (Weight: 10\/100)\n- Salary of €96,800 is reasonable but below desired six figure benchmark (5\/10) \n\nWork\/life balance (Weight: 10\/100) \n- Retail buying will require long hours during peak seasons (3\/10)\n- 25% travel indicates moderate work\/life balance challenges (3\/10)\n\nImpact and meaning (Weight: 5\/100)\n- Sourcing quality affordable food has moderate societal impact (3\/5)\n\nCollaborative team environment (Weight: 5\/100)\n- Leading and developing a team indicates collaboration is valued (3\/5)\n\nCareer advancement prospects (Weight: 5\/100)\n- Large retail company provides good advancement opportunities (3\/5)\n\nTotal fit score: 37\/100","salary":null}]