[
    {
        "company": "Future of Life Institute",
        "title": "Various Positions",
        "fit": 76,
        "fit_detailed": "Intellectual stimulation and challenge (20/100): 15 - Working on mitigating existential risks is intellectually stimulating and challenging, though not specifically in AI. - Policy and research roles could provide intellectual rigor. Flexible/remote work arrangements (15/100): 15 - Fully remote organization with team distributed across Europe and US. Autonomy and independence (15/100): 10 - Some autonomy likely as a distributed team, but unclear how much independence in roles. Alignment with interests in technology, startups, risk (10/100): 10 - Aligns with interest in existential risk, though not specifically startups or technology. Opportunities to publish research (5/100): 3 - Research and policy work could enable publications, but focus unclear. Compensation level (10/100): 5 - Salary not listed, nonprofit may not match benchmark. Work/life balance (10/100): 8 - Fully remote suggests good work/life balance. Impact and meaning (5/100): 5 - Directly focused on existential risk mitigation and flourishing futures. Collaborative team environment (5/100): 3 - Distributed team requires collaboration, but culture unclear. Career advancement prospects (5/100): 2 - Unclear advancement opportunities in nonprofit. Final Grade: 76",
        "dateAdded": "July 14, 2023",
        "salaryRange": "Not provided",
        "location": "Remote"
    },
    {
        "company": "epunkt",
        "title": "Software Architect",
        "fit": 76,
        "fit_detailed": "Intellectual stimulation and challenge (Weight: 20/100)\nGrade: 15\nThe role involves research into highly scalable and robust AI systems, identifying research results, and collaborating with developers, testers and architects, which provides intellectual stimulation. However, the focus seems more on software architecture than core AI research.\n\nFlexible/remote work arrangements (Weight: 15/100)\nGrade: 15\n60-70% home office is mentioned, along with flexible working hours, meeting this key requirement.\n\nAutonomy and independence (Weight: 15/100)\nGrade: 10\nThe architect role suggests some autonomy, but unclear on level of oversight from management. Leading a team indicates some independence.\n\nAlignment with interests in technology, startups, risk (Weight: 10/100)\nGrade: 5\nLarge established company focused on digitalization and automation, not an AI startup. Unclear on risk appetite.\n\nOpportunities to publish research (Weight: 5/100)\nGrade: 3\nMore focused on commercial software development than publishing research.\n\nCompensation level (Weight: 10/100)\nGrade: 8\nSalary range of €60k-€84k is decent but below the €100k benchmark target.\n\nWork/life balance (Weight: 10/100)\nGrade: 10\nFlexible hours and significant remote work support good work/life balance.\n\nImpact and meaning (Weight: 5/100)\nGrade: 3\nDigitalization and automation have impact but details lacking on societal meaning.\n\nCollaborative team environment (Weight: 5/100)\nGrade: 4\nCollaborating with developers, testers and architects indicates some teamwork, but culture unclear.\n\nCareer advancement prospects (Weight: 5/100)\nGrade: 3\nEstablished company may provide advancement but trajectory and growth path not mentioned.\n\nTotal Fit Score: 76",
        "dateAdded": "July 14, 2023",
        "salaryRange": "€60k - €84k",
        "location": "Vienna, Austria"
    },
    {
        "company": "epunkt",
        "title": "Software Architect",
        "fit": 75,
        "fit_detailed": "Intellectual stimulation and challenge 15 because innovative AI research provides intellectual stimulation, though commercial focus may limit pure research opportunities. Flexible/remote work arrangements 10 because 60-70% remote work mentioned but some office presence required. Autonomy and independence 10 because architect role suggests some autonomy but unclear how much independence within larger team. Alignment with interests 10 because AI focus aligns with interests though commercial applications less aligned. Opportunities to publish research 5 because some research expected but focus on commercial products may limit publishing. Compensation level 7 because salary range of €60-84k is decent but below benchmark. Work/life balance 8 because partial remote work provides flexibility but some office presence required. Impact and meaning 5 because commercial AI applications have impact but details unknown. Collaborative team environment 3 because large team suggests collaboration but culture unclear. Career advancement prospects 2 because architect role has limited advancement potential.",
        "dateAdded": "July 11, 2023",
        "salaryRange": "€60k - €84k",
        "location": "Vienna, Austria"
    },
    {
        "company": "Digital Factory Vorarlberg",
        "title": "Research Engineer for AI",
        "fit": 73,
        "fit_detailed": "Intellectual stimulation and challenge: 15/20. The role involves applying modern AI/ML methods which provides intellectual stimulation. However, it is more focused on industrial applications rather than core AI research. Flexible/remote work arrangements: 10/15. No mention of remote work or flexible arrangements. As a research role likely some flexibility but full remote work unlikely. Autonomy and independence: 12/15. Position involves leading own work packages which provides autonomy. However, collaborating in interdisciplinary teams and reporting to project managers limits full independence. Alignment with interests in technology, startups, risk: 8/10. Applied industrial AI research aligns with technology interests. Company is a joint venture startup. But projects seem lower risk. Opportunities to publish research: 3/5. Research is application-focused so publishing academic papers is possible but not the priority. Compensation level: 7/10. Salary not provided. As a research role at a small company, pay is likely reasonable but not at senior engineering levels. Work/life balance: 8/10. Standard office job so reasonable work-life balance expected. Location in Dornbirn offers good quality of life. Impact and meaning: 4/5. Practical impact applying AI/ML to industry problems, but incremental rather than transformative technologies. Collaborative team environment: 4/5. Involves cross-functional collaboration in interdisciplinary teams. Company culture not described. Career advancement prospects: 2/5. Limited information provided about career growth. Small company may enable broad experience but advancement opportunities unclear. Total Fit Score: 73/100",
        "dateAdded": "July 14, 2023",
        "salaryRange": "Not provided",
        "location": "Dornbirn, Austria"
    },
    {
        "company": "a.b.s. Rechenzentrum",
        "title": "Frontend Developer",
        "fit": 66,
        "fit_detailed": "Intellectual stimulation and challenge 15/20 - Developing customer web applications and optimizing processes provides intellectual challenge, though not specifically in AI. Still frontend development requires creative problem solving. Flexible/remote work arrangements 10/15 - Remote work is possible after initial onsite training period. Flexible hours mentioned but details unclear. Autonomy and independence 12/15 - Self-directed tasks in developer role indicates autonomy, but unclear on amount of oversight. Alignment with interests in technology, startups, risk 5/10 - Established company focused on HR/accounting services, not a tech startup. Opportunities to publish research 0/5 - No research publication opportunities mentioned for this commercial development role. Compensation level 7/10 - Salary not provided, expected to be competitive for role but likely below benchmark. Work/life balance 8/10 - Remote work enables flexibility, though depends on team norms. Impact and meaning 3/5 - Developing HR/accounting solutions provides utility but limited societal impact. Collaborative team environment 4/5 - Emphasis on teamwork and collaboration. Career advancement prospects 2/5 - Established company but frontend developer role has limited trajectory.",
        "dateAdded": "July 14, 2023",
        "salaryRange": "Not provided",
        "location": "Berlin, Germany"
    },
    {
        "company": "epunkt",
        "title": "Senior Java Developer",
        "fit": 65,
        "fit_detailed": "Intellectual stimulation and challenge: 15/20 - Developing and improving a cloud-based software system provides intellectual challenge, though not specifically in AI - Innovative product indicates stimulating work, but core technology is Java/Kotlin rather than AI - Software architecture design provides complexity Flexible/remote work arrangements: 10/15 - 80-90% remote work available - Home office equipment provided - Located in Vienna city center for occasional office days Autonomy and independence: 12/15 - Works closely with other teams like product and QA, suggesting some independence but not complete autonomy - Can help shape end-to-end product lifecycle which indicates independence Alignment with interests: 5/10 - Software company but focused on Java development rather than AI or deep tech - Innovative product indicates some startup elements like risk taking Opportunities to publish research: 0/5 - No indication that this commercial software role involves publishing research Compensation level: 7/10 - Salary range of €42,000 - €60,000 is reasonable for role and location - Upper end reaches desired six figure compensation Work/life balance: 8/10 - 80-90% remote work and flexible hours promotes work/life balance - Limited travel mentioned Impact and meaning: 2/5 - Developing commercial software, unclear on societal impact potential Collaborative team environment: 4/5 - Cross-functional agile teams indicates collaboration - But limited detail provided on culture Career advancement prospects: 2/5 - Software development role with unclear trajectory for advancement Total fit score: 65/100",
        "dateAdded": "July 9, 2023",
        "salaryRange": "€42,000 - €60,000",
        "location": "Vienna, Austria"
    }
]