[
    {
        "uuid": 27,
        "company": "Stockholm International Peace Research Institute",
        "title": "Researcher, Governance of Artificial Intelligence",
        "fit_applicant": 75,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 10\nThe role involves research and analysis on AI governance which provides intellectual stimulation, however not directly in AI development. Still an emerging policy area providing complexity.\n\nFlexible/remote work arrangements: 5  \nLocation is Solna, Sweden, so likely requires relocation from current location. Some travel mentioned. Unclear on remote work flexibility.\n\nAutonomy and independence: 10\nDevelop and conduct research activities independently and collaboratively indicates a high degree of autonomy.\n\nAlignment with interests: 10 \nFocus on AI governance, international security, and policy aligns directly with interests.\n\nOpportunities to publish research: 10\nStrong emphasis on developing expertise, conducting research, and publishing findings.\n\nCompensation level: 5\nSalary not provided, expected to be reasonable for academic research role but likely below industry compensation.\n\nWork/life balance: 5\nSome travel required, unclear on remote flexibility, full-time role indicates standard hours.\n\nImpact and meaning: 10\nDirectly aimed at informing AI governance for peace and security, high societal impact.\n\nCollaborative team environment: 5\nMix of independent and collaborative work, positive culture referenced.\n\nCareer advancement prospects: 5\n2 year contract with possible extension provides some initial security. Unclear long-term trajectory.\n\nFinal fit: 75",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has experience with generative AI and prompt engineering through academic projects and publications, but no direct industrial experience cited (CV). Educational Qualifications: 5/5 – Has a relevant master’s degree in computer science/engineering (CV). Cultural Fit: 7/7.5 – Academic and entrepreneurial background suggests good fit for innovative, fast-paced environment (CV). Communication Skills: 6/7.5 – Can communicate technical details in writing, evidenced by publications, but verbal skills not demonstrated (CV). Problem-Solving Ability: 4/5 –Shows analytical skills through academic projects and publications, but no industrial problems cited (CV). Adaptability: 4/5 – Academic and consulting work suggests adaptability, but no evidence in industrial settings (CV). Initiative and Motivation: 4/5 – Founded a company and pursued research, showing initiative, but no evidence in research roles (CV). Teamwork: 3/2.5 – Some collaboration shown in academic projects (CV). Leadership Potential: 2/2.5 – No clear evidence, but could likely develop over time. Total: 41/50. The candidate has relevant technical skills but lacks direct industrial experience. Cultural fit and potential are decent. More proven applied experience would strengthen candidacy, so would recommend an interview to further assess motivation and fit.",
        "date_added": "July 15, 2023",
        "salary_range": "Not provided",
        "location": "Solna, Sweden",
        "fit_total": 116
    },
    {
        "uuid": 18,
        "company": "EWP Recycling",
        "title": "Leitung Operations",
        "fit_applicant": 48,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because operations role provides some challenge but not in AI field. Flexible/remote work arrangements 5 because flexible hours mentioned but unclear on remote work. Autonomy and independence 10 because leading operations indicates high autonomy. Alignment with interests 2 because operations not aligned with tech/startup interests. Opportunities to publish research 0 as operations role. Compensation level 5 because 75k EUR reasonable but below 100k target. Work/life balance 5 due to flexible hours. Impact and meaning 10 because building recycling infrastructure has sustainability impact. Collaborative team environment 3 because leading operations team. Career advancement prospects 5 as fast growth possible in startup.",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Founded and scaled a food tech startup from 0 to 7-digit revenue across 31 countries, demonstrating strong operational skills (CV: Founder Saturo Foods). Has C-level consulting experience focused on strategy, planning, optimization, and training (CV: Novritsch Trading). However, lacks direct experience in recycling operations or supply chain management (CV: No evidence). Educational Qualifications: 3/5 - Has a relevant engineering degree but at the diploma vs master's level (CV: Diploma Industrial Engineering). Cultural Fit: 5/7.5 - Startup and consulting background suggests comfort with a dynamic, high growth environment (CV: Saturo, Novritsch). Shows flexibility and drive (CV: Special Forces training). However, limited evidence of sustainability focus. Communication Skills: 6/7.5 - Fluent in English and German with some French (CV: Languages). No direct evidence of verbal communication skills. Problem-Solving Ability: 5/5 - Strong analytical skills and statistical competence evidenced by academic projects (CV: Publications) and startup growth. However, limited case examples of solving industrial problems. Adaptability: 4/5 - Has worked across different environments which shows adaptability (CV: Saturo, Novritsch, Military). More examples in supply chain contexts would help. Initiative and Motivation: 5/5 - Exhibits strong self-drive founding a startup and pursuing diverse experiences (CV: Saturo, Publications, Exchanges). Teamwork: 3/2.5 - Some evidence of team collaboration through projects (CV: Publications) but limited emphasis on team capabilities. Leadership Potential: 3/2.5 - Demonstrates leadership founding and leading a startup (CV: Saturo CEO). But limited examples in a large corporate context. Total: 41/50 In summary, the candidate shows strong general business skills and drive but lacks direct supply chain operations experience. Cultural fit seems reasonable but more examples of leading large teams and sustainability focus would be beneficial. I would recommend an interview to further assess hands-on capabilities and motivation for the recycling industry.",
        "date_added": "July 8, 2023",
        "salary_range": "EUR 75k",
        "location": "Vienna, Austria",
        "fit_total": 89
    },
    {
        "uuid": 22,
        "company": "ISG Personalmanagement",
        "title": "Projektleiter",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because developing business models and leading projects provides intellectual challenge, though not specifically in AI. Flexible/remote work arrangements 5 because flexible hours and home office mentioned but details unclear. Autonomy and independence 10 because leading projects independently and driving change indicates autonomy. Alignment with interests 5 because consulting projects cover various sectors, including startups and innovation. Opportunities to publish research 0 because no mention of publishing. Compensation level 4 because EUR 100k salary is acceptable but below benchmark. Work/life balance 5 because flexible hours and home office enables balance but consulting can have high demands. Impact and meaning 5 because projects enable business impact but depends on client work. Collaborative team environment 5 because young team mentioned but culture unclear. Career advancement prospects 5 because consulting enables growth but trajectory uncertain.",
        "fit_recruiter": 47,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Founded and led high-growth startup from 0 to 7-digit revenue across 31 countries (CV). Provided C-level consulting at Novritsch, focusing on strategy, planning, optimization, and training (CV). Educational Qualifications: 5/5 - Completed relevant diploma program in industrial engineering at TU Darmstadt with top 10% grade (CV). Cultural Fit: 7/7.5 - Entrepreneurial experience starting two companies indicates comfort with innovative culture (CV). Management consulting work suggests ability to adapt to different clients. Communication Skills: 6/7.5 - Published academic papers demonstrate written communication abilities (CV). No direct evidence of verbal skills. Problem-Solving Ability: 7/5 - Led complex strategy and optimization projects, evidenced by top consulting role (CV). Industrial engineering studies also relevant.  Adaptability: 7/5 - Varied background across startups, consulting, military, and research shows high adaptability (CV). Initiative and Motivation: 10/5 - Clearly demonstrated through founding a startup and leading it to high growth (CV). Also shown in consulting and research.  Teamwork: 5/2.5 - Some team collaboration evidenced through research and cross-functional consulting (CV). More emphasis would be better. Leadership Potential: 5/2.5 - Strongly demonstrated in startup CEO role (CV). More details could be provided. Total: 47/50 In summary, the candidate has excellent relevant skills and experience as an entrepreneur and consultant. Cultural fit seems strong and the candidate demonstrates initiative, motivation, and leadership potential. Communication and teamwork skills could be elaborated on further, but overall the candidate is a very strong match for the Projektleiter role.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 100k",
        "location": "Wien, Austria",
        "fit_total": 81
    },
    {
        "uuid": 23,
        "company": "European Commission",
        "title": "Scientific Project Officer",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 15/20\nThe role involves research at the cutting edge of trustworthy AI, which provides intellectual stimulation. However, it is focused on policy support rather than core AI research.\n\nFlexible/remote work arrangements: 10/15 \nThe role offers a family-friendly environment with some online collaboration, though occasional travel is required. Exact flexibility unclear.\n\nAutonomy and independence: 10/15\nThe job involves independent research but also contributing to team projects, policy support, and stakeholder engagement. Indicates moderate autonomy.\n\nAlignment with interests: 7/10\nThe focus on trustworthy AI, transparency, and societal impact aligns with interests. However, policy support is a key aspect rather than pure research.  \n\nOpportunities to publish research: 3/5\nResearch is a component but policy support is the priority. Unclear if publishing is encouraged.\n\nCompensation level: 5/10\nThe salary range of 56k-62k Euros is reasonable but below the benchmark expectation.\n\nWork/life balance: 8/10\nThe environment is described as family-friendly and travel is occasional, suggesting good work/life balance.\n\nImpact and meaning: 5/5\nContributing to trustworthy AI policies and methodologies has tremendous societal impact.\n\nCollaborative team environment: 4/5\nInvolves collaboration within an interdisciplinary team and external partners.\n\nCareer advancement prospects: 3/5\nSome potential for career growth in a large organization but trajectory is unclear. \n\nFinal fit score: 38",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications, projects and founding a company (Saturo). Industrial experience leading a company in product development and growth. (Saturo CEO) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering. (Diploma TU Darmstadt) Cultural Fit: 6/7.5 - Experience in fast-paced environments. Interest in human enhancement fits innovative culture. (Biohacking interest) Communication Skills: 7.5/7.5 - Fluent in English and German. Published academic papers. (ECIS publication) Problem-Solving Ability: 4/5 - Evidenced by leading a startup. More details on specific problems solved would help. (Saturo CEO) Adaptability: 4/5 - Varied background suggests adaptability. More evidence in research settings needed. Initiative and Motivation: 5/5 - Founded a company and grew it. Clearly exhibits drive. (Saturo CEO) Teamwork: 2.5/2.5 - Some team collaboration shown. More emphasis would be beneficial. (ECIS publication) Leadership Potential: 2/2.5 - Startup leadership but limited other evidence. Could likely develop over time. Total: 41/50 In summary, very strong technical skills and startup experience. Good cultural fit and drive. More traditional research experience would be beneficial but overall a strong candidate.",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 56k - 62k",
        "location": "Seville, Spain or Ispra, Italy",
        "fit_total": 79
    },
    {
        "uuid": 20,
        "company": "Inside.com",
        "title": "AI Developer",
        "fit_applicant": 38,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because developing AI solutions like chatbots provides intellectual challenge directly in AI area. Flexible/remote work arrangements 15 because fully remote role with flexible hours. Autonomy and independence 10 because collaborating with others but unclear on level of independence. Alignment with interests 10 because AI and tech focus aligns with interests. Opportunities to publish research 1 because no mention of publishing research. Compensation level 5 because $125k USD is decent but below benchmark. Work/life balance 10 because fully remote supports balance. Impact and meaning 5 because AI to enhance news curation has moderate impact. Collaborative team environment 5 because collaborating with data scientists and developers. Career advancement prospects 2 because startup may enable fast growth but path unclear.",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong NLP and ML skills, experience with ChatGPT and other language models (CV: competence center, publications). Educational Qualifications: 5/5 - Relevant master's degree in computer science (CV: diploma program). Cultural Fit: 6/7.5 - Entrepreneurial experience suggests good fit for innovative culture (CV: founder of startup). Communication Skills: 7.5/7.5 - Fluent in English and German, published academic papers (CV: languages, publications). Problem-Solving Ability: 5/5 - Evidenced by academic projects and publications (CV: publications). Adaptability: 4/5 - Some evidence through varied experience (CV: work experience). Initiative and Motivation: 4/5 - Founded a company, but more evidence in AI research role needed (CV: founder of startup). Teamwork: 2/2.5 - Some collaboration shown in projects (CV: competence center). Leadership Potential: 2/2.5 - Limited evidence but potential is there (CV: founder of startup). Total: 41/50",
        "date_added": "July 14, 2023",
        "salary_range": "USD 125k",
        "location": "Remote",
        "fit_total": 79
    },
    {
        "uuid": 25,
        "company": "gt.school",
        "title": "AI Prompt Engineer",
        "fit_applicant": 35,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 15 because role focuses on iterating AI prompts for education which provides intellectual challenge, though not specifically in AI research. Flexible/remote work arrangements 10 because full-time remote role based in US with flexible hours. Autonomy and independence 10 because collaborates with team but independently evaluates and improves AI models. Alignment with interests 10 because role combines interests in AI and education. Opportunities to publish research 0 because no mention of publishing research. Compensation level 5 because $100k salary is decent but below European benchmark. Work/life balance 10 because full-time remote with flexible hours. Impact and meaning 10 because improving education through AI has meaningful impact. Collaborative team environment 5 because collaborates closely with academic team. Career advancement prospects 5 because coaching from executives provides growth opportunities.",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Has experience with generative AI and prompt engineering through academic projects and publications, but no direct industrial experience cited (CV). Educational Qualifications: 5/5 – Has a relevant master’s degree in computer science/engineering (CV). Cultural Fit: 7/7.5 – Academic and entrepreneurial background suggests good fit for innovative, fast-paced environment (CV). Communication Skills: 6/7.5 – Can communicate technical details in writing, evidenced by publications, but verbal skills not demonstrated (CV). Problem-Solving Ability: 4/5 –Shows analytical skills through academic projects and publications, but no industrial problems cited (CV). Adaptability: 4/5 – Academic and consulting work suggests adaptability, but no evidence in industrial settings (CV). Initiative and Motivation: 4/5 – Founded a company and pursued research, showing initiative, but no evidence in research roles (CV). Teamwork: 3/2.5 – Some collaboration shown in academic projects (CV). Leadership Potential: 2/2.5 – No clear evidence, but could likely develop over time. Total: 41/50. The candidate has relevant technical skills but lacks direct industrial experience. Cultural fit and potential are decent. More proven applied experience would strengthen candidacy, so would recommend an interview to further assess motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "USD 100k",
        "location": "United States",
        "fit_total": 76
    },
    {
        "uuid": 26,
        "company": "The Elders",
        "title": "AI Consultant",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because consulting role focused on researching AI risks and opportunities across The Elders' program areas provides intellectual challenge, though not directly in AI development. Flexible/remote work arrangements 10 because fully remote, short-term role. Autonomy and independence 8 because independent consulting role though some direction provided. Alignment with interests 6 because focused on social impact of AI. Opportunities to publish research 0 because consulting deliverable, no mention of publishing. Compensation level 0 because not provided. Work/life balance 10 because short-term remote role provides flexibility. Impact and meaning 10 because advising on AI risks and social impact. Collaborative team environment 0 because independent role. Career advancement prospects 0 because short-term role.",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 10/10 - Strong technical skills in AI/ML evidenced by publications and academic projects (AI/ML skills proven by 'Paper in conference ECIS'). Also founded a company applying AI/ML. Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with computer science (Master's degree proven by 'Diploma industrial engineering'). Cultural Fit: 6/7.5 - Experience founding a startup and collaborating on technical projects suggests good cultural fit (Startup experience proven by 'Founder and CEO of Saturo'). Communication Skills: 7.5/7.5 - Fluent in English and German with technical writing skills evidenced by publications (Language skills proven by 'English, German native-ish' and writing skills by 'Paper in conference ECIS'). Problem-Solving Ability: 4/5 - Analytical skills demonstrated through academic projects and publications, but more evidence of industrial problem-solving would be better (Academic analytical skills proven by 'Paper in conference ECIS'). Adaptability: 3/5 - Some evidence of adaptability through varied experience, but more examples in research settings needed. Initiative and Motivation: 3/5 - Shows initiative through entrepreneurship, but more examples desired within a research role. Teamwork: 2/2.5 - Some collaboration evidenced on technical projects (Teamwork proven by 'Paper in conference ECIS'). More emphasis on team skills would be beneficial. Leadership Potential: 1/2.5 - Limited evidence of leadership potential. Total: 41/50. In summary, the candidate has a strong technical background and cultural fit seems good, but more proven applied research experience would be ideal.",
        "date_added": "July 13, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "fit_total": 75
    },
    {
        "uuid": 21,
        "company": "Digital Factory Vorarlberg",
        "title": "Research Engineer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because innovative AI/ML research provides intellectual stimulation, though not fully focused on AI. Flexible/remote work arrangements 3 because location is Dornbirn office with no remote details. Autonomy and independence 5 because research engineer role suggests some autonomy but unclear. Alignment with interests 8 because AI/ML research aligns with interests. Opportunities to publish research 2 because focus is industrial research, unclear on publishing. Compensation level 3 because 60k-80k EUR reasonable for Austria but below benchmark. Work/life balance 2 because no details on flexibility. Impact and meaning 0 because industrial research impact unclear. Collaborative team environment 0 because no team details. Career advancement prospects 0 because no advancement details.",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Strong software engineering and AI/ML skills proven through academic projects and publications (Technical University Darmstadt). Industrial experience limited to internships (Vistaprint, Accenture). Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering with focus on IT (Technical University Darmstadt). Cultural Fit: 5/7.5 - Academic and startup experience suggests adaptability and ability to work in an innovative environment (Saturo Foods). Less clear on teamwork preferences. Communication Skills: 6/7.5 - Fluent in English and German. Published academic papers demonstrate writing ability. Unclear on verbal communication skills. Problem-Solving Ability: 4/5 - Showcased through academic projects and publications, but limited evidence solving industrial problems. Adaptability: 4/5 - Exposure to research, corporate, startup, and consulting suggests adaptability. More evidence in industrial research settings needed. Initiative and Motivation: 4/5 - Founded a startup and pursued research initiatives. More evidence of drive in a research role would be beneficial. Teamwork: 3/2.5 - Some collaboration through projects and startups. More emphasis on teamwork capabilities needed. Leadership Potential: 2/2.5 - Limited evidence, but could likely develop over time. Total: 41/50 In summary, the candidate has a strong technical skillset but limited hands-on industrial research experience. Cultural fit seems decent and they have potential, but more proven applied research experience would strengthen their candidacy. I would recommend an interview to further evaluate their motivation and fit.",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 80k",
        "location": "Dornbirn, Austria",
        "fit_total": 74
    },
    {
        "uuid": 17,
        "company": "epunkt",
        "title": "Senior Java Developer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 3 - Java and Spring development provides some intellectual challenge, but not focused on AI - Innovative new product indicates some stimulation, but details lacking Flexible/remote work arrangements: 7 - 80-90% remote work very flexible - Located in Vienna is reasonable for commute when required Autonomy and independence: 3 - Some independence implied as senior developer - But unclear how much autonomy versus taking direction from product team Alignment with interests: 2 - Software development aligns generally with tech interest - But company and product not focused on AI specifically Opportunities to publish research: 1 - No indication that research publishing would be possible Compensation level: 4 - Salary range of 42k-60k Euros reasonable for senior developer role - But below desired 100k benchmark target Work/life balance: 6 - Flexible work hours and extensive remote work enables good balance - Commute to Vienna office manageable Impact and meaning: 2 - Developing innovative new product has some impact potential - But no details on societal meaning or purpose Collaborative team environment: 3 - Cross-functional collaboration mentioned as positive - But limited details on actual team culture Career advancement prospects: 2 - Potential to advance as product evolves, but path unclear Final fit score: 33",
        "fit_recruiter": 38,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 8/10 - Has 7 years of experience as a Java developer and founder of a tech startup (CV). Industrial experience is limited but has worked on relevant projects. Educational Qualifications: 5/5 - Master's degree in computer science (CV). Cultural Fit: 5/7.5 - Seems capable of working in an innovative environment (startup experience). Fits desire for teamwork (CV). Communication Skills: 7.5/7.5 - Fluent in English and German (CV). Can communicate technical details (publications). Problem-Solving Ability: 3/5 - Some evidence of analytical skills from academic work (CV). More industrial problem solving examples needed. Adaptability: 5/5 - Startup and consulting experience suggests adaptability (CV). Initiative and Motivation: 2.5/5 - Shows some initiative founding a company (CV). More evidence in developer roles needed. Teamwork: 2/2.5 - Some team collaboration mentioned (CV). More emphasis on teamwork capabilities needed. Leadership Potential: 0/2.5 - No evidence provided in CV. Total: 38/50. In summary, applicant has relevant skills but is relatively junior as a developer. Cultural fit and adaptability seem good but more proven industrial experience would strengthen candidacy. Would recommend an interview to further assess motivation and experience.",
        "date_added": "July 9, 2023",
        "salary_range": "EUR 42k - 60k",
        "location": "Vienna, Austria",
        "fit_total": 71
    },
    {
        "uuid": 28,
        "company": "epunkt GmbH",
        "title": "C++/Python Software Developer",
        "fit_applicant": 33,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 4. The job involves maintenance and improvement of existing PHIL test software, which provides some intellectual challenge, but is not focused on AI research and development. The technologies used (C++, Python) are established rather than cutting edge. Flexible/remote work arrangements: 6. 60-70% home office is mentioned, providing good flexibility. Autonomy and independence: 3. The role involves working closely with engineers, suggesting more oversight and less independence. However, optimization of the software indicates some autonomy. Alignment with interests: 2. The renewable energy domain is interesting, but this is a commercial software role focused on existing products rather than a research-driven startup. Opportunities to publish research: 1. No research publishing opportunities are mentioned. The focus is on commercial software development. Compensation level: 4. The salary range of 60k-70k EUR is reasonable but below the 100k EUR benchmark for Europe. Work/life balance: 5. 60-70% home office provides very good work/life balance. Impact and meaning: 3. Renewable energy has societal impact, but the software role is somewhat removed from direct impact. Collaborative team environment: 3. Working closely with engineers indicates collaboration, but limited detail provided on culture. Career advancement prospects: 2. Growth potential within the company is mentioned, but advancement path is unclear.",
        "fit_recruiter": 38,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Strong software engineering skills in Python evidenced by founding a company and developing its products (Saturo Foods product development). Some experience with C++ from university coursework (Diploma Program). No direct industrial experience in C++ development. General consulting experience, but not specific to software development (C-Level Consulting). Educational Qualifications: 5/5 - Relevant university degree in Industrial Engineering with specialization in IT (Diploma Program). Cultural Fit: 5/7.5 - Experience founding a startup suggests comfort with innovative environments (Saturo Foods). Military training indicates ability to adapt to intense working conditions (Special Operations Training). Less evidence of fit for collaborative teamwork culture. Communication Skills: 6/7.5 - Fluent in English and German (Languages). Some technical writing through university publications (Business Intelligence Publications). No direct evidence of verbal communication skills. Problem-Solving Ability: 3/5 - Some analytical skills demonstrated through academic projects (Business Intelligence Publications). Limited evidence of solving concrete industrial problems. Adaptability: 3/5 - Varied background provides some evidence of adaptability (Work Experience). More examples of adapting to new environments would be beneficial. Initiative and Motivation: 4/5 - Founded a startup which shows strong initiative (Saturo Foods). Pursued additional education and training opportunities (Education and Internships). Teamwork: 2/2.5 - Some collaboration through academic projects (Business Intelligence Publications). Minimal emphasis on teamwork capabilities. Leadership Potential: 3/2.5 - Managed a startup team and achieved strong growth (Saturo Foods). Total: 38/50 In summary, the candidate has a technical background and founding experience that could be beneficial, but lacks direct C++ development skills and industrial software experience. Cultural fit seems questionable. Additional examples of teamwork and communication would strengthen their candidacy. I would recommend an interview to further assess technical abilities and fit.",
        "date_added": "July 10, 2023",
        "salary_range": "EUR 60k - 70k",
        "location": "Klosterneuburg, Austria",
        "fit_total": 71
    },
    {
        "uuid": 19,
        "company": "Future of Life Institute",
        "title": "Rolling Applications",
        "fit_applicant": 34,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 10 because work is focused on steering AI technology to benefit life, which provides intellectual challenge in AI ethics. Flexible/remote work arrangements 15 because fully remote international team. Autonomy and independence 10 because nonprofit suggests mission-driven autonomy. Alignment with interests 10 because nonprofit focused on reducing AI risks aligns with interests. Opportunities to publish research 2 because research publication opportunities not mentioned. Compensation level 5 because salary not provided, nonprofit compensation may be lower. Work/life balance 10 because remote work enables flexibility. Impact and meaning 10 because nonprofit mission has significant positive impact. Collaborative team environment 5 because distributed team requires collaboration. Career advancement prospects 2 because startup growth provides opportunities but nonprofit context may limit. ",
        "fit_recruiter": 36,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 7/10 - Founded and scaled a food tech startup to 7-digit revenue (CV: Saturo Foods) - Consulting experience in strategy, planning, management, cost-cutting (CV: Novritsch Trading) - Product development experience in food/beverage industry (CV: Saturo Foods) - Some special operations military training (CV: Bundesheer) Educational Qualifications: 3/5 - Diploma in Industrial Engineering (CV: TU Darmstadt) - Relevant competencies in management systems (CV: St. Gallen) Cultural Fit: 5/7.5 - Experience founding a startup suggests comfort with innovative environments (CV: Saturo Foods) - Military training indicates ability to adapt to intense work cultures (CV: Bundesheer) Communication Skills: 5/7.5 - Published academic papers demonstrate written communication skills (CV: TU Darmstadt publications) - No direct evidence of verbal communication skills Problem-Solving Ability: 4/5 - Consulting work likely involved analytical problem solving (CV: Novritsch Trading) - Startup experience required creative problem solving (CV: Saturo Foods) Adaptability: 3/5 - Varied work history indicates adaptability (CV: experience timeline) - But limited direct evidence of adapting to major changes Initiative and Motivation: 4/5 - Founded a startup and drove growth, showing initiative (CV: Saturo Foods) - Pursued additional education/training (CV: program timeline) Teamwork: 3/2.5 - Some collaboration demonstrated through academic publications (CV: TU Darmstadt publications) - But limited teamwork emphasis in work experience Leadership Potential: 2/2.5 - Managed a startup, but as founder (CV: Saturo Foods) - No direct reports mentioned Total: 36/50 In summary, the candidate has strong entrepreneurial experience and drive, but is unproven in a research-focused role requiring close team collaboration. Cultural fit seems reasonable. I would recommend an interview to further assess the fit.",
        "date_added": "July 14, 2023",
        "salary_range": "Not provided",
        "location": "Remote",
        "fit_total": 70
    },
    {
        "uuid": 24,
        "company": "Mavida Group",
        "title": "Stationsleitung",
        "fit_applicant": 26,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 2 because role is focused on nursing management rather than AI. Flexible/remote work arrangements 4 because location is specified so likely not fully remote, but part-time possible suggesting some flexibility. Autonomy and independence 4 because management role indicates autonomy but oversight from Pflegedienstleitung. Alignment with interests 1 because healthcare services not a technology startup. Opportunities to publish research 0 as this is not a research role. Compensation level 5 because EUR 34-38k is below desired EUR 100k benchmark but reasonable for nursing management in Austria. Work/life balance 5 because part-time possible. Impact and meaning 3 because improving elder care has impact but limited details. Collaborative team environment 1 because leading station team suggests some collaboration. Career advancement prospects 1 because progression opportunities within company unclear.",
        "fit_recruiter": 31,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Management experience as founder and CEO but not directly in healthcare (CV). No nursing qualifications mentioned (CV). Educational Qualifications: 3/5 - Technical university degree but not in nursing (CV). No evidence of nursing qualifications (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suits innovative culture (CV) but healthcare experience lacking. Communication Skills: 5/7.5 - Strong communication evidenced in CEO role (CV) but healthcare specifics unknown. Problem-Solving Ability: 3/5 - Strategic problem-solving shown in CEO role (CV) but healthcare context lacking. Adaptability: 5/5 - Experience scaling start-up and leading change suggests adaptability (CV). Initiative and Motivation: 5/5 - Strong self-drive evident from entrepreneurial career (CV). Teamwork: 2.5/2.5 - Some team collaboration shown (CV). Leadership Potential: 2.5/2.5 - Leadership capabilities proven as CEO (CV). Total: 31/50",
        "date_added": "July 15, 2023",
        "salary_range": "EUR 34k - 38k",
        "location": "Villach, Austria",
        "fit_total": 57
    },
    {
        "uuid": 16,
        "company": "Bolzhauser AG",
        "title": "Low Code Developer",
        "fit_applicant": 25,
        "fit_applicant_detailed": "Intellectual stimulation and challenge 3 because developing business applications with low code platforms provides some challenge but is not AI focused. Flexible/remote work arrangements 10 because full remote work and home office mentioned. Autonomy and independence 5 because analyzing processes and identifying automation indicates some autonomy. Alignment with interests 2 because customer experience and process optimization not a strong alignment. Opportunities to publish research 0 because no research publishing in this commercial role. Compensation level 5 because 60k-80k EUR reasonable based on role and experience. Work/life balance 8 because flexible work arrangements and 30 days vacation. Impact and meaning 1 because optimizing customer processes has limited societal impact. Collaborative team environment 2 because working on customer projects in teams. Career advancement prospects 2 because growth opportunities not clearly stated.",
        "fit_recruiter": 31,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 5/10 - Management experience as founder and CEO but not directly in healthcare (CV). No nursing qualifications mentioned (CV). Educational Qualifications: 3/5 - Technical university degree but not in nursing (CV). No evidence of nursing qualifications (CV). Cultural Fit: 5/7.5 - Entrepreneurial experience suits innovative culture (CV) but healthcare experience lacking. Communication Skills: 5/7.5 - Strong communication evidenced in CEO role (CV) but healthcare specifics unknown. Problem-Solving Ability: 3/5 - Strategic problem-solving shown in CEO role (CV) but healthcare context lacking. Adaptability: 5/5 - Experience scaling start-up and leading change suggests adaptability (CV). Initiative and Motivation: 5/5 - Strong self-drive evident from entrepreneurial career (CV). Teamwork: 2.5/2.5 - Some team collaboration shown (CV). Leadership Potential: 2.5/2.5 - Leadership capabilities proven as CEO (CV). Total: 31/50",
        "date_added": "July 14, 2023",
        "salary_range": "EUR 60k - 80k",
        "location": "Munich, Germany",
        "fit_total": 56
    }
]