[
    {
        "uuid": "15ce34ec-27cb-482a-b2b4-a2c6bcc3f33a",
        "company": "Anton Paar",
        "title": "AI Manager",
        "fit_applicant": 27,
        "fit_applicant_detailed": "Intellectual stimulation and challenge: 4\nThe role involves identifying use cases for AI across the business, which provides some intellectual stimulation, however AI integration itself may not be highly technical. The core focus is not AI research and development.\n\nFlexible/remote work arrangements: 2  \nThe role is based in Graz, Austria and no remote work is mentioned. Likely limited flexibility.\n\nAutonomy and independence: 4\nThe role involves leading projects and driving AI adoption, suggesting reasonable autonomy. However, needs to collaborate with stakeholders across the business.\n\nAlignment with interests in technology, startups, risk: 3\nEstablished instrumentation company, not a high risk technology startup environment. But AI integration provides exposure to innovative technology.\n\nOpportunities to publish research: 1\nNo research publishing mentioned. Focus is on internal AI integration.\n\nCompensation level: 3 \nSalary range of EUR 80-100k is reasonable for the role and location. But at low end of desired compensation.\n\nWork/life balance: 3\nNo explicit work-life balance provisions mentioned. Standard full-time on-site role likely.\n\nImpact and meaning: 2\nEnabling more effective use of AI across the business has modest impact. But core products not focused on social impact.\n\nCollaborative team environment: 3\nNeed to collaborate with stakeholders, but limited detail provided on culture.\n\nCareer advancement prospects: 2\nEstablished company may provide stability but unclear if rapid advancement opportunities.\n\nTotal fit score: 27",
        "fit_recruiter": 41,
        "fit_recruiter_detailed": "Relevant Skills and Experience: 9/10 - Strong AI/ML skills and software engineering skills (AI/ML skills, founded AI food company) - Industrial experience limited but has data science projects (data science projects)  - Worked at high-growth startups (founded and grew food startup) Educational Qualifications: 5/5 - Relevant master's degree in industrial engineering (diploma industrial engineering)  Cultural Fit: 5/7.5 - Experience in innovative startups suggests cultural fit (founded multiple startups) - Collaborative approach evidenced by team projects (cross-functional team projects) Communication Skills: 6/7.5  - Communicates technical details in English and German (languages on CV) - Publishing papers demonstrates communication skills (multiple publications) Problem-Solving Ability: 3/5 - Analytical skills shown in academic work (publications at conferences) - But limited evidence of industrial problem solving Adaptability: 3/5 - Startup experience suggests adaptability (founded startups) - But limited evidence adapting in industrial research Initiative and Motivation: 4/5 - Founded multiple companies showing initiative (founded startups) - But more evidence needed in research/technical roles Teamwork: 3/2.5 - Some team collaboration evidenced (cross-functional team projects) Leadership Potential: 3/2.5 - Leadership potential evidenced by managing startups (founded and managed startups) Total: 41/50 In summary, the candidate has strong technical skills and startup experience suggesting good cultural fit and initiative. However, he lacks proven experience in an industrial research environment. Additional leadership evidence in research would strengthen his candidacy. I would recommend an interview to further assess his motivation and fit.",
        "date_added": "July 20, 2023",
        "salary_range": "EUR 80k - 100k",
        "location": "Graz, Austria",
        "fit_total": 68
    }
]